TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
       3                    ;* Date/Time created: Fri Apr  2 00:57:45 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../CC2640R2_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
      13                            .bound  ".TI.bound:flashBuf", 106496, 0
      14                            .noinit ".TI.bound:flashBuf"

    4446                            .dwattr $C$DW$272, DW_AT_decl_column(0x05)
    4447                    
    4448                    $C$DW$273       .dwtag  DW_TAG_enumerator
    4449                            .dwattr $C$DW$273, DW_AT_name("RF_AllowDelayAny")
    4450                            .dwattr $C$DW$273, DW_AT_const_value(-1)
    4451                            .dwattr $C$DW$273, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4452                            .dwattr $C$DW$273, DW_AT_decl_line(0x65d)
    4453                            .dwattr $C$DW$273, DW_AT_decl_column(0x05)
    4454                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   82

    4455                            .dwattr $C$DW$T$1358, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/d
    4456                            .dwattr $C$DW$T$1358, DW_AT_decl_line(0x65b)
    4457                            .dwattr $C$DW$T$1358, DW_AT_decl_column(0x0e)
    4458                            .dwendtag $C$DW$T$1358
    4459                    
    4460                    $C$DW$T$1359    .dwtag  DW_TAG_typedef
    4461                            .dwattr $C$DW$T$1359, DW_AT_name("RF_AllowDelay")
    4462                            .dwattr $C$DW$T$1359, DW_AT_type(*$C$DW$T$1358)
    4463                            .dwattr $C$DW$T$1359, DW_AT_language(DW_LANG_C)
    4464                            .dwattr $C$DW$T$1359, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/d
    4465                            .dwattr $C$DW$T$1359, DW_AT_decl_line(0x65e)
    4466                            .dwattr $C$DW$T$1359, DW_AT_decl_column(0x03)
    4467                    
    4468                    
    4469                    $C$DW$T$1360    .dwtag  DW_TAG_enumeration_type
    4470                            .dwattr $C$DW$T$1360, DW_AT_byte_size(0x01)
    4471                    $C$DW$274       .dwtag  DW_TAG_enumerator
    4472                            .dwattr $C$DW$274, DW_AT_name("RF_RatChannelAny")
    4473                            .dwattr $C$DW$274, DW_AT_const_value(-1)
    4474                            .dwattr $C$DW$274, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4475                            .dwattr $C$DW$274, DW_AT_decl_line(0x67e)
    4476                            .dwattr $C$DW$274, DW_AT_decl_column(0x05)
    4477                    
    4478                    $C$DW$275       .dwtag  DW_TAG_enumerator
    4479                            .dwattr $C$DW$275, DW_AT_name("RF_RatChannel0")
    4480                            .dwattr $C$DW$275, DW_AT_const_value(0x00)
    4481                            .dwattr $C$DW$275, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4482                            .dwattr $C$DW$275, DW_AT_decl_line(0x67f)
    4483                            .dwattr $C$DW$275, DW_AT_decl_column(0x05)
    4484                    
    4485                    $C$DW$276       .dwtag  DW_TAG_enumerator
    4486                            .dwattr $C$DW$276, DW_AT_name("RF_RatChannel1")
    4487                            .dwattr $C$DW$276, DW_AT_const_value(0x01)
    4488                            .dwattr $C$DW$276, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4489                            .dwattr $C$DW$276, DW_AT_decl_line(0x680)
    4490                            .dwattr $C$DW$276, DW_AT_decl_column(0x05)
    4491                    
    4492                    $C$DW$277       .dwtag  DW_TAG_enumerator
    4493                            .dwattr $C$DW$277, DW_AT_name("RF_RatChannel2")
    4494                            .dwattr $C$DW$277, DW_AT_const_value(0x02)
    4495                            .dwattr $C$DW$277, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4496                            .dwattr $C$DW$277, DW_AT_decl_line(0x681)
    4497                            .dwattr $C$DW$277, DW_AT_decl_column(0x05)
    4498                    
    4499                            .dwattr $C$DW$T$1360, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/d
    4500                            .dwattr $C$DW$T$1360, DW_AT_decl_line(0x67d)
    4501                            .dwattr $C$DW$T$1360, DW_AT_decl_column(0x0e)
    4502                            .dwendtag $C$DW$T$1360
    4503                    
    4504                    $C$DW$T$1361    .dwtag  DW_TAG_typedef
    4505                            .dwattr $C$DW$T$1361, DW_AT_name("RF_RatSelectChannel")
    4506                            .dwattr $C$DW$T$1361, DW_AT_type(*$C$DW$T$1360)
    4507                            .dwattr $C$DW$T$1361, DW_AT_language(DW_LANG_C)
    4508                            .dwattr $C$DW$T$1361, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/d
    4509                            .dwattr $C$DW$T$1361, DW_AT_decl_line(0x682)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   83

    4510                            .dwattr $C$DW$T$1361, DW_AT_decl_column(0x03)
    4511                    
    4512                    
    4513                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4514                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
    4515                    $C$DW$278       .dwtag  DW_TAG_member
    4516                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$23)
    4517                            .dwattr $C$DW$278, DW_AT_name("samplesRequestedCount")
    4518                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("samplesRequestedCount")
    4519                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4520                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4521                            .dwattr $C$DW$278, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4522                            .dwattr $C$DW$278, DW_AT_decl_line(0x143)
    4523                            .dwattr $C$DW$278, DW_AT_decl_column(0x0e)
    4524                    
    4525                    $C$DW$279       .dwtag  DW_TAG_member
    4526                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$3)
    4527                            .dwattr $C$DW$279, DW_AT_name("sampleBuffer")
    4528                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("sampleBuffer")
    4529                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4530                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4531                            .dwattr $C$DW$279, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4532                            .dwattr $C$DW$279, DW_AT_decl_line(0x14a)
    4533                            .dwattr $C$DW$279, DW_AT_decl_column(0x0f)
    4534                    
    4535                    $C$DW$280       .dwtag  DW_TAG_member
    4536                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$3)
    4537                            .dwattr $C$DW$280, DW_AT_name("sampleBufferTwo")
    4538                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("sampleBufferTwo")
    4539                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4540                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4541                            .dwattr $C$DW$280, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4542                            .dwattr $C$DW$280, DW_AT_decl_line(0x155)
    4543                            .dwattr $C$DW$280, DW_AT_decl_column(0x0f)
    4544                    
    4545                    $C$DW$281       .dwtag  DW_TAG_member
    4546                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$3)
    4547                            .dwattr $C$DW$281, DW_AT_name("arg")
    4548                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("arg")
    4549                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4550                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4551                            .dwattr $C$DW$281, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4552                            .dwattr $C$DW$281, DW_AT_decl_line(0x161)
    4553                            .dwattr $C$DW$281, DW_AT_decl_column(0x0f)
    4554                    
    4555                    $C$DW$282       .dwtag  DW_TAG_member
    4556                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$25)
    4557                            .dwattr $C$DW$282, DW_AT_name("adcChannel")
    4558                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("adcChannel")
    4559                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4560                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4561                            .dwattr $C$DW$282, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4562                            .dwattr $C$DW$282, DW_AT_decl_line(0x168)
    4563                            .dwattr $C$DW$282, DW_AT_decl_column(0x0e)
    4564                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   84

    4565                            .dwattr $C$DW$T$26, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4566                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x13c)
    4567                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    4568                            .dwendtag $C$DW$T$26
    4569                    
    4570                    $C$DW$T$31      .dwtag  DW_TAG_typedef
    4571                            .dwattr $C$DW$T$31, DW_AT_name("ADCBuf_Conversion")
    4572                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$26)
    4573                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4574                            .dwattr $C$DW$T$31, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4575                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x169)
    4576                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    4577                    
    4578                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4579                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    4580                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    4581                    
    4582                    
    4583                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4584                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x18)
    4585                    $C$DW$283       .dwtag  DW_TAG_member
    4586                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$25)
    4587                            .dwattr $C$DW$283, DW_AT_name("blockingTimeout")
    4588                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("blockingTimeout")
    4589                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4590                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4591                            .dwattr $C$DW$283, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4592                            .dwattr $C$DW$283, DW_AT_decl_line(0x1f0)
    4593                            .dwattr $C$DW$283, DW_AT_decl_column(0x1c)
    4594                    
    4595                    $C$DW$284       .dwtag  DW_TAG_member
    4596                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$25)
    4597                            .dwattr $C$DW$284, DW_AT_name("samplingFrequency")
    4598                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("samplingFrequency")
    4599                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4600                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4601                            .dwattr $C$DW$284, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4602                            .dwattr $C$DW$284, DW_AT_decl_line(0x1f7)
    4603                            .dwattr $C$DW$284, DW_AT_decl_column(0x1c)
    4604                    
    4605                    $C$DW$285       .dwtag  DW_TAG_member
    4606                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$28)
    4607                            .dwattr $C$DW$285, DW_AT_name("returnMode")
    4608                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("returnMode")
    4609                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4610                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4611                            .dwattr $C$DW$285, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4612                            .dwattr $C$DW$285, DW_AT_decl_line(0x1fa)
    4613                            .dwattr $C$DW$285, DW_AT_decl_column(0x1c)
    4614                    
    4615                    $C$DW$286       .dwtag  DW_TAG_member
    4616                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$35)
    4617                            .dwattr $C$DW$286, DW_AT_name("callbackFxn")
    4618                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("callbackFxn")
    4619                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   85

    4620                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4621                            .dwattr $C$DW$286, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4622                            .dwattr $C$DW$286, DW_AT_decl_line(0x200)
    4623                            .dwattr $C$DW$286, DW_AT_decl_column(0x1c)
    4624                    
    4625                    $C$DW$287       .dwtag  DW_TAG_member
    4626                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$37)
    4627                            .dwattr $C$DW$287, DW_AT_name("recurrenceMode")
    4628                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("recurrenceMode")
    4629                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4630                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4631                            .dwattr $C$DW$287, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4632                            .dwattr $C$DW$287, DW_AT_decl_line(0x203)
    4633                            .dwattr $C$DW$287, DW_AT_decl_column(0x1c)
    4634                    
    4635                    $C$DW$288       .dwtag  DW_TAG_member
    4636                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$3)
    4637                            .dwattr $C$DW$288, DW_AT_name("custom")
    4638                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("custom")
    4639                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4640                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4641                            .dwattr $C$DW$288, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4642                            .dwattr $C$DW$288, DW_AT_decl_line(0x206)
    4643                            .dwattr $C$DW$288, DW_AT_decl_column(0x0b)
    4644                    
    4645                            .dwattr $C$DW$T$38, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4646                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x1e3)
    4647                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    4648                            .dwendtag $C$DW$T$38
    4649                    
    4650                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    4651                            .dwattr $C$DW$T$51, DW_AT_name("ADCBuf_Params")
    4652                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$38)
    4653                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4654                            .dwattr $C$DW$T$51, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4655                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x207)
    4656                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    4657                    
    4658                    $C$DW$T$52      .dwtag  DW_TAG_const_type
    4659                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    4660                    
    4661                    $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    4662                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    4663                            .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    4664                    
    4665                    
    4666                    $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4667                            .dwattr $C$DW$T$75, DW_AT_byte_size(0x24)
    4668                    $C$DW$289       .dwtag  DW_TAG_member
    4669                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$41)
    4670                            .dwattr $C$DW$289, DW_AT_name("closeFxn")
    4671                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("closeFxn")
    4672                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4673                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4674                            .dwattr $C$DW$289, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   86

    4675                            .dwattr $C$DW$289, DW_AT_decl_line(0x25b)
    4676                            .dwattr $C$DW$289, DW_AT_decl_column(0x2b)
    4677                    
    4678                    $C$DW$290       .dwtag  DW_TAG_member
    4679                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$49)
    4680                            .dwattr $C$DW$290, DW_AT_name("controlFxn")
    4681                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("controlFxn")
    4682                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4683                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4684                            .dwattr $C$DW$290, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4685                            .dwattr $C$DW$290, DW_AT_decl_line(0x25d)
    4686                            .dwattr $C$DW$290, DW_AT_decl_column(0x2b)
    4687                    
    4688                    $C$DW$291       .dwtag  DW_TAG_member
    4689                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$50)
    4690                            .dwattr $C$DW$291, DW_AT_name("initFxn")
    4691                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("initFxn")
    4692                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4693                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4694                            .dwattr $C$DW$291, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4695                            .dwattr $C$DW$291, DW_AT_decl_line(0x25f)
    4696                            .dwattr $C$DW$291, DW_AT_decl_column(0x2b)
    4697                    
    4698                    $C$DW$292       .dwtag  DW_TAG_member
    4699                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$56)
    4700                            .dwattr $C$DW$292, DW_AT_name("openFxn")
    4701                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("openFxn")
    4702                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4703                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4704                            .dwattr $C$DW$292, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4705                            .dwattr $C$DW$292, DW_AT_decl_line(0x261)
    4706                            .dwattr $C$DW$292, DW_AT_decl_column(0x2b)
    4707                    
    4708                    $C$DW$293       .dwtag  DW_TAG_member
    4709                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$59)
    4710                            .dwattr $C$DW$293, DW_AT_name("convertFxn")
    4711                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("convertFxn")
    4712                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4713                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4714                            .dwattr $C$DW$293, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4715                            .dwattr $C$DW$293, DW_AT_decl_line(0x263)
    4716                            .dwattr $C$DW$293, DW_AT_decl_column(0x2b)
    4717                    
    4718                    $C$DW$294       .dwtag  DW_TAG_member
    4719                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$62)
    4720                            .dwattr $C$DW$294, DW_AT_name("convertCancelFxn")
    4721                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("convertCancelFxn")
    4722                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4723                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4724                            .dwattr $C$DW$294, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4725                            .dwattr $C$DW$294, DW_AT_decl_line(0x266)
    4726                            .dwattr $C$DW$294, DW_AT_decl_column(0x2b)
    4727                    
    4728                    $C$DW$295       .dwtag  DW_TAG_member
    4729                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$65)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   87

    4730                            .dwattr $C$DW$295, DW_AT_name("getResolutionFxn")
    4731                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("getResolutionFxn")
    4732                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4733                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4734                            .dwattr $C$DW$295, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4735                            .dwattr $C$DW$295, DW_AT_decl_line(0x268)
    4736                            .dwattr $C$DW$295, DW_AT_decl_column(0x2b)
    4737                    
    4738                    $C$DW$296       .dwtag  DW_TAG_member
    4739                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$70)
    4740                            .dwattr $C$DW$296, DW_AT_name("adjustRawValuesFxn")
    4741                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("adjustRawValuesFxn")
    4742                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4743                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4744                            .dwattr $C$DW$296, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4745                            .dwattr $C$DW$296, DW_AT_decl_line(0x26b)
    4746                            .dwattr $C$DW$296, DW_AT_decl_column(0x2b)
    4747                    
    4748                    $C$DW$297       .dwtag  DW_TAG_member
    4749                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$74)
    4750                            .dwattr $C$DW$297, DW_AT_name("convertAdjustedToMicroVoltsFxn")
    4751                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("convertAdjustedToMicroVoltsFxn")
    4752                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4753                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4754                            .dwattr $C$DW$297, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4755                            .dwattr $C$DW$297, DW_AT_decl_line(0x26d)
    4756                            .dwattr $C$DW$297, DW_AT_decl_column(0x2b)
    4757                    
    4758                            .dwattr $C$DW$T$75, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4759                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x259)
    4760                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x01)
    4761                            .dwendtag $C$DW$T$75
    4762                    
    4763                    $C$DW$T$703     .dwtag  DW_TAG_typedef
    4764                            .dwattr $C$DW$T$703, DW_AT_name("ADCBuf_FxnTable")
    4765                            .dwattr $C$DW$T$703, DW_AT_type(*$C$DW$T$75)
    4766                            .dwattr $C$DW$T$703, DW_AT_language(DW_LANG_C)
    4767                            .dwattr $C$DW$T$703, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4768                            .dwattr $C$DW$T$703, DW_AT_decl_line(0x26e)
    4769                            .dwattr $C$DW$T$703, DW_AT_decl_column(0x03)
    4770                    
    4771                    $C$DW$T$704     .dwtag  DW_TAG_const_type
    4772                            .dwattr $C$DW$T$704, DW_AT_type(*$C$DW$T$703)
    4773                    
    4774                    $C$DW$T$705     .dwtag  DW_TAG_pointer_type
    4775                            .dwattr $C$DW$T$705, DW_AT_type(*$C$DW$T$704)
    4776                            .dwattr $C$DW$T$705, DW_AT_address_class(0x20)
    4777                    
    4778                    
    4779                    $C$DW$T$77      .dwtag  DW_TAG_structure_type
    4780                            .dwattr $C$DW$T$77, DW_AT_byte_size(0x08)
    4781                    $C$DW$298       .dwtag  DW_TAG_member
    4782                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$3)
    4783                            .dwattr $C$DW$298, DW_AT_name("custom")
    4784                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("custom")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   88

    4785                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4786                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4787                            .dwattr $C$DW$298, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4788                            .dwattr $C$DW$298, DW_AT_decl_line(0x103)
    4789                            .dwattr $C$DW$298, DW_AT_decl_column(0x0e)
    4790                    
    4791                    $C$DW$299       .dwtag  DW_TAG_member
    4792                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$76)
    4793                            .dwattr $C$DW$299, DW_AT_name("isProtected")
    4794                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("isProtected")
    4795                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4796                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4797                            .dwattr $C$DW$299, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4798                            .dwattr $C$DW$299, DW_AT_decl_line(0x105)
    4799                            .dwattr $C$DW$299, DW_AT_decl_column(0x0d)
    4800                    
    4801                            .dwattr $C$DW$T$77, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4802                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x102)
    4803                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x10)
    4804                            .dwendtag $C$DW$T$77
    4805                    
    4806                    $C$DW$T$94      .dwtag  DW_TAG_typedef
    4807                            .dwattr $C$DW$T$94, DW_AT_name("ADC_Params")
    4808                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$77)
    4809                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    4810                            .dwattr $C$DW$T$94, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4811                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x10c)
    4812                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x03)
    4813                    
    4814                    $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    4815                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    4816                            .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
    4817                    
    4818                    
    4819                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    4820                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x18)
    4821                    $C$DW$300       .dwtag  DW_TAG_member
    4822                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$82)
    4823                            .dwattr $C$DW$300, DW_AT_name("closeFxn")
    4824                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("closeFxn")
    4825                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4826                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4827                            .dwattr $C$DW$300, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4828                            .dwattr $C$DW$300, DW_AT_decl_line(0x141)
    4829                            .dwattr $C$DW$300, DW_AT_decl_column(0x17)
    4830                    
    4831                    $C$DW$301       .dwtag  DW_TAG_member
    4832                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$85)
    4833                            .dwattr $C$DW$301, DW_AT_name("controlFxn")
    4834                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("controlFxn")
    4835                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4836                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4837                            .dwattr $C$DW$301, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4838                            .dwattr $C$DW$301, DW_AT_decl_line(0x144)
    4839                            .dwattr $C$DW$301, DW_AT_decl_column(0x17)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   89

    4840                    
    4841                    $C$DW$302       .dwtag  DW_TAG_member
    4842                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$89)
    4843                            .dwattr $C$DW$302, DW_AT_name("convertFxn")
    4844                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("convertFxn")
    4845                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4846                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4847                            .dwattr $C$DW$302, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4848                            .dwattr $C$DW$302, DW_AT_decl_line(0x147)
    4849                            .dwattr $C$DW$302, DW_AT_decl_column(0x17)
    4850                    
    4851                    $C$DW$303       .dwtag  DW_TAG_member
    4852                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$92)
    4853                            .dwattr $C$DW$303, DW_AT_name("convertToMicroVolts")
    4854                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("convertToMicroVolts")
    4855                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4856                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4857                            .dwattr $C$DW$303, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4858                            .dwattr $C$DW$303, DW_AT_decl_line(0x14a)
    4859                            .dwattr $C$DW$303, DW_AT_decl_column(0x20)
    4860                    
    4861                    $C$DW$304       .dwtag  DW_TAG_member
    4862                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$93)
    4863                            .dwattr $C$DW$304, DW_AT_name("initFxn")
    4864                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("initFxn")
    4865                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4866                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4867                            .dwattr $C$DW$304, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4868                            .dwattr $C$DW$304, DW_AT_decl_line(0x14d)
    4869                            .dwattr $C$DW$304, DW_AT_decl_column(0x17)
    4870                    
    4871                    $C$DW$305       .dwtag  DW_TAG_member
    4872                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$98)
    4873                            .dwattr $C$DW$305, DW_AT_name("openFxn")
    4874                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("openFxn")
    4875                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4876                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4877                            .dwattr $C$DW$305, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4878                            .dwattr $C$DW$305, DW_AT_decl_line(0x150)
    4879                            .dwattr $C$DW$305, DW_AT_decl_column(0x17)
    4880                    
    4881                            .dwattr $C$DW$T$99, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4882                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x13f)
    4883                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x10)
    4884                            .dwendtag $C$DW$T$99
    4885                    
    4886                    $C$DW$T$715     .dwtag  DW_TAG_typedef
    4887                            .dwattr $C$DW$T$715, DW_AT_name("ADC_FxnTable")
    4888                            .dwattr $C$DW$T$715, DW_AT_type(*$C$DW$T$99)
    4889                            .dwattr $C$DW$T$715, DW_AT_language(DW_LANG_C)
    4890                            .dwattr $C$DW$T$715, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4891                            .dwattr $C$DW$T$715, DW_AT_decl_line(0x151)
    4892                            .dwattr $C$DW$T$715, DW_AT_decl_column(0x03)
    4893                    
    4894                    $C$DW$T$716     .dwtag  DW_TAG_const_type
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   90

    4895                            .dwattr $C$DW$T$716, DW_AT_type(*$C$DW$T$715)
    4896                    
    4897                    $C$DW$T$717     .dwtag  DW_TAG_pointer_type
    4898                            .dwattr $C$DW$T$717, DW_AT_type(*$C$DW$T$716)
    4899                            .dwattr $C$DW$T$717, DW_AT_address_class(0x20)
    4900                    
    4901                    
    4902                    $C$DW$T$106     .dwtag  DW_TAG_structure_type
    4903                            .dwattr $C$DW$T$106, DW_AT_byte_size(0x24)
    4904                    $C$DW$306       .dwtag  DW_TAG_member
    4905                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$101)
    4906                            .dwattr $C$DW$306, DW_AT_name("key")
    4907                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("key")
    4908                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4909                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4910                            .dwattr $C$DW$306, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4911                            .dwattr $C$DW$306, DW_AT_decl_line(0x1bf)
    4912                            .dwattr $C$DW$306, DW_AT_decl_column(0x1e)
    4913                    
    4914                    $C$DW$307       .dwtag  DW_TAG_member
    4915                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$104)
    4916                            .dwattr $C$DW$307, DW_AT_name("aad")
    4917                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("aad")
    4918                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4919                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4920                            .dwattr $C$DW$307, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4921                            .dwattr $C$DW$307, DW_AT_decl_line(0x1c0)
    4922                            .dwattr $C$DW$307, DW_AT_decl_column(0x1e)
    4923                    
    4924                    $C$DW$308       .dwtag  DW_TAG_member
    4925                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$104)
    4926                            .dwattr $C$DW$308, DW_AT_name("input")
    4927                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("input")
    4928                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4929                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4930                            .dwattr $C$DW$308, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4931                            .dwattr $C$DW$308, DW_AT_decl_line(0x1c4)
    4932                            .dwattr $C$DW$308, DW_AT_decl_column(0x1e)
    4933                    
    4934                    $C$DW$309       .dwtag  DW_TAG_member
    4935                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$104)
    4936                            .dwattr $C$DW$309, DW_AT_name("output")
    4937                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("output")
    4938                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4939                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4940                            .dwattr $C$DW$309, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4941                            .dwattr $C$DW$309, DW_AT_decl_line(0x1c9)
    4942                            .dwattr $C$DW$309, DW_AT_decl_column(0x1e)
    4943                    
    4944                    $C$DW$310       .dwtag  DW_TAG_member
    4945                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$104)
    4946                            .dwattr $C$DW$310, DW_AT_name("nonce")
    4947                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("nonce")
    4948                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4949                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   91

    4950                            .dwattr $C$DW$310, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4951                            .dwattr $C$DW$310, DW_AT_decl_line(0x1cf)
    4952                            .dwattr $C$DW$310, DW_AT_decl_column(0x1e)
    4953                    
    4954                    $C$DW$311       .dwtag  DW_TAG_member
    4955                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$104)
    4956                            .dwattr $C$DW$311, DW_AT_name("mac")
    4957                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("mac")
    4958                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4959                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4960                            .dwattr $C$DW$311, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4961                            .dwattr $C$DW$311, DW_AT_decl_line(0x1d5)
    4962                            .dwattr $C$DW$311, DW_AT_decl_column(0x1e)
    4963                    
    4964                    $C$DW$312       .dwtag  DW_TAG_member
    4965                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$105)
    4966                            .dwattr $C$DW$312, DW_AT_name("aadLength")
    4967                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("aadLength")
    4968                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4969                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4970                            .dwattr $C$DW$312, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4971                            .dwattr $C$DW$312, DW_AT_decl_line(0x1db)
    4972                            .dwattr $C$DW$312, DW_AT_decl_column(0x1d)
    4973                    
    4974                    $C$DW$313       .dwtag  DW_TAG_member
    4975                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$105)
    4976                            .dwattr $C$DW$313, DW_AT_name("inputLength")
    4977                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("inputLength")
    4978                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4979                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4980                            .dwattr $C$DW$313, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4981                            .dwattr $C$DW$313, DW_AT_decl_line(0x1df)
    4982                            .dwattr $C$DW$313, DW_AT_decl_column(0x1d)
    4983                    
    4984                    $C$DW$314       .dwtag  DW_TAG_member
    4985                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$103)
    4986                            .dwattr $C$DW$314, DW_AT_name("nonceLength")
    4987                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("nonceLength")
    4988                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4989                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4990                            .dwattr $C$DW$314, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4991                            .dwattr $C$DW$314, DW_AT_decl_line(0x1e3)
    4992                            .dwattr $C$DW$314, DW_AT_decl_column(0x1d)
    4993                    
    4994                    $C$DW$315       .dwtag  DW_TAG_member
    4995                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$103)
    4996                            .dwattr $C$DW$315, DW_AT_name("macLength")
    4997                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("macLength")
    4998                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4999                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5000                            .dwattr $C$DW$315, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5001                            .dwattr $C$DW$315, DW_AT_decl_line(0x1e6)
    5002                            .dwattr $C$DW$315, DW_AT_decl_column(0x1d)
    5003                    
    5004                    $C$DW$316       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   92

    5005                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$76)
    5006                            .dwattr $C$DW$316, DW_AT_name("nonceInternallyGenerated")
    5007                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("nonceInternallyGenerated")
    5008                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5009                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5010                            .dwattr $C$DW$316, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5011                            .dwattr $C$DW$316, DW_AT_decl_line(0x1eb)
    5012                            .dwattr $C$DW$316, DW_AT_decl_column(0x1d)
    5013                    
    5014                            .dwattr $C$DW$T$106, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5015                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x1be)
    5016                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x10)
    5017                            .dwendtag $C$DW$T$106
    5018                    
    5019                    $C$DW$T$330     .dwtag  DW_TAG_typedef
    5020                            .dwattr $C$DW$T$330, DW_AT_name("AESCCM_Operation")
    5021                            .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$106)
    5022                            .dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
    5023                            .dwattr $C$DW$T$330, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5024                            .dwattr $C$DW$T$330, DW_AT_decl_line(0x1ef)
    5025                            .dwattr $C$DW$T$330, DW_AT_decl_column(0x03)
    5026                    
    5027                    $C$DW$T$331     .dwtag  DW_TAG_pointer_type
    5028                            .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$330)
    5029                            .dwattr $C$DW$T$331, DW_AT_address_class(0x20)
    5030                    
    5031                    
    5032                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
    5033                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x24)
    5034                    $C$DW$317       .dwtag  DW_TAG_member
    5035                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$101)
    5036                            .dwattr $C$DW$317, DW_AT_name("key")
    5037                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("key")
    5038                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5039                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5040                            .dwattr $C$DW$317, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5041                            .dwattr $C$DW$317, DW_AT_decl_line(0x1ad)
    5042                            .dwattr $C$DW$317, DW_AT_decl_column(0x1e)
    5043                    
    5044                    $C$DW$318       .dwtag  DW_TAG_member
    5045                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$104)
    5046                            .dwattr $C$DW$318, DW_AT_name("aad")
    5047                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("aad")
    5048                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5049                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5050                            .dwattr $C$DW$318, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5051                            .dwattr $C$DW$318, DW_AT_decl_line(0x1ae)
    5052                            .dwattr $C$DW$318, DW_AT_decl_column(0x1e)
    5053                    
    5054                    $C$DW$319       .dwtag  DW_TAG_member
    5055                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$104)
    5056                            .dwattr $C$DW$319, DW_AT_name("input")
    5057                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("input")
    5058                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5059                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   93

    5060                            .dwattr $C$DW$319, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5061                            .dwattr $C$DW$319, DW_AT_decl_line(0x1b2)
    5062                            .dwattr $C$DW$319, DW_AT_decl_column(0x1e)
    5063                    
    5064                    $C$DW$320       .dwtag  DW_TAG_member
    5065                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$104)
    5066                            .dwattr $C$DW$320, DW_AT_name("output")
    5067                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("output")
    5068                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5069                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5070                            .dwattr $C$DW$320, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5071                            .dwattr $C$DW$320, DW_AT_decl_line(0x1b7)
    5072                            .dwattr $C$DW$320, DW_AT_decl_column(0x1e)
    5073                    
    5074                    $C$DW$321       .dwtag  DW_TAG_member
    5075                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$104)
    5076                            .dwattr $C$DW$321, DW_AT_name("iv")
    5077                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("iv")
    5078                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5079                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5080                            .dwattr $C$DW$321, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5081                            .dwattr $C$DW$321, DW_AT_decl_line(0x1bd)
    5082                            .dwattr $C$DW$321, DW_AT_decl_column(0x1e)
    5083                    
    5084                    $C$DW$322       .dwtag  DW_TAG_member
    5085                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$104)
    5086                            .dwattr $C$DW$322, DW_AT_name("mac")
    5087                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("mac")
    5088                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5089                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5090                            .dwattr $C$DW$322, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5091                            .dwattr $C$DW$322, DW_AT_decl_line(0x1c3)
    5092                            .dwattr $C$DW$322, DW_AT_decl_column(0x1e)
    5093                    
    5094                    $C$DW$323       .dwtag  DW_TAG_member
    5095                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$105)
    5096                            .dwattr $C$DW$323, DW_AT_name("aadLength")
    5097                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("aadLength")
    5098                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5099                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5100                            .dwattr $C$DW$323, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5101                            .dwattr $C$DW$323, DW_AT_decl_line(0x1c9)
    5102                            .dwattr $C$DW$323, DW_AT_decl_column(0x1d)
    5103                    
    5104                    $C$DW$324       .dwtag  DW_TAG_member
    5105                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$105)
    5106                            .dwattr $C$DW$324, DW_AT_name("inputLength")
    5107                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("inputLength")
    5108                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5109                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5110                            .dwattr $C$DW$324, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5111                            .dwattr $C$DW$324, DW_AT_decl_line(0x1cd)
    5112                            .dwattr $C$DW$324, DW_AT_decl_column(0x1d)
    5113                    
    5114                    $C$DW$325       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   94

    5115                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$103)
    5116                            .dwattr $C$DW$325, DW_AT_name("ivLength")
    5117                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("ivLength")
    5118                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5119                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5120                            .dwattr $C$DW$325, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5121                            .dwattr $C$DW$325, DW_AT_decl_line(0x1d1)
    5122                            .dwattr $C$DW$325, DW_AT_decl_column(0x1d)
    5123                    
    5124                    $C$DW$326       .dwtag  DW_TAG_member
    5125                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$103)
    5126                            .dwattr $C$DW$326, DW_AT_name("macLength")
    5127                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("macLength")
    5128                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5129                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5130                            .dwattr $C$DW$326, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5131                            .dwattr $C$DW$326, DW_AT_decl_line(0x1d4)
    5132                            .dwattr $C$DW$326, DW_AT_decl_column(0x1d)
    5133                    
    5134                    $C$DW$327       .dwtag  DW_TAG_member
    5135                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$76)
    5136                            .dwattr $C$DW$327, DW_AT_name("ivInternallyGenerated")
    5137                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("ivInternallyGenerated")
    5138                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5139                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5140                            .dwattr $C$DW$327, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5141                            .dwattr $C$DW$327, DW_AT_decl_line(0x1d7)
    5142                            .dwattr $C$DW$327, DW_AT_decl_column(0x1d)
    5143                    
    5144                            .dwattr $C$DW$T$107, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5145                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x1ac)
    5146                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x10)
    5147                            .dwendtag $C$DW$T$107
    5148                    
    5149                    $C$DW$T$342     .dwtag  DW_TAG_typedef
    5150                            .dwattr $C$DW$T$342, DW_AT_name("AESGCM_Operation")
    5151                            .dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$107)
    5152                            .dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
    5153                            .dwattr $C$DW$T$342, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5154                            .dwattr $C$DW$T$342, DW_AT_decl_line(0x1db)
    5155                            .dwattr $C$DW$T$342, DW_AT_decl_column(0x03)
    5156                    
    5157                    $C$DW$T$343     .dwtag  DW_TAG_pointer_type
    5158                            .dwattr $C$DW$T$343, DW_AT_type(*$C$DW$T$342)
    5159                            .dwattr $C$DW$T$343, DW_AT_address_class(0x20)
    5160                    
    5161                    
    5162                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    5163                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x18)
    5164                    $C$DW$328       .dwtag  DW_TAG_member
    5165                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$101)
    5166                            .dwattr $C$DW$328, DW_AT_name("key")
    5167                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("key")
    5168                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5169                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   95

    5170                            .dwattr $C$DW$328, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5171                            .dwattr $C$DW$328, DW_AT_decl_line(0x1a5)
    5172                            .dwattr $C$DW$328, DW_AT_decl_column(0x1e)
    5173                    
    5174                    $C$DW$329       .dwtag  DW_TAG_member
    5175                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$109)
    5176                            .dwattr $C$DW$329, DW_AT_name("input")
    5177                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("input")
    5178                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5179                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5180                            .dwattr $C$DW$329, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5181                            .dwattr $C$DW$329, DW_AT_decl_line(0x1a6)
    5182                            .dwattr $C$DW$329, DW_AT_decl_column(0x1e)
    5183                    
    5184                    $C$DW$330       .dwtag  DW_TAG_member
    5185                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$104)
    5186                            .dwattr $C$DW$330, DW_AT_name("output")
    5187                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("output")
    5188                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5189                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5190                            .dwattr $C$DW$330, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5191                            .dwattr $C$DW$330, DW_AT_decl_line(0x1ab)
    5192                            .dwattr $C$DW$330, DW_AT_decl_column(0x1e)
    5193                    
    5194                    $C$DW$331       .dwtag  DW_TAG_member
    5195                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$104)
    5196                            .dwattr $C$DW$331, DW_AT_name("iv")
    5197                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("iv")
    5198                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5199                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5200                            .dwattr $C$DW$331, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5201                            .dwattr $C$DW$331, DW_AT_decl_line(0x1b1)
    5202                            .dwattr $C$DW$331, DW_AT_decl_column(0x1e)
    5203                    
    5204                    $C$DW$332       .dwtag  DW_TAG_member
    5205                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$105)
    5206                            .dwattr $C$DW$332, DW_AT_name("inputLength")
    5207                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("inputLength")
    5208                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5209                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5210                            .dwattr $C$DW$332, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5211                            .dwattr $C$DW$332, DW_AT_decl_line(0x1b7)
    5212                            .dwattr $C$DW$332, DW_AT_decl_column(0x1d)
    5213                    
    5214                    $C$DW$333       .dwtag  DW_TAG_member
    5215                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$76)
    5216                            .dwattr $C$DW$333, DW_AT_name("ivInternallyGenerated")
    5217                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("ivInternallyGenerated")
    5218                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5219                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5220                            .dwattr $C$DW$333, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5221                            .dwattr $C$DW$333, DW_AT_decl_line(0x1b8)
    5222                            .dwattr $C$DW$333, DW_AT_decl_column(0x1d)
    5223                    
    5224                            .dwattr $C$DW$T$110, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   96

    5225                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x1a4)
    5226                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x10)
    5227                            .dwendtag $C$DW$T$110
    5228                    
    5229                    $C$DW$T$354     .dwtag  DW_TAG_typedef
    5230                            .dwattr $C$DW$T$354, DW_AT_name("AESCBC_Operation")
    5231                            .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$110)
    5232                            .dwattr $C$DW$T$354, DW_AT_language(DW_LANG_C)
    5233                            .dwattr $C$DW$T$354, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5234                            .dwattr $C$DW$T$354, DW_AT_decl_line(0x1bc)
    5235                            .dwattr $C$DW$T$354, DW_AT_decl_column(0x03)
    5236                    
    5237                    $C$DW$T$355     .dwtag  DW_TAG_pointer_type
    5238                            .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$354)
    5239                            .dwattr $C$DW$T$355, DW_AT_address_class(0x20)
    5240                    
    5241                    
    5242                    $C$DW$T$113     .dwtag  DW_TAG_structure_type
    5243                            .dwattr $C$DW$T$113, DW_AT_byte_size(0x14)
    5244                    $C$DW$334       .dwtag  DW_TAG_member
    5245                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$112)
    5246                            .dwattr $C$DW$334, DW_AT_name("key")
    5247                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("key")
    5248                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5249                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5250                            .dwattr $C$DW$334, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5251                            .dwattr $C$DW$334, DW_AT_decl_line(0x19d)
    5252                            .dwattr $C$DW$334, DW_AT_decl_column(0x1e)
    5253                    
    5254                    $C$DW$335       .dwtag  DW_TAG_member
    5255                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$109)
    5256                            .dwattr $C$DW$335, DW_AT_name("input")
    5257                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("input")
    5258                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5259                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5260                            .dwattr $C$DW$335, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5261                            .dwattr $C$DW$335, DW_AT_decl_line(0x19e)
    5262                            .dwattr $C$DW$335, DW_AT_decl_column(0x1e)
    5263                    
    5264                    $C$DW$336       .dwtag  DW_TAG_member
    5265                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$104)
    5266                            .dwattr $C$DW$336, DW_AT_name("output")
    5267                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("output")
    5268                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5269                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5270                            .dwattr $C$DW$336, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5271                            .dwattr $C$DW$336, DW_AT_decl_line(0x1a3)
    5272                            .dwattr $C$DW$336, DW_AT_decl_column(0x1e)
    5273                    
    5274                    $C$DW$337       .dwtag  DW_TAG_member
    5275                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$109)
    5276                            .dwattr $C$DW$337, DW_AT_name("initialCounter")
    5277                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("initialCounter")
    5278                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5279                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   97

    5280                            .dwattr $C$DW$337, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5281                            .dwattr $C$DW$337, DW_AT_decl_line(0x1a9)
    5282                            .dwattr $C$DW$337, DW_AT_decl_column(0x1e)
    5283                    
    5284                    $C$DW$338       .dwtag  DW_TAG_member
    5285                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$105)
    5286                            .dwattr $C$DW$338, DW_AT_name("inputLength")
    5287                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("inputLength")
    5288                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5289                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5290                            .dwattr $C$DW$338, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5291                            .dwattr $C$DW$338, DW_AT_decl_line(0x1ae)
    5292                            .dwattr $C$DW$338, DW_AT_decl_column(0x1d)
    5293                    
    5294                            .dwattr $C$DW$T$113, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5295                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x19c)
    5296                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x10)
    5297                            .dwendtag $C$DW$T$113
    5298                    
    5299                    $C$DW$T$121     .dwtag  DW_TAG_typedef
    5300                            .dwattr $C$DW$T$121, DW_AT_name("AESCTR_Operation")
    5301                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$113)
    5302                            .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    5303                            .dwattr $C$DW$T$121, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5304                            .dwattr $C$DW$T$121, DW_AT_decl_line(0x1af)
    5305                            .dwattr $C$DW$T$121, DW_AT_decl_column(0x03)
    5306                    
    5307                    $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    5308                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    5309                            .dwattr $C$DW$T$122, DW_AT_address_class(0x20)
    5310                    
    5311                    
    5312                    $C$DW$T$126     .dwtag  DW_TAG_structure_type
    5313                            .dwattr $C$DW$T$126, DW_AT_byte_size(0x18)
    5314                    $C$DW$339       .dwtag  DW_TAG_member
    5315                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$76)
    5316                            .dwattr $C$DW$339, DW_AT_name("isOpen")
    5317                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("isOpen")
    5318                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5319                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5320                            .dwattr $C$DW$339, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5321                            .dwattr $C$DW$339, DW_AT_decl_line(0x6f)
    5322                            .dwattr $C$DW$339, DW_AT_decl_column(0x25)
    5323                    
    5324                    $C$DW$340       .dwtag  DW_TAG_member
    5325                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$76)
    5326                            .dwattr $C$DW$340, DW_AT_name("operationInProgress")
    5327                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("operationInProgress")
    5328                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5329                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5330                            .dwattr $C$DW$340, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5331                            .dwattr $C$DW$340, DW_AT_decl_line(0x70)
    5332                            .dwattr $C$DW$340, DW_AT_decl_column(0x25)
    5333                    
    5334                    $C$DW$341       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   98

    5335                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$76)
    5336                            .dwattr $C$DW$341, DW_AT_name("operationCanceled")
    5337                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("operationCanceled")
    5338                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5339                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5340                            .dwattr $C$DW$341, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5341                            .dwattr $C$DW$341, DW_AT_decl_line(0x71)
    5342                            .dwattr $C$DW$341, DW_AT_decl_column(0x25)
    5343                    
    5344                    $C$DW$342       .dwtag  DW_TAG_member
    5345                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$76)
    5346                            .dwattr $C$DW$342, DW_AT_name("threadSafe")
    5347                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("threadSafe")
    5348                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5349                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5350                            .dwattr $C$DW$342, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5351                            .dwattr $C$DW$342, DW_AT_decl_line(0x72)
    5352                            .dwattr $C$DW$342, DW_AT_decl_column(0x25)
    5353                    
    5354                    $C$DW$343       .dwtag  DW_TAG_member
    5355                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$44)
    5356                            .dwattr $C$DW$343, DW_AT_name("returnStatus")
    5357                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("returnStatus")
    5358                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5359                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5360                            .dwattr $C$DW$343, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5361                            .dwattr $C$DW$343, DW_AT_decl_line(0x73)
    5362                            .dwattr $C$DW$343, DW_AT_decl_column(0x25)
    5363                    
    5364                    $C$DW$344       .dwtag  DW_TAG_member
    5365                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$115)
    5366                            .dwattr $C$DW$344, DW_AT_name("returnBehavior")
    5367                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("returnBehavior")
    5368                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5369                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5370                            .dwattr $C$DW$344, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5371                            .dwattr $C$DW$344, DW_AT_decl_line(0x74)
    5372                            .dwattr $C$DW$344, DW_AT_decl_column(0x25)
    5373                    
    5374                    $C$DW$345       .dwtag  DW_TAG_member
    5375                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$117)
    5376                            .dwattr $C$DW$345, DW_AT_name("operationType")
    5377                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("operationType")
    5378                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5379                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    5380                            .dwattr $C$DW$345, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5381                            .dwattr $C$DW$345, DW_AT_decl_line(0x75)
    5382                            .dwattr $C$DW$345, DW_AT_decl_column(0x25)
    5383                    
    5384                    $C$DW$346       .dwtag  DW_TAG_member
    5385                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$25)
    5386                            .dwattr $C$DW$346, DW_AT_name("semaphoreTimeout")
    5387                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("semaphoreTimeout")
    5388                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5389                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE   99

    5390                            .dwattr $C$DW$346, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5391                            .dwattr $C$DW$346, DW_AT_decl_line(0x76)
    5392                            .dwattr $C$DW$346, DW_AT_decl_column(0x25)
    5393                    
    5394                    $C$DW$347       .dwtag  DW_TAG_member
    5395                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$125)
    5396                            .dwattr $C$DW$347, DW_AT_name("callbackFxn")
    5397                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("callbackFxn")
    5398                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5399                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    5400                            .dwattr $C$DW$347, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5401                            .dwattr $C$DW$347, DW_AT_decl_line(0x77)
    5402                            .dwattr $C$DW$347, DW_AT_decl_column(0x25)
    5403                    
    5404                    $C$DW$348       .dwtag  DW_TAG_member
    5405                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$122)
    5406                            .dwattr $C$DW$348, DW_AT_name("operation")
    5407                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("operation")
    5408                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5409                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    5410                            .dwattr $C$DW$348, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5411                            .dwattr $C$DW$348, DW_AT_decl_line(0x78)
    5412                            .dwattr $C$DW$348, DW_AT_decl_column(0x26)
    5413                    
    5414                            .dwattr $C$DW$T$126, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5415                            .dwattr $C$DW$T$126, DW_AT_decl_line(0x6e)
    5416                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x10)
    5417                            .dwendtag $C$DW$T$126
    5418                    
    5419                    $C$DW$T$1362    .dwtag  DW_TAG_typedef
    5420                            .dwattr $C$DW$T$1362, DW_AT_name("AESCTRCC26XX_Object")
    5421                            .dwattr $C$DW$T$1362, DW_AT_type(*$C$DW$T$126)
    5422                            .dwattr $C$DW$T$1362, DW_AT_language(DW_LANG_C)
    5423                            .dwattr $C$DW$T$1362, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/d
    5424                            .dwattr $C$DW$T$1362, DW_AT_decl_line(0x79)
    5425                            .dwattr $C$DW$T$1362, DW_AT_decl_column(0x03)
    5426                    
    5427                    
    5428                    $C$DW$T$1363    .dwtag  DW_TAG_array_type
    5429                            .dwattr $C$DW$T$1363, DW_AT_type(*$C$DW$T$1362)
    5430                            .dwattr $C$DW$T$1363, DW_AT_language(DW_LANG_C)
    5431                            .dwattr $C$DW$T$1363, DW_AT_byte_size(0x18)
    5432                    $C$DW$349       .dwtag  DW_TAG_subrange_type
    5433                            .dwattr $C$DW$349, DW_AT_upper_bound(0x00)
    5434                    
    5435                            .dwendtag $C$DW$T$1363
    5436                    
    5437                    
    5438                    $C$DW$T$127     .dwtag  DW_TAG_structure_type
    5439                            .dwattr $C$DW$T$127, DW_AT_byte_size(0x01)
    5440                    $C$DW$350       .dwtag  DW_TAG_member
    5441                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$103)
    5442                            .dwattr $C$DW$350, DW_AT_name("intPriority")
    5443                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("intPriority")
    5444                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE  100

    5445                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    5446                            .dwattr $C$DW$350, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5447                            .dwattr $C$DW$350, DW_AT_decl_line(0x66)
    5448                            .dwattr $C$DW$350, DW_AT_decl_column(0x10)
    5449                    
    5450                            .dwattr $C$DW$T$127, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5451                            .dwattr $C$DW$T$127, DW_AT_decl_line(0x59)
    5452                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x10)
    5453                            .dwendtag $C$DW$T$127
    5454                    
    5455                    $C$DW$T$1365    .dwtag  DW_TAG_typedef
    5456                            .dwattr $C$DW$T$1365, DW_AT_name("AESCTRCC26XX_HWAttrs")
    5457                            .dwattr $C$DW$T$1365, DW_AT_type(*$C$DW$T$127)
    5458                            .dwattr $C$DW$T$1365, DW_AT_language(DW_LANG_C)
    5459                            .dwattr $C$DW$T$1365, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/d
    5460                            .dwattr $C$DW$T$1365, DW_AT_decl_line(0x67)
    5461                            .dwattr $C$DW$T$1365, DW_AT_decl_column(0x03)
    5462                    
    5463                    $C$DW$T$1366    .dwtag  DW_TAG_const_type
    5464                            .dwattr $C$DW$T$1366, DW_AT_type(*$C$DW$T$1365)
    5465                    
    5466                    
    5467                    $C$DW$T$1367    .dwtag  DW_TAG_array_type
    5468                            .dwattr $C$DW$T$1367, DW_AT_type(*$C$DW$T$1366)
    5469                            .dwattr $C$DW$T$1367, DW_AT_language(DW_LANG_C)
    5470                            .dwattr $C$DW$T$1367, DW_AT_byte_size(0x01)
    5471                    $C$DW$351       .dwtag  DW_TAG_subrange_type
    5472                            .dwattr $C$DW$351, DW_AT_upper_bound(0x00)
    5473                    
    5474                            .dwendtag $C$DW$T$1367
    5475                    
    5476                    
    5477                    $C$DW$T$128     .dwtag  DW_TAG_structure_type
    5478                            .dwattr $C$DW$T$128, DW_AT_byte_size(0x10)
    5479                    $C$DW$352       .dwtag  DW_TAG_member
    5480                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$101)
    5481                            .dwattr $C$DW$352, DW_AT_name("key")
    5482                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("key")
    5483                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5484                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    5485                            .dwattr $C$DW$352, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5486                            .dwattr $C$DW$352, DW_AT_decl_line(0x16b)
    5487                            .dwattr $C$DW$352, DW_AT_decl_column(0x1e)
    5488                    
    5489                    $C$DW$353       .dwtag  DW_TAG_member
    5490                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$104)
    5491                            .dwattr $C$DW$353, DW_AT_name("input")
    5492                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("input")
    5493                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5494                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    5495                            .dwattr $C$DW$353, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5496                            .dwattr $C$DW$353, DW_AT_decl_line(0x16c)
    5497                            .dwattr $C$DW$353, DW_AT_decl_column(0x1e)
    5498                    
    5499                    $C$DW$354       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE  101

    5500                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$104)
    5501                            .dwattr $C$DW$354, DW_AT_name("output")
    5502                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("output")
    5503                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5504                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    5505                            .dwattr $C$DW$354, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5506                            .dwattr $C$DW$354, DW_AT_decl_line(0x171)
    5507                            .dwattr $C$DW$354, DW_AT_decl_column(0x1e)
    5508                    
    5509                    $C$DW$355       .dwtag  DW_TAG_member
    5510                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$105)
    5511                            .dwattr $C$DW$355, DW_AT_name("inputLength")
    5512                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("inputLength")
    5513                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5514                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    5515                            .dwattr $C$DW$355, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5516                            .dwattr $C$DW$355, DW_AT_decl_line(0x177)
    5517                            .dwattr $C$DW$355, DW_AT_decl_column(0x1d)
    5518                    
    5519                            .dwattr $C$DW$T$128, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5520                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x16a)
    5521                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x10)
    5522                            .dwendtag $C$DW$T$128
    5523                    
    5524                    $C$DW$T$367     .dwtag  DW_TAG_typedef
    5525                            .dwattr $C$DW$T$367, DW_AT_name("AESECB_Operation")
    5526                            .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$128)
    5527                            .dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
    5528                            .dwattr $C$DW$T$367, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    5529                            .dwattr $C$DW$T$367, DW_AT_decl_line(0x17a)
    5530                            .dwattr $C$DW$T$367, DW_AT_decl_column(0x03)
    5531                    
    5532                    $C$DW$T$368     .dwtag  DW_TAG_pointer_type
    5533                            .dwattr $C$DW$T$368, DW_AT_type(*$C$DW$T$367)
    5534                            .dwattr $C$DW$T$368, DW_AT_address_class(0x20)
    5535                    
    5536                    
    5537                    $C$DW$T$131     .dwtag  DW_TAG_structure_type
    5538                            .dwattr $C$DW$T$131, DW_AT_byte_size(0x58)
    5539                    $C$DW$356       .dwtag  DW_TAG_member
    5540                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$129)
    5541                            .dwattr $C$DW$356, DW_AT_name("keyingMaterial")
    5542                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("keyingMaterial")
    5543                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5544                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    5545                            .dwattr $C$DW$356, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5546                            .dwattr $C$DW$356, DW_AT_decl_line(0x67)
    5547                            .dwattr $C$DW$356, DW_AT_decl_column(0x25)
    5548                    
    5549                    $C$DW$357       .dwtag  DW_TAG_member
    5550                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$130)
    5551                            .dwattr $C$DW$357, DW_AT_name("counter")
    5552                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("counter")
    5553                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5554                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE  102

    5555                            .dwattr $C$DW$357, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5556                            .dwattr $C$DW$357, DW_AT_decl_line(0x68)
    5557                            .dwattr $C$DW$357, DW_AT_decl_column(0x25)
    5558                    
    5559                    $C$DW$358       .dwtag  DW_TAG_member
    5560                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$100)
    5561                            .dwattr $C$DW$358, DW_AT_name("key")
    5562                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("key")
    5563                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5564                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    5565                            .dwattr $C$DW$358, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5566                            .dwattr $C$DW$358, DW_AT_decl_line(0x69)
    5567                            .dwattr $C$DW$358, DW_AT_decl_column(0x25)
    5568                    
    5569                    $C$DW$359       .dwtag  DW_TAG_member
    5570                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$120)
    5571                            .dwattr $C$DW$359, DW_AT_name("ctrHandle")
    5572                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("ctrHandle")
    5573                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5574                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    5575                            .dwattr $C$DW$359, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5576                            .dwattr $C$DW$359, DW_AT_decl_line(0x6a)
    5577                            .dwattr $C$DW$359, DW_AT_decl_column(0x25)
    5578                    
    5579                    $C$DW$360       .dwtag  DW_TAG_member
    5580                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$105)
    5581                            .dwattr $C$DW$360, DW_AT_name("seedLength")
    5582                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("seedLength")
    5583                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5584                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    5585                            .dwattr $C$DW$360, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5586                            .dwattr $C$DW$360, DW_AT_decl_line(0x6b)
    5587                            .dwattr $C$DW$360, DW_AT_decl_column(0x25)
    5588                    
    5589                    $C$DW$361       .dwtag  DW_TAG_member
    5590                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$25)
    5591                            .dwattr $C$DW$361, DW_AT_name("reseedCounter")
    5592                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("reseedCounter")
    5593                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5594                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    5595                            .dwattr $C$DW$361, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5596                            .dwattr $C$DW$361, DW_AT_decl_line(0x6c)
    5597                            .dwattr $C$DW$361, DW_AT_decl_column(0x25)
    5598                    
    5599                    $C$DW$362       .dwtag  DW_TAG_member
    5600                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$25)
    5601                            .dwattr $C$DW$362, DW_AT_name("reseedInterval")
    5602                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("reseedInterval")
    5603                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    5604                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    5605                            .dwattr $C$DW$362, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5606                            .dwattr $C$DW$362, DW_AT_decl_line(0x6d)
    5607                            .dwattr $C$DW$362, DW_AT_decl_column(0x25)
    5608                    
    5609                    $C$DW$363       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
CC2640R2_LAUNCHXL.asm                                                PAGE  103

    5610                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$44)
    5611                            .dwattr $C$DW$363, DW_AT_name("returnStatus")
    5612                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("returnStatus")
    5613                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5614                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    5615                            .dwattr $C$DW$363, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    5616                            .dwattr $C$DW$363, DW_AT_decl_line(0x6e)
    5617                            .dwattr $C$DW$363, DW_AT_decl_column(0x25)
    5618                    
    5619                    $C$DW$364       .dwtag  DW_TAG_member
    5620                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$76)
    5621                            .dwattr $C$DW$364, DW_AT_name("isOpen")
