;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
;* Date/Time created: Fri Apr  2 00:57:45 2021                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=none --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../CC2640R2_LAUNCHXL.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
	.bound	".TI.bound:flashBuf", 106496, 0
	.noinit	".TI.bound:flashBuf"
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("ADCBufCC26XX_fxnTable")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("ADCBufCC26XX_fxnTable")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$704)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/adcbuf/ADCBufCC26XX.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x173)
	.dwattr $C$DW$1, DW_AT_decl_column(0x1e)


	.dwattr $C$DW$266, DW_AT_decl_column(0x05)

$C$DW$267	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$267, DW_AT_name("RF_GET_AVAIL_RAT_CH")
	.dwattr $C$DW$267, DW_AT_const_value(0x01)
	.dwattr $C$DW$267, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$267, DW_AT_decl_line(0x55f)
	.dwattr $C$DW$267, DW_AT_decl_column(0x05)

$C$DW$268	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$268, DW_AT_name("RF_GET_RADIO_STATE")
	.dwattr $C$DW$268, DW_AT_const_value(0x02)
	.dwattr $C$DW$268, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$268, DW_AT_decl_line(0x560)
	.dwattr $C$DW$268, DW_AT_decl_column(0x05)

$C$DW$269	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$269, DW_AT_name("RF_GET_SCHEDULE_MAP")
	.dwattr $C$DW$269, DW_AT_const_value(0x03)
	.dwattr $C$DW$269, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0x561)
	.dwattr $C$DW$269, DW_AT_decl_column(0x05)

$C$DW$270	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$270, DW_AT_name("RF_GET_CLIENT_LIST")
	.dwattr $C$DW$270, DW_AT_const_value(0x04)
	.dwattr $C$DW$270, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0x562)
	.dwattr $C$DW$270, DW_AT_decl_column(0x05)

$C$DW$271	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$271, DW_AT_name("RF_GET_CLIENT_SWITCHING_TIME")
	.dwattr $C$DW$271, DW_AT_const_value(0x05)
	.dwattr $C$DW$271, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0x563)
	.dwattr $C$DW$271, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$1356, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$1356, DW_AT_decl_line(0x55d)
	.dwattr $C$DW$T$1356, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$1356

$C$DW$T$1357	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1357, DW_AT_name("RF_InfoType")
	.dwattr $C$DW$T$1357, DW_AT_type(*$C$DW$T$1356)
	.dwattr $C$DW$T$1357, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1357, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$1357, DW_AT_decl_line(0x564)
	.dwattr $C$DW$T$1357, DW_AT_decl_column(0x03)


$C$DW$T$1358	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1358, DW_AT_byte_size(0x04)
$C$DW$272	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$272, DW_AT_name("RF_AllowDelayNone")
	.dwattr $C$DW$272, DW_AT_const_value(0x00)
	.dwattr $C$DW$272, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x65c)
	.dwattr $C$DW$272, DW_AT_decl_column(0x05)

$C$DW$273	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$273, DW_AT_name("RF_AllowDelayAny")
	.dwattr $C$DW$273, DW_AT_const_value(-1)
	.dwattr $C$DW$273, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0x65d)
	.dwattr $C$DW$273, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$1358, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$1358, DW_AT_decl_line(0x65b)
	.dwattr $C$DW$T$1358, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$1358

$C$DW$T$1359	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1359, DW_AT_name("RF_AllowDelay")
	.dwattr $C$DW$T$1359, DW_AT_type(*$C$DW$T$1358)
	.dwattr $C$DW$T$1359, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1359, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$1359, DW_AT_decl_line(0x65e)
	.dwattr $C$DW$T$1359, DW_AT_decl_column(0x03)


$C$DW$T$1360	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1360, DW_AT_byte_size(0x01)
$C$DW$274	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$274, DW_AT_name("RF_RatChannelAny")
	.dwattr $C$DW$274, DW_AT_const_value(-1)
	.dwattr $C$DW$274, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0x67e)
	.dwattr $C$DW$274, DW_AT_decl_column(0x05)

$C$DW$275	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$275, DW_AT_name("RF_RatChannel0")
	.dwattr $C$DW$275, DW_AT_const_value(0x00)
	.dwattr $C$DW$275, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x67f)
	.dwattr $C$DW$275, DW_AT_decl_column(0x05)

$C$DW$276	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$276, DW_AT_name("RF_RatChannel1")
	.dwattr $C$DW$276, DW_AT_const_value(0x01)
	.dwattr $C$DW$276, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x680)
	.dwattr $C$DW$276, DW_AT_decl_column(0x05)

$C$DW$277	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$277, DW_AT_name("RF_RatChannel2")
	.dwattr $C$DW$277, DW_AT_const_value(0x02)
	.dwattr $C$DW$277, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x681)
	.dwattr $C$DW$277, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$1360, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$1360, DW_AT_decl_line(0x67d)
	.dwattr $C$DW$T$1360, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$1360

$C$DW$T$1361	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1361, DW_AT_name("RF_RatSelectChannel")
	.dwattr $C$DW$T$1361, DW_AT_type(*$C$DW$T$1360)
	.dwattr $C$DW$T$1361, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1361, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$1361, DW_AT_decl_line(0x682)
	.dwattr $C$DW$T$1361, DW_AT_decl_column(0x03)


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$278, DW_AT_name("samplesRequestedCount")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("samplesRequestedCount")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x143)
	.dwattr $C$DW$278, DW_AT_decl_column(0x0e)

$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$279, DW_AT_name("sampleBuffer")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("sampleBuffer")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$279, DW_AT_decl_column(0x0f)

$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$280, DW_AT_name("sampleBufferTwo")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("sampleBufferTwo")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x155)
	.dwattr $C$DW$280, DW_AT_decl_column(0x0f)

$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$281, DW_AT_name("arg")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("arg")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x161)
	.dwattr $C$DW$281, DW_AT_decl_column(0x0f)

$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$282, DW_AT_name("adcChannel")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("adcChannel")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$282, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x168)
	.dwattr $C$DW$282, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$26, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$26

$C$DW$T$31	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$31, DW_AT_name("ADCBuf_Conversion")
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x169)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x03)

$C$DW$T$32	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$32, DW_AT_address_class(0x20)


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x18)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$283, DW_AT_name("blockingTimeout")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("blockingTimeout")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$283, DW_AT_decl_column(0x1c)

$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$284, DW_AT_name("samplingFrequency")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("samplingFrequency")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$284, DW_AT_decl_column(0x1c)

$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$285, DW_AT_name("returnMode")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("returnMode")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$285, DW_AT_decl_column(0x1c)

$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$286, DW_AT_name("callbackFxn")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("callbackFxn")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x200)
	.dwattr $C$DW$286, DW_AT_decl_column(0x1c)

$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$287, DW_AT_name("recurrenceMode")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("recurrenceMode")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x203)
	.dwattr $C$DW$287, DW_AT_decl_column(0x1c)

$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$288, DW_AT_name("custom")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("custom")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x206)
	.dwattr $C$DW$288, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$38, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$38

$C$DW$T$51	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$51, DW_AT_name("ADCBuf_Params")
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$51, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x207)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x03)

$C$DW$T$52	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)

$C$DW$T$53	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_address_class(0x20)


$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x24)
$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$289, DW_AT_name("closeFxn")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("closeFxn")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x25b)
	.dwattr $C$DW$289, DW_AT_decl_column(0x2b)

$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$290, DW_AT_name("controlFxn")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("controlFxn")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x25d)
	.dwattr $C$DW$290, DW_AT_decl_column(0x2b)

$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$291, DW_AT_name("initFxn")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("initFxn")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x25f)
	.dwattr $C$DW$291, DW_AT_decl_column(0x2b)

$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$292, DW_AT_name("openFxn")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("openFxn")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x261)
	.dwattr $C$DW$292, DW_AT_decl_column(0x2b)

$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$293, DW_AT_name("convertFxn")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("convertFxn")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x263)
	.dwattr $C$DW$293, DW_AT_decl_column(0x2b)

$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$294, DW_AT_name("convertCancelFxn")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("convertCancelFxn")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x266)
	.dwattr $C$DW$294, DW_AT_decl_column(0x2b)

$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$295, DW_AT_name("getResolutionFxn")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("getResolutionFxn")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$295, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x268)
	.dwattr $C$DW$295, DW_AT_decl_column(0x2b)

$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$296, DW_AT_name("adjustRawValuesFxn")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("adjustRawValuesFxn")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x26b)
	.dwattr $C$DW$296, DW_AT_decl_column(0x2b)

$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$297, DW_AT_name("convertAdjustedToMicroVoltsFxn")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("convertAdjustedToMicroVoltsFxn")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x26d)
	.dwattr $C$DW$297, DW_AT_decl_column(0x2b)

	.dwattr $C$DW$T$75, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x259)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$75

$C$DW$T$703	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$703, DW_AT_name("ADCBuf_FxnTable")
	.dwattr $C$DW$T$703, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$703, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$703, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADCBuf.h")
	.dwattr $C$DW$T$703, DW_AT_decl_line(0x26e)
	.dwattr $C$DW$T$703, DW_AT_decl_column(0x03)

$C$DW$T$704	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$704, DW_AT_type(*$C$DW$T$703)

$C$DW$T$705	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$705, DW_AT_type(*$C$DW$T$704)
	.dwattr $C$DW$T$705, DW_AT_address_class(0x20)


$C$DW$T$77	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$77, DW_AT_byte_size(0x08)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$298, DW_AT_name("custom")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("custom")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x103)
	.dwattr $C$DW$298, DW_AT_decl_column(0x0e)

$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$299, DW_AT_name("isProtected")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("isProtected")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x105)
	.dwattr $C$DW$299, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$77, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0x102)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$77

$C$DW$T$94	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$94, DW_AT_name("ADC_Params")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$94, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$94, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$T$94, DW_AT_decl_column(0x03)

$C$DW$T$95	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$95, DW_AT_address_class(0x20)


$C$DW$T$99	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$99, DW_AT_byte_size(0x18)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$300, DW_AT_name("closeFxn")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("closeFxn")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x141)
	.dwattr $C$DW$300, DW_AT_decl_column(0x17)

$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$301, DW_AT_name("controlFxn")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("controlFxn")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x144)
	.dwattr $C$DW$301, DW_AT_decl_column(0x17)

$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$302, DW_AT_name("convertFxn")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("convertFxn")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x147)
	.dwattr $C$DW$302, DW_AT_decl_column(0x17)

$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$303, DW_AT_name("convertToMicroVolts")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("convertToMicroVolts")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$303, DW_AT_decl_column(0x20)

$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$304, DW_AT_name("initFxn")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("initFxn")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$304, DW_AT_decl_column(0x17)

$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$305, DW_AT_name("openFxn")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("openFxn")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x150)
	.dwattr $C$DW$305, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$99, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$99, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$T$99, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$99

$C$DW$T$715	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$715, DW_AT_name("ADC_FxnTable")
	.dwattr $C$DW$T$715, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$715, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$715, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$715, DW_AT_decl_line(0x151)
	.dwattr $C$DW$T$715, DW_AT_decl_column(0x03)

$C$DW$T$716	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$716, DW_AT_type(*$C$DW$T$715)

$C$DW$T$717	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$717, DW_AT_type(*$C$DW$T$716)
	.dwattr $C$DW$T$717, DW_AT_address_class(0x20)


$C$DW$T$106	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$106, DW_AT_byte_size(0x24)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$306, DW_AT_name("key")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("key")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$306, DW_AT_decl_column(0x1e)

$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$307, DW_AT_name("aad")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("aad")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$307, DW_AT_decl_column(0x1e)

$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$308, DW_AT_name("input")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("input")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$308, DW_AT_decl_column(0x1e)

$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$309, DW_AT_name("output")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("output")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$309, DW_AT_decl_column(0x1e)

$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$310, DW_AT_name("nonce")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("nonce")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$310, DW_AT_decl_column(0x1e)

$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$311, DW_AT_name("mac")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("mac")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$311, DW_AT_decl_column(0x1e)

$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$312, DW_AT_name("aadLength")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("aadLength")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$312, DW_AT_decl_column(0x1d)

$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$313, DW_AT_name("inputLength")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("inputLength")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$313, DW_AT_decl_column(0x1d)

$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$314, DW_AT_name("nonceLength")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("nonceLength")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$314, DW_AT_decl_column(0x1d)

$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$315, DW_AT_name("macLength")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("macLength")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$315, DW_AT_decl_column(0x1d)

$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$316, DW_AT_name("nonceInternallyGenerated")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("nonceInternallyGenerated")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$316, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$106, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$T$106, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$T$106, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$106

$C$DW$T$330	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$330, DW_AT_name("AESCCM_Operation")
	.dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$330, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCCM.h")
	.dwattr $C$DW$T$330, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$T$330, DW_AT_decl_column(0x03)

$C$DW$T$331	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$T$331, DW_AT_address_class(0x20)


$C$DW$T$107	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$107, DW_AT_byte_size(0x24)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$317, DW_AT_name("key")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("key")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$317, DW_AT_decl_column(0x1e)

$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$318, DW_AT_name("aad")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("aad")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$318, DW_AT_decl_column(0x1e)

$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$319, DW_AT_name("input")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("input")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$319, DW_AT_decl_column(0x1e)

$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$320, DW_AT_name("output")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("output")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$320, DW_AT_decl_column(0x1e)

$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$321, DW_AT_name("iv")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("iv")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$321, DW_AT_decl_column(0x1e)

$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$322, DW_AT_name("mac")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("mac")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$322, DW_AT_decl_column(0x1e)

$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$323, DW_AT_name("aadLength")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("aadLength")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$323, DW_AT_decl_column(0x1d)

$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$324, DW_AT_name("inputLength")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("inputLength")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$324, DW_AT_decl_column(0x1d)

$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$325, DW_AT_name("ivLength")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("ivLength")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x1d1)
	.dwattr $C$DW$325, DW_AT_decl_column(0x1d)

$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$326, DW_AT_name("macLength")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("macLength")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$326, DW_AT_decl_column(0x1d)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$327, DW_AT_name("ivInternallyGenerated")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("ivInternallyGenerated")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$327, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$107, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$T$107, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$T$107, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$107

$C$DW$T$342	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$342, DW_AT_name("AESGCM_Operation")
	.dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$342, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESGCM.h")
	.dwattr $C$DW$T$342, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$T$342, DW_AT_decl_column(0x03)

$C$DW$T$343	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$343, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$T$343, DW_AT_address_class(0x20)


$C$DW$T$110	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$110, DW_AT_byte_size(0x18)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$328, DW_AT_name("key")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("key")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCBC.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$328, DW_AT_decl_column(0x1e)

$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$329, DW_AT_name("input")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("input")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCBC.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x1a6)
	.dwattr $C$DW$329, DW_AT_decl_column(0x1e)

$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$330, DW_AT_name("output")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("output")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCBC.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$330, DW_AT_decl_column(0x1e)

$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$331, DW_AT_name("iv")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("iv")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCBC.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$331, DW_AT_decl_column(0x1e)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$332, DW_AT_name("inputLength")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("inputLength")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCBC.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$332, DW_AT_decl_column(0x1d)

$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$333, DW_AT_name("ivInternallyGenerated")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("ivInternallyGenerated")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCBC.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$333, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$110, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCBC.h")
	.dwattr $C$DW$T$110, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$T$110, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$110

$C$DW$T$354	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$354, DW_AT_name("AESCBC_Operation")
	.dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$354, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$354, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCBC.h")
	.dwattr $C$DW$T$354, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$T$354, DW_AT_decl_column(0x03)

$C$DW$T$355	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$354)
	.dwattr $C$DW$T$355, DW_AT_address_class(0x20)


$C$DW$T$113	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$113, DW_AT_byte_size(0x14)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$334, DW_AT_name("key")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("key")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTR.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$334, DW_AT_decl_column(0x1e)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$335, DW_AT_name("input")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("input")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTR.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$335, DW_AT_decl_column(0x1e)

$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$336, DW_AT_name("output")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("output")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTR.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$336, DW_AT_decl_column(0x1e)

$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$337, DW_AT_name("initialCounter")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("initialCounter")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTR.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$337, DW_AT_decl_column(0x1e)

$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$338, DW_AT_name("inputLength")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("inputLength")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTR.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$338, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$113, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTR.h")
	.dwattr $C$DW$T$113, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$T$113, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$113

$C$DW$T$121	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$121, DW_AT_name("AESCTR_Operation")
	.dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$121, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTR.h")
	.dwattr $C$DW$T$121, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$T$121, DW_AT_decl_column(0x03)

$C$DW$T$122	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
	.dwattr $C$DW$T$122, DW_AT_address_class(0x20)


$C$DW$T$126	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$126, DW_AT_byte_size(0x18)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$339, DW_AT_name("isOpen")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("isOpen")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$339, DW_AT_decl_column(0x25)

$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$340, DW_AT_name("operationInProgress")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("operationInProgress")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x70)
	.dwattr $C$DW$340, DW_AT_decl_column(0x25)

$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$341, DW_AT_name("operationCanceled")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("operationCanceled")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0x71)
	.dwattr $C$DW$341, DW_AT_decl_column(0x25)

$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$342, DW_AT_name("threadSafe")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("threadSafe")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0x72)
	.dwattr $C$DW$342, DW_AT_decl_column(0x25)

$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$343, DW_AT_name("returnStatus")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("returnStatus")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0x73)
	.dwattr $C$DW$343, DW_AT_decl_column(0x25)

$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$344, DW_AT_name("returnBehavior")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("returnBehavior")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$344, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0x74)
	.dwattr $C$DW$344, DW_AT_decl_column(0x25)

$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$345, DW_AT_name("operationType")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("operationType")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0x75)
	.dwattr $C$DW$345, DW_AT_decl_column(0x25)

$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$346, DW_AT_name("semaphoreTimeout")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("semaphoreTimeout")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$346, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0x76)
	.dwattr $C$DW$346, DW_AT_decl_column(0x25)

$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$347, DW_AT_name("callbackFxn")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("callbackFxn")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$347, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0x77)
	.dwattr $C$DW$347, DW_AT_decl_column(0x25)

$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$348, DW_AT_name("operation")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("operation")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$348, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$348, DW_AT_decl_line(0x78)
	.dwattr $C$DW$348, DW_AT_decl_column(0x26)

	.dwattr $C$DW$T$126, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$T$126, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$T$126, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$126

$C$DW$T$1362	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1362, DW_AT_name("AESCTRCC26XX_Object")
	.dwattr $C$DW$T$1362, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$1362, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1362, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$T$1362, DW_AT_decl_line(0x79)
	.dwattr $C$DW$T$1362, DW_AT_decl_column(0x03)


$C$DW$T$1363	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$1363, DW_AT_type(*$C$DW$T$1362)
	.dwattr $C$DW$T$1363, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1363, DW_AT_byte_size(0x18)
$C$DW$349	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$349, DW_AT_upper_bound(0x00)

	.dwendtag $C$DW$T$1363


$C$DW$T$127	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$127, DW_AT_byte_size(0x01)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$350, DW_AT_name("intPriority")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("intPriority")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x66)
	.dwattr $C$DW$350, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$127, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$T$127, DW_AT_decl_line(0x59)
	.dwattr $C$DW$T$127, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$127

$C$DW$T$1365	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1365, DW_AT_name("AESCTRCC26XX_HWAttrs")
	.dwattr $C$DW$T$1365, DW_AT_type(*$C$DW$T$127)
	.dwattr $C$DW$T$1365, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1365, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctr/AESCTRCC26XX.h")
	.dwattr $C$DW$T$1365, DW_AT_decl_line(0x67)
	.dwattr $C$DW$T$1365, DW_AT_decl_column(0x03)

$C$DW$T$1366	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1366, DW_AT_type(*$C$DW$T$1365)


$C$DW$T$1367	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$1367, DW_AT_type(*$C$DW$T$1366)
	.dwattr $C$DW$T$1367, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1367, DW_AT_byte_size(0x01)
$C$DW$351	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$351, DW_AT_upper_bound(0x00)

	.dwendtag $C$DW$T$1367


$C$DW$T$128	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$128, DW_AT_byte_size(0x10)
$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$352, DW_AT_name("key")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("key")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$352, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESECB.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$352, DW_AT_decl_column(0x1e)

$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$353, DW_AT_name("input")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("input")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$353, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESECB.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$353, DW_AT_decl_column(0x1e)

$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$354, DW_AT_name("output")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("output")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$354, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESECB.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0x171)
	.dwattr $C$DW$354, DW_AT_decl_column(0x1e)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$355, DW_AT_name("inputLength")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("inputLength")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$355, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESECB.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0x177)
	.dwattr $C$DW$355, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$128, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESECB.h")
	.dwattr $C$DW$T$128, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$T$128, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$128

$C$DW$T$367	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$367, DW_AT_name("AESECB_Operation")
	.dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$367, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESECB.h")
	.dwattr $C$DW$T$367, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$367, DW_AT_decl_column(0x03)

$C$DW$T$368	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$368, DW_AT_type(*$C$DW$T$367)
	.dwattr $C$DW$T$368, DW_AT_address_class(0x20)


$C$DW$T$131	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$131, DW_AT_byte_size(0x58)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$356, DW_AT_name("keyingMaterial")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("keyingMaterial")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$356, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0x67)
	.dwattr $C$DW$356, DW_AT_decl_column(0x25)

$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$357, DW_AT_name("counter")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("counter")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$357, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0x68)
	.dwattr $C$DW$357, DW_AT_decl_column(0x25)

$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$358, DW_AT_name("key")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("key")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$358, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0x69)
	.dwattr $C$DW$358, DW_AT_decl_column(0x25)

$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$120)
	.dwattr $C$DW$359, DW_AT_name("ctrHandle")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("ctrHandle")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$359, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$359, DW_AT_decl_column(0x25)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$360, DW_AT_name("seedLength")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("seedLength")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$360, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$360, DW_AT_decl_column(0x25)

$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$361, DW_AT_name("reseedCounter")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("reseedCounter")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$361, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$361, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$361, DW_AT_decl_column(0x25)

$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$362, DW_AT_name("reseedInterval")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("reseedInterval")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$362, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$362, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$362, DW_AT_decl_column(0x25)

$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$363, DW_AT_name("returnStatus")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("returnStatus")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$363, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$363, DW_AT_decl_column(0x25)

$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$364, DW_AT_name("isOpen")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("isOpen")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$364, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$364, DW_AT_decl_column(0x25)

	.dwattr $C$DW$T$131, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$T$131, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$131, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$131

$C$DW$T$1369	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1369, DW_AT_name("AESCTRDRBGXX_Object")
	.dwattr $C$DW$T$1369, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$T$1369, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1369, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$T$1369, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$1369, DW_AT_decl_column(0x03)


$C$DW$T$1370	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$1370, DW_AT_type(*$C$DW$T$1369)
	.dwattr $C$DW$T$1370, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1370, DW_AT_byte_size(0x58)
$C$DW$365	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$365, DW_AT_upper_bound(0x00)

	.dwendtag $C$DW$T$1370


$C$DW$T$134	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$134, DW_AT_byte_size(0x01)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$366, DW_AT_name("aesctrIndex")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("aesctrIndex")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$366, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$366, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$366, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$134, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$T$134, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$T$134, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$134

$C$DW$T$1372	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1372, DW_AT_name("AESCTRDRBGXX_HWAttrs")
	.dwattr $C$DW$T$1372, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$T$1372, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1372, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/aesctrdrbg/AESCTRDRBGXX.h")
	.dwattr $C$DW$T$1372, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$T$1372, DW_AT_decl_column(0x03)

$C$DW$T$1373	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1373, DW_AT_type(*$C$DW$T$1372)


$C$DW$T$1374	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$1374, DW_AT_type(*$C$DW$T$1373)
	.dwattr $C$DW$T$1374, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1374, DW_AT_byte_size(0x01)
$C$DW$367	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$367, DW_AT_upper_bound(0x00)

	.dwendtag $C$DW$T$1374


$C$DW$T$137	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$137, DW_AT_byte_size(0x08)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$368, DW_AT_name("object")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("object")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTRDRBG.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$368, DW_AT_decl_column(0x19)

$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$369, DW_AT_name("hwAttrs")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("hwAttrs")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTRDRBG.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0x170)
	.dwattr $C$DW$369, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$137, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTRDRBG.h")
	.dwattr $C$DW$T$137, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$T$137, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$137

$C$DW$T$1376	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1376, DW_AT_name("AESCTRDRBG_Config")
	.dwattr $C$DW$T$1376, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$1376, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1376, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTRDRBG.h")
	.dwattr $C$DW$T$1376, DW_AT_decl_line(0x171)
	.dwattr $C$DW$T$1376, DW_AT_decl_column(0x03)

$C$DW$T$1377	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1377, DW_AT_type(*$C$DW$T$1376)


$C$DW$T$1378	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$1378, DW_AT_type(*$C$DW$T$1377)
	.dwattr $C$DW$T$1378, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1378, DW_AT_byte_size(0x08)
$C$DW$370	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$370, DW_AT_upper_bound(0x00)

	.dwendtag $C$DW$T$1378

$C$DW$T$1379	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1379, DW_AT_type(*$C$DW$T$1376)
	.dwattr $C$DW$T$1379, DW_AT_address_class(0x20)

$C$DW$T$1380	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1380, DW_AT_name("AESCTRDRBG_Handle")
	.dwattr $C$DW$T$1380, DW_AT_type(*$C$DW$T$1379)
	.dwattr $C$DW$T$1380, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1380, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/AESCTRDRBG.h")
	.dwattr $C$DW$T$1380, DW_AT_decl_line(0x176)
	.dwattr $C$DW$T$1380, DW_AT_decl_column(0x1c)


$C$DW$T$140	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$140, DW_AT_byte_size(0x18)
$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$371, DW_AT_name("count")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("count")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$371, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0x235)
	.dwattr $C$DW$371, DW_AT_decl_column(0x10)

$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$372, DW_AT_name("txBuf")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("txBuf")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x236)
	.dwattr $C$DW$372, DW_AT_decl_column(0x10)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$373, DW_AT_name("rxBuf")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("rxBuf")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x237)
	.dwattr $C$DW$373, DW_AT_decl_column(0x10)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$374, DW_AT_name("arg")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("arg")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x238)
	.dwattr $C$DW$374, DW_AT_decl_column(0x10)

$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$375, DW_AT_name("status")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$375, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0x23b)
	.dwattr $C$DW$375, DW_AT_decl_column(0x10)

$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$376, DW_AT_name("nextPtr")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("nextPtr")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$376, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0x23d)
	.dwattr $C$DW$376, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$140, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$140, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$140, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$140

$C$DW$T$145	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$145, DW_AT_name("SPI_Transaction")
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$140)
	.dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$145, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x23f)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x03)

$C$DW$T$146	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$T$146, DW_AT_address_class(0x20)


$C$DW$T$154	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$154, DW_AT_byte_size(0x20)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$142)
	.dwattr $C$DW$377, DW_AT_name("transferMode")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("transferMode")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$377, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x283)
	.dwattr $C$DW$377, DW_AT_decl_column(0x16)

$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$378, DW_AT_name("transferTimeout")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("transferTimeout")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x284)
	.dwattr $C$DW$378, DW_AT_decl_column(0x16)

$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$379, DW_AT_name("transferCallbackFxn")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("transferCallbackFxn")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0x286)
	.dwattr $C$DW$379, DW_AT_decl_column(0x16)

$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$380, DW_AT_name("mode")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("mode")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0x287)
	.dwattr $C$DW$380, DW_AT_decl_column(0x16)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$381, DW_AT_name("bitRate")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("bitRate")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0x295)
	.dwattr $C$DW$381, DW_AT_decl_column(0x16)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$382, DW_AT_name("dataSize")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("dataSize")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0x296)
	.dwattr $C$DW$382, DW_AT_decl_column(0x16)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$383, DW_AT_name("frameFormat")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("frameFormat")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0x297)
	.dwattr $C$DW$383, DW_AT_decl_column(0x16)

$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$384, DW_AT_name("custom")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("custom")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0x298)
	.dwattr $C$DW$384, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$154, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$154, DW_AT_decl_line(0x282)
	.dwattr $C$DW$T$154, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$154

$C$DW$T$162	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$162, DW_AT_name("SPI_Params")
	.dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$162, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$162, DW_AT_decl_line(0x29a)
	.dwattr $C$DW$T$162, DW_AT_decl_column(0x03)

$C$DW$T$163	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$T$163, DW_AT_address_class(0x20)


$C$DW$T$171	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$171, DW_AT_byte_size(0x18)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$385, DW_AT_name("closeFxn")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("closeFxn")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0x2c9)
	.dwattr $C$DW$385, DW_AT_decl_column(0x1b)

$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$386, DW_AT_name("controlFxn")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("controlFxn")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x2cc)
	.dwattr $C$DW$386, DW_AT_decl_column(0x1b)

$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$387, DW_AT_name("initFxn")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("initFxn")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$387, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x2cf)
	.dwattr $C$DW$387, DW_AT_decl_column(0x1b)

$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$388, DW_AT_name("openFxn")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("openFxn")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$388, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0x2d2)
	.dwattr $C$DW$388, DW_AT_decl_column(0x1b)

$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$389, DW_AT_name("transferFxn")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("transferFxn")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$389, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0x2d5)
	.dwattr $C$DW$389, DW_AT_decl_column(0x1b)

$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$390, DW_AT_name("transferCancelFxn")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("transferCancelFxn")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$390, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x2d8)
	.dwattr $C$DW$390, DW_AT_decl_column(0x1b)

	.dwattr $C$DW$T$171, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0x2c7)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$171

$C$DW$T$1069	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1069, DW_AT_name("SPI_FxnTable")
	.dwattr $C$DW$T$1069, DW_AT_type(*$C$DW$T$171)
	.dwattr $C$DW$T$1069, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1069, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$1069, DW_AT_decl_line(0x2d9)
	.dwattr $C$DW$T$1069, DW_AT_decl_column(0x03)

$C$DW$T$1070	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1070, DW_AT_type(*$C$DW$T$1069)

$C$DW$T$1071	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1071, DW_AT_type(*$C$DW$T$1070)
	.dwattr $C$DW$T$1071, DW_AT_address_class(0x20)


$C$DW$T$172	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$172, DW_AT_byte_size(0x08)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$391, DW_AT_name("fg")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("fg")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$391, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/display/DisplaySharp.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x52)
	.dwattr $C$DW$391, DW_AT_decl_column(0x0e)

$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$392, DW_AT_name("bg")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("bg")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/display/DisplaySharp.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x53)
	.dwattr $C$DW$392, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$172, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/display/DisplaySharp.h")
	.dwattr $C$DW$T$172, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$172, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$172

$C$DW$T$764	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$764, DW_AT_name("DisplaySharpColor_t")
	.dwattr $C$DW$T$764, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$T$764, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$764, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/display/DisplaySharp.h")
	.dwattr $C$DW$T$764, DW_AT_decl_line(0x54)
	.dwattr $C$DW$T$764, DW_AT_decl_column(0x03)


$C$DW$T$173	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$173, DW_AT_byte_size(0x1c)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$393, DW_AT_name("writeBuf")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("writeBuf")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x181)
	.dwattr $C$DW$393, DW_AT_decl_column(0x13)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$394, DW_AT_name("writeCount")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("writeCount")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x191)
	.dwattr $C$DW$394, DW_AT_decl_column(0x13)

$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$395, DW_AT_name("readBuf")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("readBuf")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x197)
	.dwattr $C$DW$395, DW_AT_decl_column(0x13)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$396, DW_AT_name("readCount")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("readCount")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$396, DW_AT_decl_column(0x13)

$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$397, DW_AT_name("slaveAddress")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("slaveAddress")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$397, DW_AT_decl_column(0x13)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$398, DW_AT_name("arg")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("arg")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$398, DW_AT_decl_column(0x13)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$399, DW_AT_name("nextPtr")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("nextPtr")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$399, DW_AT_decl_column(0x13)

	.dwattr $C$DW$T$173, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$T$173, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$T$173, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$173

$C$DW$T$178	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$178, DW_AT_name("I2C_Transaction")
	.dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$178, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$T$178, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$T$178, DW_AT_decl_column(0x03)

$C$DW$T$179	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$T$179, DW_AT_address_class(0x20)


$C$DW$T$185	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$185, DW_AT_byte_size(0x10)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$175)
	.dwattr $C$DW$400, DW_AT_name("transferMode")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("transferMode")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$400, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x218)
	.dwattr $C$DW$400, DW_AT_decl_column(0x16)

$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$182)
	.dwattr $C$DW$401, DW_AT_name("transferCallbackFxn")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("transferCallbackFxn")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$401, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0x21e)
	.dwattr $C$DW$401, DW_AT_decl_column(0x15)

$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$184)
	.dwattr $C$DW$402, DW_AT_name("bitRate")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("bitRate")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0x224)
	.dwattr $C$DW$402, DW_AT_decl_column(0x11)

$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$403, DW_AT_name("custom")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("custom")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0x227)
	.dwattr $C$DW$403, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$185, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$T$185, DW_AT_decl_line(0x216)
	.dwattr $C$DW$T$185, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$185

$C$DW$T$910	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$910, DW_AT_name("I2C_Params")
	.dwattr $C$DW$T$910, DW_AT_type(*$C$DW$T$185)
	.dwattr $C$DW$T$910, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$910, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/I2C.h")
	.dwattr $C$DW$T$910, DW_AT_decl_line(0x228)
	.dwattr $C$DW$T$910, DW_AT_decl_column(0x03)

$C$DW$T$911	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$911, DW_AT_type(*$C$DW$T$910)
	.dwattr $C$DW$T$911, DW_AT_address_class(0x20)


$C$DW$T$192	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$192, DW_AT_byte_size(0x14)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$186)
	.dwattr $C$DW$404, DW_AT_name("link")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("link")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$404, DW_AT_decl_column(0x0f)

$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$405, DW_AT_name("eventTypes")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("eventTypes")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$405, DW_AT_decl_column(0x13)

$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$191)
	.dwattr $C$DW$406, DW_AT_name("notifyFxn")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("notifyFxn")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$406, DW_AT_decl_column(0x15)

$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$188)
	.dwattr $C$DW$407, DW_AT_name("clientArg")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("clientArg")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$407, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$407, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$192, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$T$192, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$T$192, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$192

$C$DW$T$896	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$896, DW_AT_name("Power_NotifyObj")
	.dwattr $C$DW$T$896, DW_AT_type(*$C$DW$T$192)
	.dwattr $C$DW$T$896, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$896, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$T$896, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$T$896, DW_AT_decl_column(0x03)


$C$DW$T$193	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$193, DW_AT_byte_size(0x0c)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$408, DW_AT_name("regionBase")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("regionBase")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$408, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$408, DW_AT_decl_column(0x0d)

$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$409, DW_AT_name("regionSize")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("regionSize")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$409, DW_AT_decl_column(0x0d)

$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$410, DW_AT_name("sectorSize")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("sectorSize")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$410, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$T$193, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$T$193, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$193

$C$DW$T$206	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$206, DW_AT_name("NVS_Attrs")
	.dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$193)
	.dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$206, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$T$206, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$T$206, DW_AT_decl_column(0x03)

$C$DW$T$207	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$T$207, DW_AT_address_class(0x20)


$C$DW$T$194	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$194, DW_AT_byte_size(0x04)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$411, DW_AT_name("custom")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("custom")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$411, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$194, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$T$194, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$T$194, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$194

$C$DW$T$217	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$217, DW_AT_name("NVS_Params")
	.dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$194)
	.dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$217, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$T$217, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$T$217, DW_AT_decl_column(0x03)

$C$DW$T$218	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$217)
	.dwattr $C$DW$T$218, DW_AT_address_class(0x20)


$C$DW$T$229	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$229, DW_AT_byte_size(0x28)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$199)
	.dwattr $C$DW$412, DW_AT_name("closeFxn")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("closeFxn")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$412, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$412, DW_AT_decl_line(0x241)
	.dwattr $C$DW$412, DW_AT_decl_column(0x19)

$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$202)
	.dwattr $C$DW$413, DW_AT_name("controlFxn")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("controlFxn")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$413, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$413, DW_AT_decl_line(0x244)
	.dwattr $C$DW$413, DW_AT_decl_column(0x19)

$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$205)
	.dwattr $C$DW$414, DW_AT_name("eraseFxn")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("eraseFxn")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$414, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$414, DW_AT_decl_line(0x247)
	.dwattr $C$DW$414, DW_AT_decl_column(0x19)

$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$210)
	.dwattr $C$DW$415, DW_AT_name("getAttrsFxn")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("getAttrsFxn")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$415, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0x24a)
	.dwattr $C$DW$415, DW_AT_decl_column(0x19)

$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$213)
	.dwattr $C$DW$416, DW_AT_name("initFxn")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("initFxn")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$416, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0x24d)
	.dwattr $C$DW$416, DW_AT_decl_column(0x19)

$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$216)
	.dwattr $C$DW$417, DW_AT_name("lockFxn")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("lockFxn")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$417, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0x250)
	.dwattr $C$DW$417, DW_AT_decl_column(0x19)

$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$221)
	.dwattr $C$DW$418, DW_AT_name("openFxn")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("openFxn")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$418, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$418, DW_AT_decl_line(0x253)
	.dwattr $C$DW$418, DW_AT_decl_column(0x19)

$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$224)
	.dwattr $C$DW$419, DW_AT_name("readFxn")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("readFxn")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$419, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0x256)
	.dwattr $C$DW$419, DW_AT_decl_column(0x19)

$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$225)
	.dwattr $C$DW$420, DW_AT_name("unlockFxn")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("unlockFxn")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0x259)
	.dwattr $C$DW$420, DW_AT_decl_column(0x19)

$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$228)
	.dwattr $C$DW$421, DW_AT_name("writeFxn")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("writeFxn")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0x25c)
	.dwattr $C$DW$421, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$229, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$T$229, DW_AT_decl_line(0x23f)
	.dwattr $C$DW$T$229, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$229

$C$DW$T$962	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$962, DW_AT_name("NVS_FxnTable")
	.dwattr $C$DW$T$962, DW_AT_type(*$C$DW$T$229)
	.dwattr $C$DW$T$962, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$962, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/NVS.h")
	.dwattr $C$DW$T$962, DW_AT_decl_line(0x25d)
	.dwattr $C$DW$T$962, DW_AT_decl_column(0x03)

$C$DW$T$963	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$963, DW_AT_type(*$C$DW$T$962)

$C$DW$T$964	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$964, DW_AT_type(*$C$DW$T$963)
	.dwattr $C$DW$T$964, DW_AT_address_class(0x20)


$C$DW$T$230	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$230, DW_AT_byte_size(0x01)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$422, DW_AT_name("opened")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("opened")
