;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
;* Date/Time created: Fri Apr  2 00:57:46 2021                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=none --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../easylink/EasyLink.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("EasyLink_supportedPhys")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("EasyLink_supportedPhys")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$1174)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1, DW_AT_decl_column(0x1b)

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("EasyLink_numSupportedPhys")

	.dwattr $C$DW$584, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$584, DW_AT_decl_column(0x04)

$C$DW$585	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$585, DW_AT_name("PACKAGE_7x7")
	.dwattr $C$DW$585, DW_AT_const_value(0x02)
	.dwattr $C$DW$585, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$585, DW_AT_decl_column(0x04)

$C$DW$586	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$586, DW_AT_name("PACKAGE_WAFER")
	.dwattr $C$DW$586, DW_AT_const_value(0x03)
	.dwattr $C$DW$586, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0xab)
	.dwattr $C$DW$586, DW_AT_decl_column(0x04)

$C$DW$587	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$587, DW_AT_name("PACKAGE_WCSP")
	.dwattr $C$DW$587, DW_AT_const_value(0x04)
	.dwattr $C$DW$587, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0xac)
	.dwattr $C$DW$587, DW_AT_decl_column(0x04)

$C$DW$588	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$588, DW_AT_name("PACKAGE_7x7_Q1")
	.dwattr $C$DW$588, DW_AT_const_value(0x05)
	.dwattr $C$DW$588, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0xad)
	.dwattr $C$DW$588, DW_AT_decl_column(0x04)

	.dwattr $C$DW$T$1160, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$T$1160, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$T$1160, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$1160

$C$DW$T$1161	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1161, DW_AT_name("PackageType_t")
	.dwattr $C$DW$T$1161, DW_AT_type(*$C$DW$T$1160)
	.dwattr $C$DW$T$1161, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1161, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$T$1161, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1161, DW_AT_decl_column(0x03)


$C$DW$T$1162	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1162, DW_AT_byte_size(0x01)
$C$DW$589	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$589, DW_AT_name("HWREV_Unknown")
	.dwattr $C$DW$589, DW_AT_const_value(-1)
	.dwattr $C$DW$589, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$589, DW_AT_decl_column(0x04)

$C$DW$590	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$590, DW_AT_name("HWREV_1_0")
	.dwattr $C$DW$590, DW_AT_const_value(0x0a)
	.dwattr $C$DW$590, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0x1e0)
	.dwattr $C$DW$590, DW_AT_decl_column(0x04)

$C$DW$591	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$591, DW_AT_name("HWREV_1_1")
	.dwattr $C$DW$591, DW_AT_const_value(0x0b)
	.dwattr $C$DW$591, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$591, DW_AT_decl_column(0x04)

$C$DW$592	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$592, DW_AT_name("HWREV_2_0")
	.dwattr $C$DW$592, DW_AT_const_value(0x14)
	.dwattr $C$DW$592, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$592, DW_AT_decl_column(0x04)

$C$DW$593	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$593, DW_AT_name("HWREV_2_1")
	.dwattr $C$DW$593, DW_AT_const_value(0x15)
	.dwattr $C$DW$593, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$593, DW_AT_decl_column(0x04)

$C$DW$594	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$594, DW_AT_name("HWREV_2_2")
	.dwattr $C$DW$594, DW_AT_const_value(0x16)
	.dwattr $C$DW$594, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$594, DW_AT_decl_column(0x04)

$C$DW$595	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$595, DW_AT_name("HWREV_2_3")
	.dwattr $C$DW$595, DW_AT_const_value(0x17)
	.dwattr $C$DW$595, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$595, DW_AT_decl_column(0x04)

$C$DW$596	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$596, DW_AT_name("HWREV_2_4")
	.dwattr $C$DW$596, DW_AT_const_value(0x18)
	.dwattr $C$DW$596, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$596, DW_AT_decl_column(0x04)

	.dwattr $C$DW$T$1162, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$T$1162, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$T$1162, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$1162

$C$DW$T$1163	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1163, DW_AT_name("HwRevision_t")
	.dwattr $C$DW$T$1163, DW_AT_type(*$C$DW$T$1162)
	.dwattr $C$DW$T$1163, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1163, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/chipinfo.h")
	.dwattr $C$DW$T$1163, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$T$1163, DW_AT_decl_column(0x03)


$C$DW$T$129	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$129, DW_AT_byte_size(0x10)
$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$597, DW_AT_name("rfMode")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("rfMode")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0x437)
	.dwattr $C$DW$597, DW_AT_decl_column(0x0d)

$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$598, DW_AT_name("cpePatchFxn")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("cpePatchFxn")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0x438)
	.dwattr $C$DW$598, DW_AT_decl_column(0x0c)

$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$599, DW_AT_name("mcePatchFxn")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("mcePatchFxn")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$599, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$599, DW_AT_decl_line(0x439)
	.dwattr $C$DW$599, DW_AT_decl_column(0x0c)

$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$600, DW_AT_name("rfePatchFxn")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("rfePatchFxn")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$600, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$600, DW_AT_decl_line(0x43a)
	.dwattr $C$DW$600, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$129, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$129, DW_AT_decl_line(0x436)
	.dwattr $C$DW$T$129, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$129

$C$DW$T$150	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$150, DW_AT_name("RF_Mode")
	.dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$150, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$150, DW_AT_decl_line(0x43b)
	.dwattr $C$DW$T$150, DW_AT_decl_column(0x03)

$C$DW$T$151	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$T$151, DW_AT_address_class(0x20)


$C$DW$T$130	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$130, DW_AT_byte_size(0x01)
$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$601, DW_AT_name("triggerType")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$601, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$601, DW_AT_bit_size(0x04)
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$601, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$601, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$601, DW_AT_decl_column(0x0f)

$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$602, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$602, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$602, DW_AT_bit_size(0x01)
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$602, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$602, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$602, DW_AT_decl_column(0x0f)

$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$603, DW_AT_name("triggerNo")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$603, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$603, DW_AT_bit_size(0x02)
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$603, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$603, DW_AT_decl_line(0x81)
	.dwattr $C$DW$603, DW_AT_decl_column(0x0f)

$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$604, DW_AT_name("pastTrig")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$604, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$604, DW_AT_bit_size(0x01)
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$604, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$604, DW_AT_decl_line(0x82)
	.dwattr $C$DW$604, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$130, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$130, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$130, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$130


$C$DW$T$131	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$131, DW_AT_byte_size(0x01)
$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$605, DW_AT_name("rule")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$605, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$605, DW_AT_bit_size(0x04)
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$605, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$605, DW_AT_decl_line(0x86)
	.dwattr $C$DW$605, DW_AT_decl_column(0x0f)

$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$606, DW_AT_name("nSkip")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$606, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$606, DW_AT_bit_size(0x04)
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$606, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$606, DW_AT_decl_line(0x87)
	.dwattr $C$DW$606, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$131, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$131, DW_AT_decl_line(0x85)
	.dwattr $C$DW$T$131, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$131


$C$DW$T$132	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$132, DW_AT_byte_size(0x01)
$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$607, DW_AT_name("triggerType")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$607, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$607, DW_AT_bit_size(0x04)
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$607, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$607, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$607, DW_AT_decl_column(0x0f)

$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$608, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$608, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$608, DW_AT_bit_size(0x01)
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$608, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$608, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$608, DW_AT_decl_column(0x0f)

$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$609, DW_AT_name("triggerNo")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$609, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$609, DW_AT_bit_size(0x02)
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$609, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$609, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$609, DW_AT_decl_column(0x0f)

$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$610, DW_AT_name("pastTrig")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$610, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$610, DW_AT_bit_size(0x01)
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$610, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$610, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$610, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$132, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$132, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$T$132, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$132


$C$DW$T$133	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$133, DW_AT_byte_size(0x01)
$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$611, DW_AT_name("rule")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$611, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$611, DW_AT_bit_size(0x04)
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$611, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$611, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$611, DW_AT_decl_column(0x0f)

$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$612, DW_AT_name("nSkip")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$612, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$612, DW_AT_bit_size(0x04)
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$612, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$612, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$612, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$133, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$133, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$T$133, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$133


$C$DW$T$136	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$136, DW_AT_byte_size(0x02)
$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$613, DW_AT_name("frontEndMode")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("frontEndMode")
	.dwattr $C$DW$613, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$613, DW_AT_bit_size(0x03)
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$613, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$613, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$613, DW_AT_decl_column(0x10)

$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$614, DW_AT_name("biasMode")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("biasMode")
	.dwattr $C$DW$614, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$614, DW_AT_bit_size(0x01)
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$614, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$614, DW_AT_decl_line(0xce)
	.dwattr $C$DW$614, DW_AT_decl_column(0x10)

$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$615, DW_AT_name("analogCfgMode")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("analogCfgMode")
	.dwattr $C$DW$615, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$615, DW_AT_bit_size(0x06)
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$615, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$615, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$615, DW_AT_decl_column(0x10)

$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$616, DW_AT_name("bNoFsPowerUp")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("bNoFsPowerUp")
	.dwattr $C$DW$616, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$616, DW_AT_bit_size(0x01)
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$616, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$616, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$616, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$136, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$136, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$136, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$136


$C$DW$T$137	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$137, DW_AT_byte_size(0x01)
$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$617, DW_AT_name("triggerType")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$617, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$617, DW_AT_bit_size(0x04)
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$617, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0x287)
	.dwattr $C$DW$617, DW_AT_decl_column(0x0f)

$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$618, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$618, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$618, DW_AT_bit_size(0x01)
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$618, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0x288)
	.dwattr $C$DW$618, DW_AT_decl_column(0x0f)

$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$619, DW_AT_name("triggerNo")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$619, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$619, DW_AT_bit_size(0x02)
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$619, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0x28a)
	.dwattr $C$DW$619, DW_AT_decl_column(0x0f)

$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$620, DW_AT_name("pastTrig")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$620, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$620, DW_AT_bit_size(0x01)
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$620, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0x28b)
	.dwattr $C$DW$620, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$137, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$T$137, DW_AT_decl_line(0x286)
	.dwattr $C$DW$T$137, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$137


$C$DW$T$138	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$138, DW_AT_byte_size(0x01)
$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$621, DW_AT_name("rule")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$621, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$621, DW_AT_bit_size(0x04)
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$621, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0x28f)
	.dwattr $C$DW$621, DW_AT_decl_column(0x0f)

$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$622, DW_AT_name("nSkip")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$622, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$622, DW_AT_bit_size(0x04)
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$622, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0x290)
	.dwattr $C$DW$622, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$138, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$T$138, DW_AT_decl_line(0x28e)
	.dwattr $C$DW$T$138, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$138


$C$DW$T$139	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$139, DW_AT_byte_size(0x01)
$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$623, DW_AT_name("mainMode")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("mainMode")
	.dwattr $C$DW$623, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$623, DW_AT_bit_size(0x02)
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$623, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0x293)
	.dwattr $C$DW$623, DW_AT_decl_column(0x0f)

$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$624, DW_AT_name("coding")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("coding")
	.dwattr $C$DW$624, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$624, DW_AT_bit_size(0x01)
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$624, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0x298)
	.dwattr $C$DW$624, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$139, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$T$139, DW_AT_decl_line(0x292)
	.dwattr $C$DW$T$139, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$139


$C$DW$T$140	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$140, DW_AT_byte_size(0x02)
$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$625, DW_AT_name("frontEndMode")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("frontEndMode")
	.dwattr $C$DW$625, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$625, DW_AT_bit_size(0x03)
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$625, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$625, DW_AT_decl_line(0x29e)
	.dwattr $C$DW$625, DW_AT_decl_column(0x10)

$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$626, DW_AT_name("biasMode")
	.dwattr $C$DW$626, DW_AT_TI_symbol_name("biasMode")
	.dwattr $C$DW$626, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$626, DW_AT_bit_size(0x01)
	.dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$626, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$626, DW_AT_decl_line(0x2a4)
	.dwattr $C$DW$626, DW_AT_decl_column(0x10)

$C$DW$627	.dwtag  DW_TAG_member
	.dwattr $C$DW$627, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$627, DW_AT_name("analogCfgMode")
	.dwattr $C$DW$627, DW_AT_TI_symbol_name("analogCfgMode")
	.dwattr $C$DW$627, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$627, DW_AT_bit_size(0x06)
	.dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$627, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$627, DW_AT_decl_line(0x2a6)
	.dwattr $C$DW$627, DW_AT_decl_column(0x10)

$C$DW$628	.dwtag  DW_TAG_member
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$628, DW_AT_name("bNoFsPowerUp")
	.dwattr $C$DW$628, DW_AT_TI_symbol_name("bNoFsPowerUp")
	.dwattr $C$DW$628, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$628, DW_AT_bit_size(0x01)
	.dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$628, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$628, DW_AT_decl_line(0x2ad)
	.dwattr $C$DW$628, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$140, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_ble_cmd.h")
	.dwattr $C$DW$T$140, DW_AT_decl_line(0x29d)
	.dwattr $C$DW$T$140, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$140


$C$DW$T$141	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$141, DW_AT_byte_size(0x01)
$C$DW$629	.dwtag  DW_TAG_member
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$629, DW_AT_name("triggerType")
	.dwattr $C$DW$629, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$629, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$629, DW_AT_bit_size(0x04)
	.dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$629, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$629, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$629, DW_AT_decl_column(0x0f)

$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$630, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$630, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$630, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$630, DW_AT_bit_size(0x01)
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$630, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$630, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$630, DW_AT_decl_column(0x0f)

$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$631, DW_AT_name("triggerNo")
	.dwattr $C$DW$631, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$631, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$631, DW_AT_bit_size(0x02)
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$631, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$631, DW_AT_decl_line(0x1d2)
	.dwattr $C$DW$631, DW_AT_decl_column(0x0f)

$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$632, DW_AT_name("pastTrig")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$632, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$632, DW_AT_bit_size(0x01)
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$632, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$632, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$632, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$141, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$141, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$T$141, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$141


$C$DW$T$142	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$142, DW_AT_byte_size(0x01)
$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$633, DW_AT_name("rule")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$633, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$633, DW_AT_bit_size(0x04)
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$633, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$633, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$633, DW_AT_decl_column(0x0f)

$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$634, DW_AT_name("nSkip")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$634, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$634, DW_AT_bit_size(0x04)
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$634, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$634, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$634, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$142, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$142, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$T$142, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$142


$C$DW$T$143	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$143, DW_AT_byte_size(0x02)
$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$635, DW_AT_name("modType")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("modType")
	.dwattr $C$DW$635, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$635, DW_AT_bit_size(0x03)
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$635, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$635, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$635, DW_AT_decl_column(0x10)

$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$636, DW_AT_name("deviation")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("deviation")
	.dwattr $C$DW$636, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$636, DW_AT_bit_size(0x0d)
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$636, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$636, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$143, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$143, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$T$143, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$143


$C$DW$T$146	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$146, DW_AT_byte_size(0x04)
$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$637, DW_AT_name("preScale")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("preScale")
	.dwattr $C$DW$637, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$637, DW_AT_bit_size(0x04)
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$637, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$637, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$637, DW_AT_decl_column(0x10)

$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$638, DW_AT_name("rateWord")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("rateWord")
	.dwattr $C$DW$638, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$638, DW_AT_bit_size(0x15)
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$638, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$638, DW_AT_decl_column(0x10)

$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$639, DW_AT_name("decimMode")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("decimMode")
	.dwattr $C$DW$639, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$639, DW_AT_bit_size(0x03)
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$639, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$639, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$146, DW_AT_decl_line(0x1e0)
	.dwattr $C$DW$T$146, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$146


$C$DW$T$147	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$147, DW_AT_byte_size(0x01)
$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$640, DW_AT_name("nPreamBytes")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("nPreamBytes")
	.dwattr $C$DW$640, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$640, DW_AT_bit_size(0x06)
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$640, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$640, DW_AT_decl_column(0x0f)

$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$641, DW_AT_name("preamMode")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("preamMode")
	.dwattr $C$DW$641, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$641, DW_AT_bit_size(0x02)
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$641, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$641, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$147


$C$DW$T$148	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$148, DW_AT_byte_size(0x02)
$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$642, DW_AT_name("nSwBits")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("nSwBits")
	.dwattr $C$DW$642, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$642, DW_AT_bit_size(0x06)
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$642, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$642, DW_AT_decl_column(0x10)

$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$643, DW_AT_name("bBitReversal")
	.dwattr $C$DW$643, DW_AT_TI_symbol_name("bBitReversal")
	.dwattr $C$DW$643, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$643, DW_AT_bit_size(0x01)
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$643, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$643, DW_AT_decl_column(0x10)

$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$644, DW_AT_name("bMsbFirst")
	.dwattr $C$DW$644, DW_AT_TI_symbol_name("bMsbFirst")
	.dwattr $C$DW$644, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$644, DW_AT_bit_size(0x01)
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$644, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$644, DW_AT_decl_column(0x10)

$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$645, DW_AT_name("fecMode")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("fecMode")
	.dwattr $C$DW$645, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$645, DW_AT_bit_size(0x04)
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$645, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$645, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$645, DW_AT_decl_column(0x10)

$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$646, DW_AT_name("whitenMode")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("whitenMode")
	.dwattr $C$DW$646, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$646, DW_AT_bit_size(0x03)
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$646, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0x202)
	.dwattr $C$DW$646, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$148, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$T$148, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$148


$C$DW$T$149	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$149, DW_AT_byte_size(0x02)
$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$647, DW_AT_name("frontEndMode")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("frontEndMode")
	.dwattr $C$DW$647, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$647, DW_AT_bit_size(0x03)
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$647, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0x20c)
	.dwattr $C$DW$647, DW_AT_decl_column(0x10)

$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$648, DW_AT_name("biasMode")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("biasMode")
	.dwattr $C$DW$648, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$648, DW_AT_bit_size(0x01)
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$648, DW_AT_decl_line(0x212)
	.dwattr $C$DW$648, DW_AT_decl_column(0x10)

$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$649, DW_AT_name("analogCfgMode")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("analogCfgMode")
	.dwattr $C$DW$649, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$649, DW_AT_bit_size(0x06)
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$649, DW_AT_decl_line(0x214)
	.dwattr $C$DW$649, DW_AT_decl_column(0x10)

$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$650, DW_AT_name("bNoFsPowerUp")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("bNoFsPowerUp")
	.dwattr $C$DW$650, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$650, DW_AT_bit_size(0x01)
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$650, DW_AT_decl_line(0x21b)
	.dwattr $C$DW$650, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$149, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$149, DW_AT_decl_line(0x20b)
	.dwattr $C$DW$T$149, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$149


$C$DW$T$156	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$156, DW_AT_byte_size(0x2c)
$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$651, DW_AT_name("nInactivityTimeout")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("nInactivityTimeout")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$651, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$651, DW_AT_decl_line(0x52a)
	.dwattr $C$DW$651, DW_AT_decl_column(0x1d)

$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$652, DW_AT_name("pRfMode")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("pRfMode")
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$652, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$652, DW_AT_decl_line(0x52b)
	.dwattr $C$DW$652, DW_AT_decl_column(0x1d)

$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$653, DW_AT_name("pRadioSetup")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("pRadioSetup")
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$653, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$653, DW_AT_decl_line(0x52c)
	.dwattr $C$DW$653, DW_AT_decl_column(0x1d)

$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$654, DW_AT_name("nPhySwitchingDuration")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("nPhySwitchingDuration")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$654, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$654, DW_AT_decl_line(0x52d)
	.dwattr $C$DW$654, DW_AT_decl_column(0x1d)

$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$655, DW_AT_name("nPowerUpDuration")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("nPowerUpDuration")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$655, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$655, DW_AT_decl_line(0x52e)
	.dwattr $C$DW$655, DW_AT_decl_column(0x1d)

$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$656, DW_AT_name("bMeasurePowerUpDuration")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$656, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$656, DW_AT_decl_line(0x52f)
	.dwattr $C$DW$656, DW_AT_decl_column(0x1d)

$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$657, DW_AT_name("bUpdateSetup")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("bUpdateSetup")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$657, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$657, DW_AT_decl_line(0x530)
	.dwattr $C$DW$657, DW_AT_decl_column(0x1d)

$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$658, DW_AT_name("nPowerUpDurationMargin")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$658, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$658, DW_AT_decl_line(0x531)
	.dwattr $C$DW$658, DW_AT_decl_column(0x1d)

$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$659, DW_AT_name("pPowerCb")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("pPowerCb")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$659, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$659, DW_AT_decl_line(0x532)
	.dwattr $C$DW$659, DW_AT_decl_column(0x1d)

$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$660, DW_AT_name("pErrCb")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("pErrCb")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$660, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$660, DW_AT_decl_line(0x533)
	.dwattr $C$DW$660, DW_AT_decl_column(0x1d)

$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$661, DW_AT_name("pClientEventCb")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("pClientEventCb")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$661, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$661, DW_AT_decl_line(0x534)
	.dwattr $C$DW$661, DW_AT_decl_column(0x1d)

$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$662, DW_AT_name("nClientEventMask")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("nClientEventMask")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$662, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$662, DW_AT_decl_line(0x535)
	.dwattr $C$DW$662, DW_AT_decl_column(0x1d)

$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$663, DW_AT_name("nPhySwitchingDurationMargin")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("nPhySwitchingDurationMargin")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$663, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$663, DW_AT_decl_line(0x536)
	.dwattr $C$DW$663, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$156, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$156, DW_AT_decl_line(0x529)
	.dwattr $C$DW$T$156, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$156


$C$DW$T$157	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$157, DW_AT_byte_size(0x01)
$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$664, DW_AT_name("triggerType")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$664, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$664, DW_AT_bit_size(0x04)
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$664, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$664, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$664, DW_AT_decl_column(0x0f)

$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$665, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$665, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$665, DW_AT_bit_size(0x01)
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$665, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$665, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$665, DW_AT_decl_column(0x0f)

$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$666, DW_AT_name("triggerNo")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$666, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$666, DW_AT_bit_size(0x02)
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$666, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$666, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$666, DW_AT_decl_column(0x0f)

$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$667, DW_AT_name("pastTrig")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$667, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$667, DW_AT_bit_size(0x01)
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$667, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$667, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$667, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$157, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$157, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$T$157, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$157


$C$DW$T$158	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$158, DW_AT_byte_size(0x01)
$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$668, DW_AT_name("rule")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$668, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$668, DW_AT_bit_size(0x04)
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$668, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$668, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$668, DW_AT_decl_column(0x0f)

$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$669, DW_AT_name("nSkip")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$669, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$669, DW_AT_bit_size(0x04)
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$669, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$669, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$669, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$158, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$158, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$158, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$158


$C$DW$T$159	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$159, DW_AT_byte_size(0x01)
$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$670, DW_AT_name("bTxMode")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("bTxMode")
	.dwattr $C$DW$670, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$670, DW_AT_bit_size(0x01)
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$670, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$670, DW_AT_decl_line(0x101)
	.dwattr $C$DW$670, DW_AT_decl_column(0x0f)

$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$671, DW_AT_name("refFreq")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("refFreq")
	.dwattr $C$DW$671, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$671, DW_AT_bit_size(0x06)
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$671, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$671, DW_AT_decl_line(0x103)
	.dwattr $C$DW$671, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$159, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$159, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$159, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$159


$C$DW$T$161	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$161, DW_AT_byte_size(0x18)
$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$672, DW_AT_name("cmdFs")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("cmdFs")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$672, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$672, DW_AT_decl_line(0x53b)
	.dwattr $C$DW$672, DW_AT_decl_column(0x21)

	.dwattr $C$DW$T$161, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$161, DW_AT_decl_line(0x53a)
	.dwattr $C$DW$T$161, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$161


$C$DW$T$168	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$168, DW_AT_byte_size(0x78)
$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$673, DW_AT_name("mode_state")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("mode_state")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$673, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$673, DW_AT_decl_line(0x53c)
	.dwattr $C$DW$673, DW_AT_decl_column(0x0b)

$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$674, DW_AT_name("semSync")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("semSync")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$674, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$674, DW_AT_decl_line(0x53d)
	.dwattr $C$DW$674, DW_AT_decl_column(0x21)

$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$675, DW_AT_name("eventSync")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("eventSync")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$675, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$675, DW_AT_decl_line(0x53e)
	.dwattr $C$DW$675, DW_AT_decl_column(0x21)

$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$676, DW_AT_name("pCbSync")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("pCbSync")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$676, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$676, DW_AT_decl_line(0x53f)
	.dwattr $C$DW$676, DW_AT_decl_column(0x21)

$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$677, DW_AT_name("unpendCause")
	.dwattr $C$DW$677, DW_AT_TI_symbol_name("unpendCause")
	.dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$677, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$677, DW_AT_decl_line(0x540)
	.dwattr $C$DW$677, DW_AT_decl_column(0x21)

$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$167)
	.dwattr $C$DW$678, DW_AT_name("clkReqAccess")
	.dwattr $C$DW$678, DW_AT_TI_symbol_name("clkReqAccess")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$678, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$678, DW_AT_decl_line(0x541)
	.dwattr $C$DW$678, DW_AT_decl_column(0x21)

$C$DW$679	.dwtag  DW_TAG_member
	.dwattr $C$DW$679, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$679, DW_AT_name("bYielded")
	.dwattr $C$DW$679, DW_AT_TI_symbol_name("bYielded")
	.dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$679, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$679, DW_AT_decl_line(0x542)
	.dwattr $C$DW$679, DW_AT_decl_column(0x21)

	.dwattr $C$DW$T$168, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$168, DW_AT_decl_line(0x539)
	.dwattr $C$DW$T$168, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$168


$C$DW$T$183	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$183, DW_AT_byte_size(0x1c)
$C$DW$680	.dwtag  DW_TAG_member
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$680, DW_AT_name("nInactivityTimeout")
	.dwattr $C$DW$680, DW_AT_TI_symbol_name("nInactivityTimeout")
	.dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$680, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$680, DW_AT_decl_line(0x5da)
	.dwattr $C$DW$680, DW_AT_decl_column(0x19)

$C$DW$681	.dwtag  DW_TAG_member
	.dwattr $C$DW$681, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$681, DW_AT_name("nPowerUpDuration")
	.dwattr $C$DW$681, DW_AT_TI_symbol_name("nPowerUpDuration")
	.dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$681, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$681, DW_AT_decl_line(0x5dd)
	.dwattr $C$DW$681, DW_AT_decl_column(0x19)

$C$DW$682	.dwtag  DW_TAG_member
	.dwattr $C$DW$682, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$682, DW_AT_name("pPowerCb")
	.dwattr $C$DW$682, DW_AT_TI_symbol_name("pPowerCb")
	.dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$682, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$682, DW_AT_decl_line(0x5e1)
	.dwattr $C$DW$682, DW_AT_decl_column(0x19)

$C$DW$683	.dwtag  DW_TAG_member
	.dwattr $C$DW$683, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$683, DW_AT_name("pErrCb")
	.dwattr $C$DW$683, DW_AT_TI_symbol_name("pErrCb")
	.dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$683, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$683, DW_AT_decl_line(0x5e4)
	.dwattr $C$DW$683, DW_AT_decl_column(0x19)

$C$DW$684	.dwtag  DW_TAG_member
	.dwattr $C$DW$684, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$684, DW_AT_name("nPowerUpDurationMargin")
	.dwattr $C$DW$684, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
	.dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$684, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$684, DW_AT_decl_line(0x5e6)
	.dwattr $C$DW$684, DW_AT_decl_column(0x19)

$C$DW$685	.dwtag  DW_TAG_member
	.dwattr $C$DW$685, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$685, DW_AT_name("nPhySwitchingDurationMargin")
	.dwattr $C$DW$685, DW_AT_TI_symbol_name("nPhySwitchingDurationMargin")
	.dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$685, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$685, DW_AT_decl_line(0x5eb)
	.dwattr $C$DW$685, DW_AT_decl_column(0x19)

$C$DW$686	.dwtag  DW_TAG_member
	.dwattr $C$DW$686, DW_AT_type(*$C$DW$T$182)
	.dwattr $C$DW$686, DW_AT_name("pClientEventCb")
	.dwattr $C$DW$686, DW_AT_TI_symbol_name("pClientEventCb")
	.dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$686, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$686, DW_AT_decl_line(0x5ed)
	.dwattr $C$DW$686, DW_AT_decl_column(0x19)

$C$DW$687	.dwtag  DW_TAG_member
	.dwattr $C$DW$687, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$687, DW_AT_name("nClientEventMask")
	.dwattr $C$DW$687, DW_AT_TI_symbol_name("nClientEventMask")
	.dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$687, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$687, DW_AT_decl_line(0x5f0)
	.dwattr $C$DW$687, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$183, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$183, DW_AT_decl_line(0x5d9)
	.dwattr $C$DW$T$183, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$183

$C$DW$T$1164	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1164, DW_AT_name("RF_Params")
	.dwattr $C$DW$T$1164, DW_AT_type(*$C$DW$T$183)
	.dwattr $C$DW$T$1164, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1164, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$1164, DW_AT_decl_line(0x5f2)
	.dwattr $C$DW$T$1164, DW_AT_decl_column(0x03)

$C$DW$T$1165	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1165, DW_AT_type(*$C$DW$T$1164)
	.dwattr $C$DW$T$1165, DW_AT_address_class(0x20)


$C$DW$T$186	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$186, DW_AT_byte_size(0x0c)
$C$DW$688	.dwtag  DW_TAG_member
	.dwattr $C$DW$688, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$688, DW_AT_name("endTime")
	.dwattr $C$DW$688, DW_AT_TI_symbol_name("endTime")
	.dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$688, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$688, DW_AT_decl_line(0x665)
	.dwattr $C$DW$688, DW_AT_decl_column(0x19)

$C$DW$689	.dwtag  DW_TAG_member
	.dwattr $C$DW$689, DW_AT_type(*$C$DW$T$185)
	.dwattr $C$DW$689, DW_AT_name("priority")
	.dwattr $C$DW$689, DW_AT_TI_symbol_name("priority")
	.dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$689, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$689, DW_AT_decl_line(0x666)
	.dwattr $C$DW$689, DW_AT_decl_column(0x19)

$C$DW$690	.dwtag  DW_TAG_member
	.dwattr $C$DW$690, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$690, DW_AT_name("allowDelay")
	.dwattr $C$DW$690, DW_AT_TI_symbol_name("allowDelay")
	.dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$690, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$690, DW_AT_decl_line(0x667)
	.dwattr $C$DW$690, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$186, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$186, DW_AT_decl_line(0x664)
	.dwattr $C$DW$T$186, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$186

$C$DW$T$1166	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1166, DW_AT_name("RF_ScheduleCmdParams")
	.dwattr $C$DW$T$1166, DW_AT_type(*$C$DW$T$186)
	.dwattr $C$DW$T$1166, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1166, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$1166, DW_AT_decl_line(0x66b)
	.dwattr $C$DW$T$1166, DW_AT_decl_column(0x03)

$C$DW$T$1167	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1167, DW_AT_type(*$C$DW$T$1166)
	.dwattr $C$DW$T$1167, DW_AT_address_class(0x20)


$C$DW$T$187	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$187, DW_AT_byte_size(0x04)
$C$DW$691	.dwtag  DW_TAG_member
	.dwattr $C$DW$691, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$691, DW_AT_name("rawValue")
	.dwattr $C$DW$691, DW_AT_TI_symbol_name("rawValue")
	.dwattr $C$DW$691, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$691, DW_AT_bit_size(0x16)
	.dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$691, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$691, DW_AT_decl_line(0x3ec)
	.dwattr $C$DW$691, DW_AT_decl_column(0x0e)

$C$DW$692	.dwtag  DW_TAG_member
	.dwattr $C$DW$692, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$692, DW_AT_name("__dummy")
	.dwattr $C$DW$692, DW_AT_TI_symbol_name("__dummy")
	.dwattr $C$DW$692, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$692, DW_AT_bit_size(0x09)
	.dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$692, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$692, DW_AT_decl_line(0x3f0)
	.dwattr $C$DW$692, DW_AT_decl_column(0x0e)

$C$DW$693	.dwtag  DW_TAG_member
	.dwattr $C$DW$693, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$693, DW_AT_name("paType")
	.dwattr $C$DW$693, DW_AT_TI_symbol_name("paType")
	.dwattr $C$DW$693, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$693, DW_AT_bit_size(0x01)
	.dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$693, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$693, DW_AT_decl_line(0x3f1)
	.dwattr $C$DW$693, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$187, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$187, DW_AT_decl_line(0x3eb)
	.dwattr $C$DW$T$187, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$187

$C$DW$T$190	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$190, DW_AT_name("RF_TxPowerTable_Value")
	.dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$187)
	.dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$190, DW_AT_decl_line(0x3f5)
	.dwattr $C$DW$T$190, DW_AT_decl_column(0x03)


$C$DW$T$191	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$191, DW_AT_byte_size(0x05)
$C$DW$694	.dwtag  DW_TAG_member
	.dwattr $C$DW$694, DW_AT_type(*$C$DW$T$189)
	.dwattr $C$DW$694, DW_AT_name("power")
	.dwattr $C$DW$694, DW_AT_TI_symbol_name("power")
	.dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$694, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$694, DW_AT_decl_line(0x40b)
	.dwattr $C$DW$694, DW_AT_decl_column(0x0c)

$C$DW$695	.dwtag  DW_TAG_member
	.dwattr $C$DW$695, DW_AT_type(*$C$DW$T$190)
	.dwattr $C$DW$695, DW_AT_name("value")
	.dwattr $C$DW$695, DW_AT_TI_symbol_name("value")
	.dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$695, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$695, DW_AT_decl_line(0x40e)
	.dwattr $C$DW$695, DW_AT_decl_column(0x1b)

	.dwattr $C$DW$T$191, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$191, DW_AT_decl_line(0x40a)
	.dwattr $C$DW$T$191, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$191

$C$DW$T$226	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$226, DW_AT_name("RF_TxPowerTable_Entry")
	.dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$191)
	.dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$226, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$226, DW_AT_decl_line(0x40f)
	.dwattr $C$DW$T$226, DW_AT_decl_column(0x1b)

$C$DW$T$227	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$226)
	.dwattr $C$DW$T$227, DW_AT_address_class(0x20)


$C$DW$T$197	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$197, DW_AT_byte_size(0x10)
$C$DW$696	.dwtag  DW_TAG_member
	.dwattr $C$DW$696, DW_AT_type(*$C$DW$T$193)
	.dwattr $C$DW$696, DW_AT_name("ui32ModType")
	.dwattr $C$DW$696, DW_AT_TI_symbol_name("ui32ModType")
	.dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$696, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$696, DW_AT_decl_line(0x102)
	.dwattr $C$DW$696, DW_AT_decl_column(0x16)

$C$DW$697	.dwtag  DW_TAG_member
	.dwattr $C$DW$697, DW_AT_type(*$C$DW$T$182)
	.dwattr $C$DW$697, DW_AT_name("pClientEventCb")
	.dwattr $C$DW$697, DW_AT_TI_symbol_name("pClientEventCb")
	.dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$697, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$697, DW_AT_decl_line(0x103)
	.dwattr $C$DW$697, DW_AT_decl_column(0x19)

$C$DW$698	.dwtag  DW_TAG_member
	.dwattr $C$DW$698, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$698, DW_AT_name("nClientEventMask")
	.dwattr $C$DW$698, DW_AT_TI_symbol_name("nClientEventMask")
	.dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$698, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$698, DW_AT_decl_line(0x104)
	.dwattr $C$DW$698, DW_AT_decl_column(0x19)

$C$DW$699	.dwtag  DW_TAG_member
	.dwattr $C$DW$699, DW_AT_type(*$C$DW$T$196)
	.dwattr $C$DW$699, DW_AT_name("pGrnFxn")
	.dwattr $C$DW$699, DW_AT_TI_symbol_name("pGrnFxn")
	.dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$699, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$699, DW_AT_decl_line(0x105)
	.dwattr $C$DW$699, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$197, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$T$197, DW_AT_decl_line(0x101)
	.dwattr $C$DW$T$197, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$197

$C$DW$T$1121	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1121, DW_AT_name("EasyLink_Params")
	.dwattr $C$DW$T$1121, DW_AT_type(*$C$DW$T$197)
	.dwattr $C$DW$T$1121, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1121, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$T$1121, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$1121, DW_AT_decl_column(0x03)

$C$DW$T$1172	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1172, DW_AT_type(*$C$DW$T$1121)

$C$DW$T$1122	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1122, DW_AT_type(*$C$DW$T$1121)
	.dwattr $C$DW$T$1122, DW_AT_address_class(0x20)


$C$DW$T$198	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$198, DW_AT_byte_size(0x01)
$C$DW$700	.dwtag  DW_TAG_member
	.dwattr $C$DW$700, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$700, DW_AT_name("triggerType")
	.dwattr $C$DW$700, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$700, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$700, DW_AT_bit_size(0x04)
	.dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$700, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$700, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$700, DW_AT_decl_column(0x0f)

$C$DW$701	.dwtag  DW_TAG_member
	.dwattr $C$DW$701, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$701, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$701, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$701, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$701, DW_AT_bit_size(0x01)
	.dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$701, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$701, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$701, DW_AT_decl_column(0x0f)

$C$DW$702	.dwtag  DW_TAG_member
	.dwattr $C$DW$702, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$702, DW_AT_name("triggerNo")
	.dwattr $C$DW$702, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$702, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$702, DW_AT_bit_size(0x02)
	.dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$702, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$702, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$702, DW_AT_decl_column(0x0f)

$C$DW$703	.dwtag  DW_TAG_member
	.dwattr $C$DW$703, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$703, DW_AT_name("pastTrig")
	.dwattr $C$DW$703, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$703, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$703, DW_AT_bit_size(0x01)
	.dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$703, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$703, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$703, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$198, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$198, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$198, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$198


$C$DW$T$199	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$199, DW_AT_byte_size(0x01)
$C$DW$704	.dwtag  DW_TAG_member
	.dwattr $C$DW$704, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$704, DW_AT_name("rule")
	.dwattr $C$DW$704, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$704, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$704, DW_AT_bit_size(0x04)
	.dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$704, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$704, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$704, DW_AT_decl_column(0x0f)

$C$DW$705	.dwtag  DW_TAG_member
	.dwattr $C$DW$705, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$705, DW_AT_name("nSkip")
	.dwattr $C$DW$705, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$705, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$705, DW_AT_bit_size(0x04)
	.dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$705, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$705, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$705, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$199, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$199, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$199, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$199


$C$DW$T$200	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$200, DW_AT_byte_size(0x01)
$C$DW$706	.dwtag  DW_TAG_member
	.dwattr $C$DW$706, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$706, DW_AT_name("bFsOff")
	.dwattr $C$DW$706, DW_AT_TI_symbol_name("bFsOff")
	.dwattr $C$DW$706, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$706, DW_AT_bit_size(0x01)
	.dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$706, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$706, DW_AT_decl_line(0x101)
	.dwattr $C$DW$706, DW_AT_decl_column(0x0f)

$C$DW$707	.dwtag  DW_TAG_member
	.dwattr $C$DW$707, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$707, DW_AT_name("bUseCrc")
	.dwattr $C$DW$707, DW_AT_TI_symbol_name("bUseCrc")
	.dwattr $C$DW$707, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$707, DW_AT_bit_size(0x01)
	.dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$707, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$707, DW_AT_decl_line(0x104)
	.dwattr $C$DW$707, DW_AT_decl_column(0x0f)

$C$DW$708	.dwtag  DW_TAG_member
	.dwattr $C$DW$708, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$708, DW_AT_name("bCrcIncSw")
	.dwattr $C$DW$708, DW_AT_TI_symbol_name("bCrcIncSw")
	.dwattr $C$DW$708, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$708, DW_AT_bit_size(0x01)
	.dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$708, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$708, DW_AT_decl_line(0x106)
	.dwattr $C$DW$708, DW_AT_decl_column(0x0f)

$C$DW$709	.dwtag  DW_TAG_member
	.dwattr $C$DW$709, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$709, DW_AT_name("bCrcIncHdr")
	.dwattr $C$DW$709, DW_AT_TI_symbol_name("bCrcIncHdr")
	.dwattr $C$DW$709, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$709, DW_AT_bit_size(0x01)
	.dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$709, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$709, DW_AT_decl_line(0x108)
	.dwattr $C$DW$709, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$200, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$200, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$200, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$200


$C$DW$T$201	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$201, DW_AT_byte_size(0x01)
$C$DW$710	.dwtag  DW_TAG_member
	.dwattr $C$DW$710, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$710, DW_AT_name("bExtTxTrig")
	.dwattr $C$DW$710, DW_AT_TI_symbol_name("bExtTxTrig")
	.dwattr $C$DW$710, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$710, DW_AT_bit_size(0x01)
	.dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$710, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$710, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$710, DW_AT_decl_column(0x0f)

$C$DW$711	.dwtag  DW_TAG_member
	.dwattr $C$DW$711, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$711, DW_AT_name("inputMode")
	.dwattr $C$DW$711, DW_AT_TI_symbol_name("inputMode")
	.dwattr $C$DW$711, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$711, DW_AT_bit_size(0x02)
	.dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$711, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$711, DW_AT_decl_line(0x110)
	.dwattr $C$DW$711, DW_AT_decl_column(0x0f)

$C$DW$712	.dwtag  DW_TAG_member
	.dwattr $C$DW$712, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$712, DW_AT_name("source")
	.dwattr $C$DW$712, DW_AT_TI_symbol_name("source")
	.dwattr $C$DW$712, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$712, DW_AT_bit_size(0x05)
	.dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$712, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$712, DW_AT_decl_line(0x115)
	.dwattr $C$DW$712, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$201, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$201, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$T$201, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$201


$C$DW$T$202	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$202, DW_AT_byte_size(0x01)
$C$DW$713	.dwtag  DW_TAG_member
	.dwattr $C$DW$713, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$713, DW_AT_name("triggerType")
	.dwattr $C$DW$713, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$713, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$713, DW_AT_bit_size(0x04)
	.dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$713, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$713, DW_AT_decl_line(0x118)
	.dwattr $C$DW$713, DW_AT_decl_column(0x0f)

$C$DW$714	.dwtag  DW_TAG_member
	.dwattr $C$DW$714, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$714, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$714, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$714, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$714, DW_AT_bit_size(0x01)
	.dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$714, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$714, DW_AT_decl_line(0x119)
	.dwattr $C$DW$714, DW_AT_decl_column(0x0f)

$C$DW$715	.dwtag  DW_TAG_member
	.dwattr $C$DW$715, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$715, DW_AT_name("triggerNo")
	.dwattr $C$DW$715, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$715, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$715, DW_AT_bit_size(0x02)
	.dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$715, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$715, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$715, DW_AT_decl_column(0x0f)

$C$DW$716	.dwtag  DW_TAG_member
	.dwattr $C$DW$716, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$716, DW_AT_name("pastTrig")
	.dwattr $C$DW$716, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$716, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$716, DW_AT_bit_size(0x01)
	.dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$716, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$716, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$716, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$202, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$202, DW_AT_decl_line(0x117)
	.dwattr $C$DW$T$202, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$202


$C$DW$T$203	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$203, DW_AT_byte_size(0x01)
$C$DW$717	.dwtag  DW_TAG_member
	.dwattr $C$DW$717, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$717, DW_AT_name("triggerType")
	.dwattr $C$DW$717, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$717, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$717, DW_AT_bit_size(0x04)
	.dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$717, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$717, DW_AT_decl_line(0x86)
	.dwattr $C$DW$717, DW_AT_decl_column(0x0f)

$C$DW$718	.dwtag  DW_TAG_member
	.dwattr $C$DW$718, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$718, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$718, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$718, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$718, DW_AT_bit_size(0x01)
	.dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$718, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$718, DW_AT_decl_line(0x87)
	.dwattr $C$DW$718, DW_AT_decl_column(0x0f)

$C$DW$719	.dwtag  DW_TAG_member
	.dwattr $C$DW$719, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$719, DW_AT_name("triggerNo")
	.dwattr $C$DW$719, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$719, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$719, DW_AT_bit_size(0x02)
	.dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$719, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$719, DW_AT_decl_line(0x89)
	.dwattr $C$DW$719, DW_AT_decl_column(0x0f)

$C$DW$720	.dwtag  DW_TAG_member
	.dwattr $C$DW$720, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$720, DW_AT_name("pastTrig")
	.dwattr $C$DW$720, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$720, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$720, DW_AT_bit_size(0x01)
	.dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$720, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$720, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$720, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$203, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$203, DW_AT_decl_line(0x85)
	.dwattr $C$DW$T$203, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$203


$C$DW$T$204	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$204, DW_AT_byte_size(0x01)
$C$DW$721	.dwtag  DW_TAG_member
	.dwattr $C$DW$721, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$721, DW_AT_name("rule")
	.dwattr $C$DW$721, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$721, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$721, DW_AT_bit_size(0x04)
	.dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$721, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$721, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$721, DW_AT_decl_column(0x0f)

$C$DW$722	.dwtag  DW_TAG_member
	.dwattr $C$DW$722, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$722, DW_AT_name("nSkip")
	.dwattr $C$DW$722, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$722, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$722, DW_AT_bit_size(0x04)
	.dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$722, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$722, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$722, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$204, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$204, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$T$204, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$204


$C$DW$T$205	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$205, DW_AT_byte_size(0x01)
$C$DW$723	.dwtag  DW_TAG_member
	.dwattr $C$DW$723, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$723, DW_AT_name("bFsOff")
	.dwattr $C$DW$723, DW_AT_TI_symbol_name("bFsOff")
	.dwattr $C$DW$723, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$723, DW_AT_bit_size(0x01)
	.dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$723, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$723, DW_AT_decl_line(0x92)
	.dwattr $C$DW$723, DW_AT_decl_column(0x0f)

$C$DW$724	.dwtag  DW_TAG_member
	.dwattr $C$DW$724, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$724, DW_AT_name("bUseCrc")
	.dwattr $C$DW$724, DW_AT_TI_symbol_name("bUseCrc")
	.dwattr $C$DW$724, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$724, DW_AT_bit_size(0x01)
	.dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$724, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$724, DW_AT_decl_line(0x95)
	.dwattr $C$DW$724, DW_AT_decl_column(0x0f)

$C$DW$725	.dwtag  DW_TAG_member
	.dwattr $C$DW$725, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$725, DW_AT_name("bVarLen")
	.dwattr $C$DW$725, DW_AT_TI_symbol_name("bVarLen")
	.dwattr $C$DW$725, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$725, DW_AT_bit_size(0x01)
	.dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$725, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$725, DW_AT_decl_line(0x97)
	.dwattr $C$DW$725, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$205, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$205, DW_AT_decl_line(0x91)
	.dwattr $C$DW$T$205, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$205


$C$DW$T$208	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$208, DW_AT_byte_size(0x90)
$C$DW$726	.dwtag  DW_TAG_member
	.dwattr $C$DW$726, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$726, DW_AT_name("dstAddr")
	.dwattr $C$DW$726, DW_AT_TI_symbol_name("dstAddr")
	.dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$726, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$726, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$726, DW_AT_decl_column(0x11)

$C$DW$727	.dwtag  DW_TAG_member
	.dwattr $C$DW$727, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$727, DW_AT_name("absTime")
	.dwattr $C$DW$727, DW_AT_TI_symbol_name("absTime")
	.dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$727, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$727, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$727, DW_AT_decl_column(0x12)

$C$DW$728	.dwtag  DW_TAG_member
	.dwattr $C$DW$728, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$728, DW_AT_name("len")
	.dwattr $C$DW$728, DW_AT_TI_symbol_name("len")
	.dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$728, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$728, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$728, DW_AT_decl_column(0x11)

$C$DW$729	.dwtag  DW_TAG_member
	.dwattr $C$DW$729, DW_AT_type(*$C$DW$T$207)
	.dwattr $C$DW$729, DW_AT_name("payload")
	.dwattr $C$DW$729, DW_AT_TI_symbol_name("payload")
	.dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$729, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$729, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$729, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$208, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$T$208, DW_AT_decl_line(0x129)
	.dwattr $C$DW$T$208, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$208

$C$DW$T$1129	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1129, DW_AT_name("EasyLink_TxPacket")
	.dwattr $C$DW$T$1129, DW_AT_type(*$C$DW$T$208)
	.dwattr $C$DW$T$1129, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1129, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$T$1129, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$1129, DW_AT_decl_column(0x03)

$C$DW$T$1130	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1130, DW_AT_type(*$C$DW$T$1129)
	.dwattr $C$DW$T$1130, DW_AT_address_class(0x20)


$C$DW$T$209	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$209, DW_AT_byte_size(0x98)
$C$DW$730	.dwtag  DW_TAG_member
	.dwattr $C$DW$730, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$730, DW_AT_name("dstAddr")
	.dwattr $C$DW$730, DW_AT_TI_symbol_name("dstAddr")
	.dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$730, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$730, DW_AT_decl_line(0x135)
	.dwattr $C$DW$730, DW_AT_decl_column(0x11)

$C$DW$731	.dwtag  DW_TAG_member
	.dwattr $C$DW$731, DW_AT_type(*$C$DW$T$189)
	.dwattr $C$DW$731, DW_AT_name("rssi")
	.dwattr $C$DW$731, DW_AT_TI_symbol_name("rssi")
	.dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$731, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$731, DW_AT_decl_line(0x136)
	.dwattr $C$DW$731, DW_AT_decl_column(0x10)

$C$DW$732	.dwtag  DW_TAG_member
	.dwattr $C$DW$732, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$732, DW_AT_name("absTime")
	.dwattr $C$DW$732, DW_AT_TI_symbol_name("absTime")
	.dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$732, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$732, DW_AT_decl_line(0x137)
