;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
;* Date/Time created: Fri Apr  2 00:57:45 2021                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=none --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../App/flight.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("mpu")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("mpu")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$750)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1, DW_AT_decl_column(0x0e)

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("ledPinHandle")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("ledPinHandle")

	.dwattr $C$DW$580, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0x24f)
	.dwattr $C$DW$580, DW_AT_decl_column(0x05)

$C$DW$581	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$581, DW_AT_name("SPI_SLAVE")
	.dwattr $C$DW$581, DW_AT_const_value(0x01)
	.dwattr $C$DW$581, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0x250)
	.dwattr $C$DW$581, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$144, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$144, DW_AT_decl_line(0x24e)
	.dwattr $C$DW$T$144, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$144

$C$DW$T$145	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$145, DW_AT_name("SPI_Mode")
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
	.dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$145, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x251)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x03)


$C$DW$T$146	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$146, DW_AT_byte_size(0x01)
$C$DW$582	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$582, DW_AT_name("SPI_POL0_PHA0")
	.dwattr $C$DW$582, DW_AT_const_value(0x00)
	.dwattr $C$DW$582, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0x258)
	.dwattr $C$DW$582, DW_AT_decl_column(0x05)

$C$DW$583	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$583, DW_AT_name("SPI_POL0_PHA1")
	.dwattr $C$DW$583, DW_AT_const_value(0x01)
	.dwattr $C$DW$583, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0x259)
	.dwattr $C$DW$583, DW_AT_decl_column(0x05)

$C$DW$584	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$584, DW_AT_name("SPI_POL1_PHA0")
	.dwattr $C$DW$584, DW_AT_const_value(0x02)
	.dwattr $C$DW$584, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0x25a)
	.dwattr $C$DW$584, DW_AT_decl_column(0x05)

$C$DW$585	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$585, DW_AT_name("SPI_POL1_PHA1")
	.dwattr $C$DW$585, DW_AT_const_value(0x03)
	.dwattr $C$DW$585, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0x25b)
	.dwattr $C$DW$585, DW_AT_decl_column(0x05)

$C$DW$586	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$586, DW_AT_name("SPI_TI")
	.dwattr $C$DW$586, DW_AT_const_value(0x04)
	.dwattr $C$DW$586, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0x25c)
	.dwattr $C$DW$586, DW_AT_decl_column(0x05)

$C$DW$587	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$587, DW_AT_name("SPI_MW")
	.dwattr $C$DW$587, DW_AT_const_value(0x05)
	.dwattr $C$DW$587, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0x25e)
	.dwattr $C$DW$587, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$146, DW_AT_decl_line(0x257)
	.dwattr $C$DW$T$146, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$146

$C$DW$T$147	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$147, DW_AT_name("SPI_FrameFormat")
	.dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0x260)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x03)


$C$DW$T$742	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$742, DW_AT_byte_size(0x01)
$C$DW$588	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$588, DW_AT_name("PIN_SUCCESS")
	.dwattr $C$DW$588, DW_AT_const_value(0x00)
	.dwattr $C$DW$588, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0x2cd)
	.dwattr $C$DW$588, DW_AT_decl_column(0x05)

$C$DW$589	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$589, DW_AT_name("PIN_ALREADY_ALLOCATED")
	.dwattr $C$DW$589, DW_AT_const_value(0x01)
	.dwattr $C$DW$589, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0x2ce)
	.dwattr $C$DW$589, DW_AT_decl_column(0x05)

$C$DW$590	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$590, DW_AT_name("PIN_NO_ACCESS")
	.dwattr $C$DW$590, DW_AT_const_value(0x02)
	.dwattr $C$DW$590, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0x2cf)
	.dwattr $C$DW$590, DW_AT_decl_column(0x05)

$C$DW$591	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$591, DW_AT_name("PIN_UNSUPPORTED")
	.dwattr $C$DW$591, DW_AT_const_value(0x03)
	.dwattr $C$DW$591, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0x2d0)
	.dwattr $C$DW$591, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$742, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$T$742, DW_AT_decl_line(0x2cc)
	.dwattr $C$DW$T$742, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$742

$C$DW$T$743	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$743, DW_AT_name("PIN_Status")
	.dwattr $C$DW$T$743, DW_AT_type(*$C$DW$T$742)
	.dwattr $C$DW$T$743, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$743, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$T$743, DW_AT_decl_line(0x2d1)
	.dwattr $C$DW$T$743, DW_AT_decl_column(0x03)


$C$DW$T$130	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$130, DW_AT_byte_size(0x18)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$592, DW_AT_name("periodUnits")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("periodUnits")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PWM.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0x148)
	.dwattr $C$DW$592, DW_AT_decl_column(0x16)

$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$593, DW_AT_name("periodValue")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("periodValue")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PWM.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0x149)
	.dwattr $C$DW$593, DW_AT_decl_column(0x16)

$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$127)
	.dwattr $C$DW$594, DW_AT_name("dutyUnits")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("dutyUnits")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PWM.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$594, DW_AT_decl_column(0x16)

$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$595, DW_AT_name("dutyValue")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("dutyValue")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PWM.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$595, DW_AT_decl_column(0x16)

$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$596, DW_AT_name("idleLevel")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("idleLevel")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PWM.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$596, DW_AT_decl_column(0x16)

$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$597, DW_AT_name("custom")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("custom")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PWM.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$597, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$130, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PWM.h")
	.dwattr $C$DW$T$130, DW_AT_decl_line(0x147)
	.dwattr $C$DW$T$130, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$130

$C$DW$T$341	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$341, DW_AT_name("PWM_Params")
	.dwattr $C$DW$T$341, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$T$341, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$341, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PWM.h")
	.dwattr $C$DW$T$341, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$T$341, DW_AT_decl_column(0x03)

$C$DW$T$342	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$T$342, DW_AT_address_class(0x20)


$C$DW$T$134	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$134, DW_AT_byte_size(0x18)
$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$598, DW_AT_name("count")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("count")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0x235)
	.dwattr $C$DW$598, DW_AT_decl_column(0x10)

$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$599, DW_AT_name("txBuf")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("txBuf")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$599, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$599, DW_AT_decl_line(0x236)
	.dwattr $C$DW$599, DW_AT_decl_column(0x10)

$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$600, DW_AT_name("rxBuf")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("rxBuf")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$600, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$600, DW_AT_decl_line(0x237)
	.dwattr $C$DW$600, DW_AT_decl_column(0x10)

$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$601, DW_AT_name("arg")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("arg")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$601, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$601, DW_AT_decl_line(0x238)
	.dwattr $C$DW$601, DW_AT_decl_column(0x10)

$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$602, DW_AT_name("status")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$602, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$602, DW_AT_decl_line(0x23b)
	.dwattr $C$DW$602, DW_AT_decl_column(0x10)

$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$603, DW_AT_name("nextPtr")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("nextPtr")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$603, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$603, DW_AT_decl_line(0x23d)
	.dwattr $C$DW$603, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$134, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$134, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$134, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$134

$C$DW$T$139	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$139, DW_AT_name("SPI_Transaction")
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$139, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$139, DW_AT_decl_line(0x23f)
	.dwattr $C$DW$T$139, DW_AT_decl_column(0x03)

$C$DW$T$140	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$T$140, DW_AT_address_class(0x20)


$C$DW$T$148	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$148, DW_AT_byte_size(0x20)
$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$604, DW_AT_name("transferMode")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("transferMode")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$604, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$604, DW_AT_decl_line(0x283)
	.dwattr $C$DW$604, DW_AT_decl_column(0x16)

$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$605, DW_AT_name("transferTimeout")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("transferTimeout")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$605, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$605, DW_AT_decl_line(0x284)
	.dwattr $C$DW$605, DW_AT_decl_column(0x16)

$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$606, DW_AT_name("transferCallbackFxn")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("transferCallbackFxn")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$606, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$606, DW_AT_decl_line(0x286)
	.dwattr $C$DW$606, DW_AT_decl_column(0x16)

$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$607, DW_AT_name("mode")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("mode")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$607, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$607, DW_AT_decl_line(0x287)
	.dwattr $C$DW$607, DW_AT_decl_column(0x16)

$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$608, DW_AT_name("bitRate")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("bitRate")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$608, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$608, DW_AT_decl_line(0x295)
	.dwattr $C$DW$608, DW_AT_decl_column(0x16)

$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$609, DW_AT_name("dataSize")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("dataSize")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$609, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$609, DW_AT_decl_line(0x296)
	.dwattr $C$DW$609, DW_AT_decl_column(0x16)

$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$147)
	.dwattr $C$DW$610, DW_AT_name("frameFormat")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("frameFormat")
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$610, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$610, DW_AT_decl_line(0x297)
	.dwattr $C$DW$610, DW_AT_decl_column(0x16)

$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$611, DW_AT_name("custom")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("custom")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$611, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$611, DW_AT_decl_line(0x298)
	.dwattr $C$DW$611, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$148, DW_AT_decl_line(0x282)
	.dwattr $C$DW$T$148, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$148

$C$DW$T$161	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$161, DW_AT_name("SPI_Params")
	.dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$161, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$161, DW_AT_decl_line(0x29a)
	.dwattr $C$DW$T$161, DW_AT_decl_column(0x03)

$C$DW$T$162	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$T$162, DW_AT_address_class(0x20)


$C$DW$T$171	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$171, DW_AT_byte_size(0x18)
$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$612, DW_AT_name("closeFxn")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("closeFxn")
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$612, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$612, DW_AT_decl_line(0x2c9)
	.dwattr $C$DW$612, DW_AT_decl_column(0x1b)

$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$613, DW_AT_name("controlFxn")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("controlFxn")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$613, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$613, DW_AT_decl_line(0x2cc)
	.dwattr $C$DW$613, DW_AT_decl_column(0x1b)

$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$614, DW_AT_name("initFxn")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("initFxn")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$614, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$614, DW_AT_decl_line(0x2cf)
	.dwattr $C$DW$614, DW_AT_decl_column(0x1b)

$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$615, DW_AT_name("openFxn")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("openFxn")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$615, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$615, DW_AT_decl_line(0x2d2)
	.dwattr $C$DW$615, DW_AT_decl_column(0x1b)

$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$616, DW_AT_name("transferFxn")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("transferFxn")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$616, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$616, DW_AT_decl_line(0x2d5)
	.dwattr $C$DW$616, DW_AT_decl_column(0x1b)

$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$617, DW_AT_name("transferCancelFxn")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("transferCancelFxn")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$617, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0x2d8)
	.dwattr $C$DW$617, DW_AT_decl_column(0x1b)

	.dwattr $C$DW$T$171, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0x2c7)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$171

$C$DW$T$356	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$356, DW_AT_name("SPI_FxnTable")
	.dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$171)
	.dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$356, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/SPI.h")
	.dwattr $C$DW$T$356, DW_AT_decl_line(0x2d9)
	.dwattr $C$DW$T$356, DW_AT_decl_column(0x03)

$C$DW$T$357	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$356)

$C$DW$T$358	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$T$358, DW_AT_address_class(0x20)


$C$DW$T$174	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$174, DW_AT_byte_size(0x3c)
$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$618, DW_AT_name("ref")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("ref")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$618, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0x03)
	.dwattr $C$DW$618, DW_AT_decl_column(0x18)

$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$619, DW_AT_name("fdb")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("fdb")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$619, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0x04)
	.dwattr $C$DW$619, DW_AT_decl_column(0x18)

$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$620, DW_AT_name("Kp")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("Kp")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$620, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0x05)
	.dwattr $C$DW$620, DW_AT_decl_column(0x18)

$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$621, DW_AT_name("Ki")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("Ki")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$621, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0x06)
	.dwattr $C$DW$621, DW_AT_decl_column(0x18)

$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$622, DW_AT_name("Kd")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("Kd")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$622, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0x07)
	.dwattr $C$DW$622, DW_AT_decl_column(0x18)

$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$623, DW_AT_name("Kc")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("Kc")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$623, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0x08)
	.dwattr $C$DW$623, DW_AT_decl_column(0x18)

$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$624, DW_AT_name("Gp")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("Gp")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$624, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0x09)
	.dwattr $C$DW$624, DW_AT_decl_column(0x18)

$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$625, DW_AT_name("Gi")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("Gi")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$625, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$625, DW_AT_decl_line(0x0a)
	.dwattr $C$DW$625, DW_AT_decl_column(0x18)

$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$626, DW_AT_name("yn")
	.dwattr $C$DW$626, DW_AT_TI_symbol_name("yn")
	.dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$626, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$626, DW_AT_decl_line(0x0b)
	.dwattr $C$DW$626, DW_AT_decl_column(0x18)

$C$DW$627	.dwtag  DW_TAG_member
	.dwattr $C$DW$627, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$627, DW_AT_name("yp")
	.dwattr $C$DW$627, DW_AT_TI_symbol_name("yp")
	.dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$627, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$627, DW_AT_decl_line(0x0c)
	.dwattr $C$DW$627, DW_AT_decl_column(0x18)

$C$DW$628	.dwtag  DW_TAG_member
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$628, DW_AT_name("ep")
	.dwattr $C$DW$628, DW_AT_TI_symbol_name("ep")
	.dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$628, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$628, DW_AT_decl_line(0x0d)
	.dwattr $C$DW$628, DW_AT_decl_column(0x18)

$C$DW$629	.dwtag  DW_TAG_member
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$629, DW_AT_name("es")
	.dwattr $C$DW$629, DW_AT_TI_symbol_name("es")
	.dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$629, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$629, DW_AT_decl_line(0x0e)
	.dwattr $C$DW$629, DW_AT_decl_column(0x18)

$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$630, DW_AT_name("ei")
	.dwattr $C$DW$630, DW_AT_TI_symbol_name("ei")
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$630, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$630, DW_AT_decl_line(0x0f)
	.dwattr $C$DW$630, DW_AT_decl_column(0x18)

$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$631, DW_AT_name("ed")
	.dwattr $C$DW$631, DW_AT_TI_symbol_name("ed")
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$631, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$631, DW_AT_decl_line(0x10)
	.dwattr $C$DW$631, DW_AT_decl_column(0x18)

$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$632, DW_AT_name("y")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$632, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$632, DW_AT_decl_line(0x11)
	.dwattr $C$DW$632, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$174, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$T$174, DW_AT_decl_line(0x03)
	.dwattr $C$DW$T$174, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$174

$C$DW$T$748	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$748, DW_AT_name("PID_t")
	.dwattr $C$DW$T$748, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$T$748, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$748, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$T$748, DW_AT_decl_line(0x11)
	.dwattr $C$DW$T$748, DW_AT_decl_column(0x1d)

$C$DW$T$749	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$749, DW_AT_type(*$C$DW$T$748)
	.dwattr $C$DW$T$749, DW_AT_address_class(0x20)


$C$DW$T$180	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$180, DW_AT_byte_size(0xdc)
$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$633, DW_AT_name("tmp")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("tmp")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$633, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$633, DW_AT_decl_line(0x18)
	.dwattr $C$DW$633, DW_AT_decl_column(0x1b)

$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$634, DW_AT_name("ofs")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("ofs")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$634, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$634, DW_AT_decl_line(0x19)
	.dwattr $C$DW$634, DW_AT_decl_column(0x1b)

$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$635, DW_AT_name("fsA")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("fsA")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$635, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$635, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$635, DW_AT_decl_column(0x1b)

$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$636, DW_AT_name("fsG")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("fsG")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$636, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$636, DW_AT_decl_column(0x1b)

$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$637, DW_AT_name("raw")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("raw")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$637, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$637, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$637, DW_AT_decl_column(0x1b)

$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$638, DW_AT_name("val")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("val")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$638, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$638, DW_AT_decl_column(0x1b)

$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$639, DW_AT_name("phy")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("phy")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$639, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$639, DW_AT_decl_column(0x1b)

$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$640, DW_AT_name("avg")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("avg")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$640, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$640, DW_AT_decl_column(0x1b)

$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$641, DW_AT_name("tem")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("tem")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$641, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0x20)
	.dwattr $C$DW$641, DW_AT_decl_column(0x1b)

$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$642, DW_AT_name("irq")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("irq")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$642, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0x21)
	.dwattr $C$DW$642, DW_AT_decl_column(0x1b)

$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$643, DW_AT_name("cn0")
	.dwattr $C$DW$643, DW_AT_TI_symbol_name("cn0")
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$643, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0x22)
	.dwattr $C$DW$643, DW_AT_decl_column(0x1b)

$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$644, DW_AT_name("cn1")
	.dwattr $C$DW$644, DW_AT_TI_symbol_name("cn1")
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$644, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0x23)
	.dwattr $C$DW$644, DW_AT_decl_column(0x1b)

	.dwattr $C$DW$T$180, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$T$180, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$180, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$180

$C$DW$T$750	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$750, DW_AT_name("MPU_t")
	.dwattr $C$DW$T$750, DW_AT_type(*$C$DW$T$180)
	.dwattr $C$DW$T$750, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$750, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
	.dwattr $C$DW$T$750, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$750, DW_AT_decl_column(0x12)


$C$DW$T$181	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$181, DW_AT_byte_size(0x10)
$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$645, DW_AT_name("__max_align1")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$645, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$645, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$645, DW_AT_decl_column(0x0c)

$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$646, DW_AT_name("__max_align2")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$646, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$646, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$181, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$181, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$181, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$181

$C$DW$T$751	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$751, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$751, DW_AT_type(*$C$DW$T$181)
	.dwattr $C$DW$T$751, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$751, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$751, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$751, DW_AT_decl_column(0x03)


$C$DW$T$184	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$184, DW_AT_byte_size(0x08)
$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$647, DW_AT_name("length")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$647, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0x165)
	.dwattr $C$DW$647, DW_AT_decl_column(0x16)

$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$183)
	.dwattr $C$DW$648, DW_AT_name("elem")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$648, DW_AT_decl_line(0x165)
	.dwattr $C$DW$648, DW_AT_decl_column(0x3a)

	.dwattr $C$DW$T$184, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$184, DW_AT_decl_line(0x165)
	.dwattr $C$DW$T$184, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$184

$C$DW$T$752	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$752, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$752, DW_AT_type(*$C$DW$T$184)
	.dwattr $C$DW$T$752, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$752, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$752, DW_AT_decl_line(0x165)
	.dwattr $C$DW$T$752, DW_AT_decl_column(0x42)


$C$DW$T$187	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$187, DW_AT_byte_size(0x08)
$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$649, DW_AT_name("length")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$649, DW_AT_decl_line(0x166)
	.dwattr $C$DW$649, DW_AT_decl_column(0x16)

$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$186)
	.dwattr $C$DW$650, DW_AT_name("elem")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$650, DW_AT_decl_line(0x166)
	.dwattr $C$DW$650, DW_AT_decl_column(0x40)

	.dwattr $C$DW$T$187, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$187, DW_AT_decl_line(0x166)
	.dwattr $C$DW$T$187, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$187

$C$DW$T$753	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$753, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$753, DW_AT_type(*$C$DW$T$187)
	.dwattr $C$DW$T$753, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$753, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$753, DW_AT_decl_line(0x166)
	.dwattr $C$DW$T$753, DW_AT_decl_column(0x48)

$C$DW$T$754	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$754, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$754, DW_AT_type(*$C$DW$T$753)
	.dwattr $C$DW$T$754, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$754, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$754, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$754, DW_AT_decl_column(0x2a)

$C$DW$T$755	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$755, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$755, DW_AT_type(*$C$DW$T$753)
	.dwattr $C$DW$T$755, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$755, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$755, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$755, DW_AT_decl_column(0x2a)


$C$DW$T$190	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$190, DW_AT_byte_size(0x08)
$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$651, DW_AT_name("length")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$651, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$651, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$651, DW_AT_decl_column(0x16)

$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$189)
	.dwattr $C$DW$652, DW_AT_name("elem")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$652, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$652, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$652, DW_AT_decl_column(0x3b)

	.dwattr $C$DW$T$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$190, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$190, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$190

$C$DW$T$756	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$756, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$756, DW_AT_type(*$C$DW$T$190)
	.dwattr $C$DW$T$756, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$756, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$756, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$756, DW_AT_decl_column(0x43)


$C$DW$T$193	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$193, DW_AT_byte_size(0x08)
$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$653, DW_AT_name("length")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$653, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$653, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$653, DW_AT_decl_column(0x16)

$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$192)
	.dwattr $C$DW$654, DW_AT_name("elem")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$654, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$654, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$654, DW_AT_decl_column(0x41)

	.dwattr $C$DW$T$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$193, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$T$193, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$193

$C$DW$T$757	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$757, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$757, DW_AT_type(*$C$DW$T$193)
	.dwattr $C$DW$T$757, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$757, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$757, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$T$757, DW_AT_decl_column(0x49)

$C$DW$T$758	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$758, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$758, DW_AT_type(*$C$DW$T$757)
	.dwattr $C$DW$T$758, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$758, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$758, DW_AT_decl_line(0x29e)
	.dwattr $C$DW$T$758, DW_AT_decl_column(0x2b)

$C$DW$T$759	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$759, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$759, DW_AT_type(*$C$DW$T$757)
	.dwattr $C$DW$T$759, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$759, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$759, DW_AT_decl_line(0x29d)
	.dwattr $C$DW$T$759, DW_AT_decl_column(0x2b)


$C$DW$T$236	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$236, DW_AT_byte_size(0x4c)
$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$199)
	.dwattr $C$DW$655, DW_AT_name("Crc32")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("Crc32")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$655, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$655, DW_AT_decl_line(0x76)
	.dwattr $C$DW$655, DW_AT_decl_column(0x25)

$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$202)
	.dwattr $C$DW$656, DW_AT_name("FlashGetSize")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("FlashGetSize")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$656, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$656, DW_AT_decl_line(0x77)
	.dwattr $C$DW$656, DW_AT_decl_column(0x25)

$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$203)
	.dwattr $C$DW$657, DW_AT_name("GetChipId")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("GetChipId")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$657, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$657, DW_AT_decl_line(0x78)
	.dwattr $C$DW$657, DW_AT_decl_column(0x25)

$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$658, DW_AT_name("ReservedLocation1")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("ReservedLocation1")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$658, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$658, DW_AT_decl_line(0x79)
	.dwattr $C$DW$658, DW_AT_decl_column(0x25)

$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$207)
	.dwattr $C$DW$659, DW_AT_name("ReservedLocation2")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("ReservedLocation2")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$659, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$659, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$659, DW_AT_decl_column(0x25)

$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$208)
	.dwattr $C$DW$660, DW_AT_name("ReservedLocation3")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("ReservedLocation3")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$660, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$660, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$660, DW_AT_decl_column(0x25)

$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$211)
	.dwattr $C$DW$661, DW_AT_name("ResetDevice")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("ResetDevice")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$661, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$661, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$661, DW_AT_decl_column(0x25)

$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$217)
	.dwattr $C$DW$662, DW_AT_name("Fletcher32")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("Fletcher32")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$662, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$662, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$662, DW_AT_decl_column(0x25)

$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$221)
	.dwattr $C$DW$663, DW_AT_name("MinValue")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("MinValue")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$663, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$663, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$663, DW_AT_decl_column(0x25)

$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$222)
	.dwattr $C$DW$664, DW_AT_name("MaxValue")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("MaxValue")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$664, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$664, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$664, DW_AT_decl_column(0x25)

$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$223)
	.dwattr $C$DW$665, DW_AT_name("MeanValue")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("MeanValue")
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$665, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$665, DW_AT_decl_line(0x80)
	.dwattr $C$DW$665, DW_AT_decl_column(0x25)

$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$224)
	.dwattr $C$DW$666, DW_AT_name("StandDeviationValue")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("StandDeviationValue")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$666, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$666, DW_AT_decl_line(0x81)
	.dwattr $C$DW$666, DW_AT_decl_column(0x25)

$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$227)
	.dwattr $C$DW$667, DW_AT_name("ReservedLocation4")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("ReservedLocation4")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$667, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$667, DW_AT_decl_line(0x82)
	.dwattr $C$DW$667, DW_AT_decl_column(0x25)

$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$228)
	.dwattr $C$DW$668, DW_AT_name("ReservedLocation5")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("ReservedLocation5")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$668, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$668, DW_AT_decl_line(0x83)
	.dwattr $C$DW$668, DW_AT_decl_column(0x25)

$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$229)
	.dwattr $C$DW$669, DW_AT_name("HFSourceSafeSwitch")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$669, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$669, DW_AT_decl_line(0x84)
	.dwattr $C$DW$669, DW_AT_decl_column(0x25)

$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$232)
	.dwattr $C$DW$670, DW_AT_name("SelectCompAInput")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("SelectCompAInput")
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$670, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$670, DW_AT_decl_line(0x85)
	.dwattr $C$DW$670, DW_AT_decl_column(0x25)

$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$233)
	.dwattr $C$DW$671, DW_AT_name("SelectCompARef")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("SelectCompARef")
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$671, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$671, DW_AT_decl_line(0x86)
	.dwattr $C$DW$671, DW_AT_decl_column(0x25)

$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$234)
	.dwattr $C$DW$672, DW_AT_name("SelectADCCompBInput")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("SelectADCCompBInput")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$672, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$672, DW_AT_decl_line(0x87)
	.dwattr $C$DW$672, DW_AT_decl_column(0x25)

$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$235)
	.dwattr $C$DW$673, DW_AT_name("SelectCompBRef")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("SelectCompBRef")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$673, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$673, DW_AT_decl_line(0x88)
	.dwattr $C$DW$673, DW_AT_decl_column(0x25)

	.dwattr $C$DW$T$236, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$236, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$236, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$236

$C$DW$T$760	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$760, DW_AT_name("HARD_API_T")
	.dwattr $C$DW$T$760, DW_AT_type(*$C$DW$T$236)
	.dwattr $C$DW$T$760, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$760, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$760, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$760, DW_AT_decl_column(0x03)


$C$DW$T$237	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$237, DW_AT_byte_size(0x08)
$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$674, DW_AT_name("custom")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("custom")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$674, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$674, DW_AT_decl_line(0x103)
	.dwattr $C$DW$674, DW_AT_decl_column(0x0e)

$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$675, DW_AT_name("isProtected")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("isProtected")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$675, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$675, DW_AT_decl_line(0x105)
	.dwattr $C$DW$675, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$237, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$237, DW_AT_decl_line(0x102)
	.dwattr $C$DW$T$237, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$237

$C$DW$T$253	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$253, DW_AT_name("ADC_Params")
	.dwattr $C$DW$T$253, DW_AT_type(*$C$DW$T$237)
	.dwattr $C$DW$T$253, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$253, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$253, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$T$253, DW_AT_decl_column(0x03)

$C$DW$T$254	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$254, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$T$254, DW_AT_address_class(0x20)


$C$DW$T$258	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$258, DW_AT_byte_size(0x18)
$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$242)
	.dwattr $C$DW$676, DW_AT_name("closeFxn")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("closeFxn")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$676, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$676, DW_AT_decl_line(0x141)
	.dwattr $C$DW$676, DW_AT_decl_column(0x17)

$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$245)
	.dwattr $C$DW$677, DW_AT_name("controlFxn")
	.dwattr $C$DW$677, DW_AT_TI_symbol_name("controlFxn")
	.dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$677, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$677, DW_AT_decl_line(0x144)
	.dwattr $C$DW$677, DW_AT_decl_column(0x17)

$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$248)
	.dwattr $C$DW$678, DW_AT_name("convertFxn")
	.dwattr $C$DW$678, DW_AT_TI_symbol_name("convertFxn")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$678, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$678, DW_AT_decl_line(0x147)
	.dwattr $C$DW$678, DW_AT_decl_column(0x17)

$C$DW$679	.dwtag  DW_TAG_member
	.dwattr $C$DW$679, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$679, DW_AT_name("convertToMicroVolts")
	.dwattr $C$DW$679, DW_AT_TI_symbol_name("convertToMicroVolts")
	.dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$679, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$679, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$679, DW_AT_decl_column(0x20)

$C$DW$680	.dwtag  DW_TAG_member
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$680, DW_AT_name("initFxn")
	.dwattr $C$DW$680, DW_AT_TI_symbol_name("initFxn")
	.dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$680, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$680, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$680, DW_AT_decl_column(0x17)

$C$DW$681	.dwtag  DW_TAG_member
	.dwattr $C$DW$681, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$681, DW_AT_name("openFxn")
	.dwattr $C$DW$681, DW_AT_TI_symbol_name("openFxn")
	.dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$681, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$681, DW_AT_decl_line(0x150)
	.dwattr $C$DW$681, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$258, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$258, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$T$258, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$258

$C$DW$T$266	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$266, DW_AT_name("ADC_FxnTable")
	.dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$258)
	.dwattr $C$DW$T$266, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$266, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$266, DW_AT_decl_line(0x151)
	.dwattr $C$DW$T$266, DW_AT_decl_column(0x03)

$C$DW$T$267	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$267, DW_AT_type(*$C$DW$T$266)

$C$DW$T$268	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$267)
	.dwattr $C$DW$T$268, DW_AT_address_class(0x20)


$C$DW$T$260	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$260, DW_AT_byte_size(0x14)
$C$DW$682	.dwtag  DW_TAG_member
	.dwattr $C$DW$682, DW_AT_type(*$C$DW$T$259)
	.dwattr $C$DW$682, DW_AT_name("t0")
	.dwattr $C$DW$682, DW_AT_TI_symbol_name("t0")
	.dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$682, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$682, DW_AT_decl_line(0x07)
	.dwattr $C$DW$682, DW_AT_decl_column(0x16)

$C$DW$683	.dwtag  DW_TAG_member
	.dwattr $C$DW$683, DW_AT_type(*$C$DW$T$259)
	.dwattr $C$DW$683, DW_AT_name("t1")
	.dwattr $C$DW$683, DW_AT_TI_symbol_name("t1")
	.dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$683, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$683, DW_AT_decl_line(0x08)
	.dwattr $C$DW$683, DW_AT_decl_column(0x16)

$C$DW$684	.dwtag  DW_TAG_member
	.dwattr $C$DW$684, DW_AT_type(*$C$DW$T$259)
	.dwattr $C$DW$684, DW_AT_name("dt")
	.dwattr $C$DW$684, DW_AT_TI_symbol_name("dt")
	.dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$684, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$684, DW_AT_decl_line(0x09)
	.dwattr $C$DW$684, DW_AT_decl_column(0x16)

$C$DW$685	.dwtag  DW_TAG_member
	.dwattr $C$DW$685, DW_AT_type(*$C$DW$T$259)
	.dwattr $C$DW$685, DW_AT_name("mx")
	.dwattr $C$DW$685, DW_AT_TI_symbol_name("mx")
	.dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$685, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$685, DW_AT_decl_line(0x0a)
	.dwattr $C$DW$685, DW_AT_decl_column(0x16)

$C$DW$686	.dwtag  DW_TAG_member
	.dwattr $C$DW$686, DW_AT_type(*$C$DW$T$259)
	.dwattr $C$DW$686, DW_AT_name("mn")
	.dwattr $C$DW$686, DW_AT_TI_symbol_name("mn")
	.dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$686, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$686, DW_AT_decl_line(0x0b)
	.dwattr $C$DW$686, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$260, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$T$260, DW_AT_decl_line(0x07)
	.dwattr $C$DW$T$260, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$260

$C$DW$T$761	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$761, DW_AT_name("KRO_t")
	.dwattr $C$DW$T$761, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$T$761, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$761, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$T$761, DW_AT_decl_line(0x0c)
	.dwattr $C$DW$T$761, DW_AT_decl_column(0x12)


$C$DW$T$265	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$265, DW_AT_byte_size(0x04)
$C$DW$687	.dwtag  DW_TAG_member
	.dwattr $C$DW$687, DW_AT_type(*$C$DW$T$261)
	.dwattr $C$DW$687, DW_AT_name("f")
	.dwattr $C$DW$687, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$687, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/xdctools_3_51_03_28_core/packages/xdc/std.h")
	.dwattr $C$DW$687, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$687, DW_AT_decl_column(0x0f)

$C$DW$688	.dwtag  DW_TAG_member
	.dwattr $C$DW$688, DW_AT_type(*$C$DW$T$264)
	.dwattr $C$DW$688, DW_AT_name("a")
	.dwattr $C$DW$688, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$688, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/xdctools_3_51_03_28_core/packages/xdc/std.h")
	.dwattr $C$DW$688, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$688, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$265, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/xdctools_3_51_03_28_core/packages/xdc/std.h")
	.dwattr $C$DW$T$265, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$265, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$265

$C$DW$T$762	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$762, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$762, DW_AT_type(*$C$DW$T$265)
	.dwattr $C$DW$T$762, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$762, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/xdctools_3_51_03_28_core/packages/xdc/std.h")
	.dwattr $C$DW$T$762, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$762, DW_AT_decl_column(0x03)


$C$DW$T$271	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$271, DW_AT_name("ADC_Config")
	.dwattr $C$DW$T$271, DW_AT_byte_size(0x0c)
$C$DW$689	.dwtag  DW_TAG_member
	.dwattr $C$DW$689, DW_AT_type(*$C$DW$T$268)
	.dwattr $C$DW$689, DW_AT_name("fxnTablePtr")
	.dwattr $C$DW$689, DW_AT_TI_symbol_name("fxnTablePtr")
	.dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$689, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$689, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$689, DW_AT_decl_column(0x19)

$C$DW$690	.dwtag  DW_TAG_member
	.dwattr $C$DW$690, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$690, DW_AT_name("object")
	.dwattr $C$DW$690, DW_AT_TI_symbol_name("object")
	.dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$690, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$690, DW_AT_decl_line(0x160)
	.dwattr $C$DW$690, DW_AT_decl_column(0x19)

$C$DW$691	.dwtag  DW_TAG_member
	.dwattr $C$DW$691, DW_AT_type(*$C$DW$T$270)
	.dwattr $C$DW$691, DW_AT_name("hwAttrs")
	.dwattr $C$DW$691, DW_AT_TI_symbol_name("hwAttrs")
	.dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$691, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$691, DW_AT_decl_line(0x164)
	.dwattr $C$DW$691, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$271, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$271, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$T$271, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$271

$C$DW$T$763	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$763, DW_AT_name("ADC_Config")
	.dwattr $C$DW$T$763, DW_AT_type(*$C$DW$T$271)
	.dwattr $C$DW$T$763, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$763, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$763, DW_AT_decl_line(0x165)
	.dwattr $C$DW$T$763, DW_AT_decl_column(0x03)

$C$DW$T$238	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$271)
	.dwattr $C$DW$T$238, DW_AT_address_class(0x20)

$C$DW$T$239	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$239, DW_AT_name("ADC_Handle")
	.dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$238)
	.dwattr $C$DW$T$239, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$239, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$239, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$239, DW_AT_decl_column(0x20)


$C$DW$T$255	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$239)
	.dwattr $C$DW$T$255, DW_AT_language(DW_LANG_C)
$C$DW$692	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$692, DW_AT_type(*$C$DW$T$239)

$C$DW$693	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$693, DW_AT_type(*$C$DW$T$254)

	.dwendtag $C$DW$T$255

$C$DW$T$256	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$T$256, DW_AT_address_class(0x20)

$C$DW$T$257	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$257, DW_AT_name("ADC_OpenFxn")
	.dwattr $C$DW$T$257, DW_AT_type(*$C$DW$T$256)
	.dwattr $C$DW$T$257, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$257, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/ADC.h")
	.dwattr $C$DW$T$257, DW_AT_decl_line(0x138)
	.dwattr $C$DW$T$257, DW_AT_decl_column(0x16)


$C$DW$T$764	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$764, DW_AT_name("CC2640R2_LAUNCHXL_ADCBuf0ChannelName")
	.dwattr $C$DW$T$764, DW_AT_byte_size(0x01)
$C$DW$694	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$694, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL0")
	.dwattr $C$DW$694, DW_AT_const_value(0x00)
	.dwattr $C$DW$694, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$694, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$694, DW_AT_decl_column(0x05)

$C$DW$695	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$695, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL1")
	.dwattr $C$DW$695, DW_AT_const_value(0x01)
	.dwattr $C$DW$695, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$695, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$695, DW_AT_decl_column(0x05)

$C$DW$696	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$696, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL2")
	.dwattr $C$DW$696, DW_AT_const_value(0x02)
	.dwattr $C$DW$696, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$696, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$696, DW_AT_decl_column(0x05)

$C$DW$697	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$697, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL3")
	.dwattr $C$DW$697, DW_AT_const_value(0x03)
	.dwattr $C$DW$697, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$697, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$697, DW_AT_decl_column(0x05)

$C$DW$698	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$698, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL4")
	.dwattr $C$DW$698, DW_AT_const_value(0x04)
	.dwattr $C$DW$698, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$698, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$698, DW_AT_decl_column(0x05)

$C$DW$699	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$699, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL5")
	.dwattr $C$DW$699, DW_AT_const_value(0x05)
	.dwattr $C$DW$699, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$699, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$699, DW_AT_decl_column(0x05)

$C$DW$700	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$700, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL6")
	.dwattr $C$DW$700, DW_AT_const_value(0x06)
	.dwattr $C$DW$700, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$700, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$700, DW_AT_decl_column(0x05)

$C$DW$701	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$701, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL7")
	.dwattr $C$DW$701, DW_AT_const_value(0x07)
	.dwattr $C$DW$701, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$701, DW_AT_decl_line(0xca)
	.dwattr $C$DW$701, DW_AT_decl_column(0x05)

$C$DW$702	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$702, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNELVDDS")
	.dwattr $C$DW$702, DW_AT_const_value(0x08)
	.dwattr $C$DW$702, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$702, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$702, DW_AT_decl_column(0x05)

$C$DW$703	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$703, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNELDCOUPL")
	.dwattr $C$DW$703, DW_AT_const_value(0x09)
	.dwattr $C$DW$703, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$703, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$703, DW_AT_decl_column(0x05)

$C$DW$704	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$704, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNELVSS")
	.dwattr $C$DW$704, DW_AT_const_value(0x0a)
	.dwattr $C$DW$704, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$704, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$704, DW_AT_decl_column(0x05)

$C$DW$705	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$705, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNELCOUNT")
	.dwattr $C$DW$705, DW_AT_const_value(0x0b)
	.dwattr $C$DW$705, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$705, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$705, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$764, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$764, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$T$764, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$764

$C$DW$T$765	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$765, DW_AT_name("CC2640R2_LAUNCHXL_ADCBuf0ChannelName")
	.dwattr $C$DW$T$765, DW_AT_type(*$C$DW$T$764)
	.dwattr $C$DW$T$765, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$765, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$765, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$T$765, DW_AT_decl_column(0x03)


$C$DW$T$766	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$766, DW_AT_name("CC2640R2_LAUNCHXL_ADCBufName")
	.dwattr $C$DW$T$766, DW_AT_byte_size(0x01)
$C$DW$706	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$706, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0")
	.dwattr $C$DW$706, DW_AT_const_value(0x00)
	.dwattr $C$DW$706, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$706, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$706, DW_AT_decl_column(0x05)

$C$DW$707	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$707, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUFCOUNT")
	.dwattr $C$DW$707, DW_AT_const_value(0x01)
	.dwattr $C$DW$707, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$707, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$707, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$766, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$766, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$766, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$766

$C$DW$T$767	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$767, DW_AT_name("CC2640R2_LAUNCHXL_ADCBufName")
	.dwattr $C$DW$T$767, DW_AT_type(*$C$DW$T$766)
	.dwattr $C$DW$T$767, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$767, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$767, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$T$767, DW_AT_decl_column(0x03)


$C$DW$T$768	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$768, DW_AT_name("CC2640R2_LAUNCHXL_ADCName")
	.dwattr $C$DW$T$768, DW_AT_byte_size(0x01)
$C$DW$708	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$708, DW_AT_name("CC2640R2_LAUNCHXL_ADC0")
	.dwattr $C$DW$708, DW_AT_const_value(0x00)
	.dwattr $C$DW$708, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$708, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$708, DW_AT_decl_column(0x05)

$C$DW$709	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$709, DW_AT_name("CC2640R2_LAUNCHXL_ADC1")
	.dwattr $C$DW$709, DW_AT_const_value(0x01)
	.dwattr $C$DW$709, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$709, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$709, DW_AT_decl_column(0x05)

$C$DW$710	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$710, DW_AT_name("CC2640R2_LAUNCHXL_ADC2")
	.dwattr $C$DW$710, DW_AT_const_value(0x02)
	.dwattr $C$DW$710, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$710, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$710, DW_AT_decl_column(0x05)

$C$DW$711	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$711, DW_AT_name("CC2640R2_LAUNCHXL_ADC3")
	.dwattr $C$DW$711, DW_AT_const_value(0x03)
	.dwattr $C$DW$711, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$711, DW_AT_decl_line(0xda)
	.dwattr $C$DW$711, DW_AT_decl_column(0x05)

$C$DW$712	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$712, DW_AT_name("CC2640R2_LAUNCHXL_ADC4")
	.dwattr $C$DW$712, DW_AT_const_value(0x04)
	.dwattr $C$DW$712, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$712, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$712, DW_AT_decl_column(0x05)

$C$DW$713	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$713, DW_AT_name("CC2640R2_LAUNCHXL_ADC5")
	.dwattr $C$DW$713, DW_AT_const_value(0x05)
	.dwattr $C$DW$713, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$713, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$713, DW_AT_decl_column(0x05)

$C$DW$714	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$714, DW_AT_name("CC2640R2_LAUNCHXL_ADC6")
	.dwattr $C$DW$714, DW_AT_const_value(0x06)
	.dwattr $C$DW$714, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$714, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$714, DW_AT_decl_column(0x05)

$C$DW$715	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$715, DW_AT_name("CC2640R2_LAUNCHXL_ADC7")
	.dwattr $C$DW$715, DW_AT_const_value(0x07)
	.dwattr $C$DW$715, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$715, DW_AT_decl_line(0xde)
	.dwattr $C$DW$715, DW_AT_decl_column(0x05)

$C$DW$716	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$716, DW_AT_name("CC2640R2_LAUNCHXL_ADCDCOUPL")
	.dwattr $C$DW$716, DW_AT_const_value(0x08)
	.dwattr $C$DW$716, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$716, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$716, DW_AT_decl_column(0x05)

$C$DW$717	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$717, DW_AT_name("CC2640R2_LAUNCHXL_ADCVSS")
	.dwattr $C$DW$717, DW_AT_const_value(0x09)
	.dwattr $C$DW$717, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$717, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$717, DW_AT_decl_column(0x05)

$C$DW$718	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$718, DW_AT_name("CC2640R2_LAUNCHXL_ADCVDDS")
	.dwattr $C$DW$718, DW_AT_const_value(0x0a)
	.dwattr $C$DW$718, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$718, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$718, DW_AT_decl_column(0x05)

$C$DW$719	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$719, DW_AT_name("CC2640R2_LAUNCHXL_ADCCOUNT")
	.dwattr $C$DW$719, DW_AT_const_value(0x0b)
	.dwattr $C$DW$719, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$719, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$719, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$768, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$768, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$T$768, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$768

$C$DW$T$769	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$769, DW_AT_name("CC2640R2_LAUNCHXL_ADCName")
	.dwattr $C$DW$T$769, DW_AT_type(*$C$DW$T$768)
	.dwattr $C$DW$T$769, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$769, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$769, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$769, DW_AT_decl_column(0x03)


$C$DW$T$770	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$770, DW_AT_name("CC2640R2_LAUNCHXL_AESCBCName")
	.dwattr $C$DW$T$770, DW_AT_byte_size(0x01)
$C$DW$720	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$720, DW_AT_name("CC2640R2_LAUNCHXL_AESCBC0")
	.dwattr $C$DW$720, DW_AT_const_value(0x00)
	.dwattr $C$DW$720, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$720, DW_AT_decl_line(0x109)
	.dwattr $C$DW$720, DW_AT_decl_column(0x05)

$C$DW$721	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$721, DW_AT_name("CC2640R2_LAUNCHXL_AESCBCCOUNT")
	.dwattr $C$DW$721, DW_AT_const_value(0x01)
	.dwattr $C$DW$721, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$721, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$721, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$770, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$770, DW_AT_decl_line(0x108)
	.dwattr $C$DW$T$770, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$770

$C$DW$T$771	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$771, DW_AT_name("CC2640R2_LAUNCHXL_AESCBCName")
	.dwattr $C$DW$T$771, DW_AT_type(*$C$DW$T$770)
	.dwattr $C$DW$T$771, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$771, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$771, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$T$771, DW_AT_decl_column(0x03)


$C$DW$T$772	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$772, DW_AT_name("CC2640R2_LAUNCHXL_AESCCMName")
	.dwattr $C$DW$T$772, DW_AT_byte_size(0x01)
$C$DW$722	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$722, DW_AT_name("CC2640R2_LAUNCHXL_AESCCM0")
	.dwattr $C$DW$722, DW_AT_const_value(0x00)
	.dwattr $C$DW$722, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$722, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$722, DW_AT_decl_column(0x05)

$C$DW$723	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$723, DW_AT_name("CC2640R2_LAUNCHXL_AESCCMCOUNT")
	.dwattr $C$DW$723, DW_AT_const_value(0x01)
	.dwattr $C$DW$723, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$723, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$723, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$772, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$772, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$772, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$772

$C$DW$T$773	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$773, DW_AT_name("CC2640R2_LAUNCHXL_AESCCMName")
	.dwattr $C$DW$T$773, DW_AT_type(*$C$DW$T$772)
	.dwattr $C$DW$T$773, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$773, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$773, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$773, DW_AT_decl_column(0x03)


$C$DW$T$774	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$774, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRDRBGName")
	.dwattr $C$DW$T$774, DW_AT_byte_size(0x01)
$C$DW$724	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$724, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRDRBG0")
	.dwattr $C$DW$724, DW_AT_const_value(0x00)
	.dwattr $C$DW$724, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$724, DW_AT_decl_line(0x127)
	.dwattr $C$DW$724, DW_AT_decl_column(0x05)

$C$DW$725	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$725, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRDRBGCOUNT")
	.dwattr $C$DW$725, DW_AT_const_value(0x01)
	.dwattr $C$DW$725, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$725, DW_AT_decl_line(0x129)
	.dwattr $C$DW$725, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$774, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$774, DW_AT_decl_line(0x126)
	.dwattr $C$DW$T$774, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$774

$C$DW$T$775	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$775, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRDRBGName")
	.dwattr $C$DW$T$775, DW_AT_type(*$C$DW$T$774)
	.dwattr $C$DW$T$775, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$775, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$775, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$T$775, DW_AT_decl_column(0x03)


$C$DW$T$776	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$776, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRName")
	.dwattr $C$DW$T$776, DW_AT_byte_size(0x01)
$C$DW$726	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$726, DW_AT_name("CC2640R2_LAUNCHXL_AESCTR0")
	.dwattr $C$DW$726, DW_AT_const_value(0x00)
	.dwattr $C$DW$726, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$726, DW_AT_decl_line(0x113)
	.dwattr $C$DW$726, DW_AT_decl_column(0x05)

$C$DW$727	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$727, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRCOUNT")
	.dwattr $C$DW$727, DW_AT_const_value(0x01)
	.dwattr $C$DW$727, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$727, DW_AT_decl_line(0x115)
	.dwattr $C$DW$727, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$776, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$776, DW_AT_decl_line(0x112)
	.dwattr $C$DW$T$776, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$776

$C$DW$T$777	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$777, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRName")
	.dwattr $C$DW$T$777, DW_AT_type(*$C$DW$T$776)
	.dwattr $C$DW$T$777, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$777, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$777, DW_AT_decl_line(0x116)
	.dwattr $C$DW$T$777, DW_AT_decl_column(0x03)


$C$DW$T$778	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$778, DW_AT_name("CC2640R2_LAUNCHXL_AESECBName")
	.dwattr $C$DW$T$778, DW_AT_byte_size(0x01)
$C$DW$728	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$728, DW_AT_name("CC2640R2_LAUNCHXL_AESECB0")
	.dwattr $C$DW$728, DW_AT_const_value(0x00)
	.dwattr $C$DW$728, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$728, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$728, DW_AT_decl_column(0x05)

$C$DW$729	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$729, DW_AT_name("CC2640R2_LAUNCHXL_AESECBCOUNT")
	.dwattr $C$DW$729, DW_AT_const_value(0x01)
	.dwattr $C$DW$729, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$729, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$729, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$778, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$778, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$T$778, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$778

$C$DW$T$779	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$779, DW_AT_name("CC2640R2_LAUNCHXL_AESECBName")
	.dwattr $C$DW$T$779, DW_AT_type(*$C$DW$T$778)
	.dwattr $C$DW$T$779, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$779, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$779, DW_AT_decl_line(0x120)
	.dwattr $C$DW$T$779, DW_AT_decl_column(0x03)


$C$DW$T$780	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$780, DW_AT_name("CC2640R2_LAUNCHXL_AESGCMName")
	.dwattr $C$DW$T$780, DW_AT_byte_size(0x01)
$C$DW$730	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$730, DW_AT_name("CC2640R2_LAUNCHXL_AESGCM0")
	.dwattr $C$DW$730, DW_AT_const_value(0x00)
	.dwattr $C$DW$730, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$730, DW_AT_decl_line(0xff)
	.dwattr $C$DW$730, DW_AT_decl_column(0x05)

$C$DW$731	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$731, DW_AT_name("CC2640R2_LAUNCHXL_AESGCMCOUNT")
	.dwattr $C$DW$731, DW_AT_const_value(0x01)
	.dwattr $C$DW$731, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$731, DW_AT_decl_line(0x101)
	.dwattr $C$DW$731, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$780, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$780, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$T$780, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$780

$C$DW$T$781	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$781, DW_AT_name("CC2640R2_LAUNCHXL_AESGCMName")
	.dwattr $C$DW$T$781, DW_AT_type(*$C$DW$T$780)
	.dwattr $C$DW$T$781, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$781, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$781, DW_AT_decl_line(0x102)
	.dwattr $C$DW$T$781, DW_AT_decl_column(0x03)


$C$DW$T$782	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$782, DW_AT_name("CC2640R2_LAUNCHXL_CryptoName")
	.dwattr $C$DW$T$782, DW_AT_byte_size(0x01)
$C$DW$732	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$732, DW_AT_name("CC2640R2_LAUNCHXL_CRYPTO0")
	.dwattr $C$DW$732, DW_AT_const_value(0x00)
	.dwattr $C$DW$732, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$732, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$732, DW_AT_decl_column(0x05)

$C$DW$733	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$733, DW_AT_name("CC2640R2_LAUNCHXL_CRYPTOCOUNT")
	.dwattr $C$DW$733, DW_AT_const_value(0x01)
	.dwattr $C$DW$733, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$733, DW_AT_decl_line(0xed)
	.dwattr $C$DW$733, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$782, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$782, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$782, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$782

$C$DW$T$783	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$783, DW_AT_name("CC2640R2_LAUNCHXL_CryptoName")
	.dwattr $C$DW$T$783, DW_AT_type(*$C$DW$T$782)
	.dwattr $C$DW$T$783, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$783, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$783, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$783, DW_AT_decl_column(0x03)


$C$DW$T$784	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$784, DW_AT_name("CC2640R2_LAUNCHXL_GPIOName")
	.dwattr $C$DW$T$784, DW_AT_byte_size(0x01)
$C$DW$734	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$734, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_S1")
	.dwattr $C$DW$734, DW_AT_const_value(0x00)
	.dwattr $C$DW$734, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$734, DW_AT_decl_line(0x13b)
	.dwattr $C$DW$734, DW_AT_decl_column(0x05)

$C$DW$735	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$735, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_S2")
	.dwattr $C$DW$735, DW_AT_const_value(0x01)
	.dwattr $C$DW$735, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$735, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$735, DW_AT_decl_column(0x05)

$C$DW$736	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$736, DW_AT_name("CC2640R2_LAUNCHXL_SPI_MASTER_READY")
	.dwattr $C$DW$736, DW_AT_const_value(0x02)
	.dwattr $C$DW$736, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$736, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$736, DW_AT_decl_column(0x05)

$C$DW$737	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$737, DW_AT_name("CC2640R2_LAUNCHXL_SPI_SLAVE_READY")
	.dwattr $C$DW$737, DW_AT_const_value(0x03)
	.dwattr $C$DW$737, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$737, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$737, DW_AT_decl_column(0x05)

$C$DW$738	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$738, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_LED_GREEN")
	.dwattr $C$DW$738, DW_AT_const_value(0x04)
	.dwattr $C$DW$738, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$738, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$738, DW_AT_decl_column(0x05)

$C$DW$739	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$739, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_LED_RED")
	.dwattr $C$DW$739, DW_AT_const_value(0x05)
	.dwattr $C$DW$739, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$739, DW_AT_decl_line(0x140)
	.dwattr $C$DW$739, DW_AT_decl_column(0x05)

$C$DW$740	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$740, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_TMP116_EN")
	.dwattr $C$DW$740, DW_AT_const_value(0x06)
	.dwattr $C$DW$740, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$740, DW_AT_decl_line(0x141)
	.dwattr $C$DW$740, DW_AT_decl_column(0x05)

$C$DW$741	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$741, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_SPI_FLASH_CS")
	.dwattr $C$DW$741, DW_AT_const_value(0x07)
	.dwattr $C$DW$741, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$741, DW_AT_decl_line(0x142)
	.dwattr $C$DW$741, DW_AT_decl_column(0x05)

$C$DW$742	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$742, DW_AT_name("CC2640R2_LAUNCHXL_SDSPI_CS")
	.dwattr $C$DW$742, DW_AT_const_value(0x08)
	.dwattr $C$DW$742, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$742, DW_AT_decl_line(0x143)
	.dwattr $C$DW$742, DW_AT_decl_column(0x05)

$C$DW$743	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$743, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_LCD_CS")
	.dwattr $C$DW$743, DW_AT_const_value(0x09)
	.dwattr $C$DW$743, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$743, DW_AT_decl_line(0x144)
	.dwattr $C$DW$743, DW_AT_decl_column(0x05)

$C$DW$744	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$744, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_LCD_POWER")
	.dwattr $C$DW$744, DW_AT_const_value(0x0a)
	.dwattr $C$DW$744, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$744, DW_AT_decl_line(0x145)
	.dwattr $C$DW$744, DW_AT_decl_column(0x05)

$C$DW$745	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$745, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_LCD_ENABLE")
	.dwattr $C$DW$745, DW_AT_const_value(0x0b)
	.dwattr $C$DW$745, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$745, DW_AT_decl_line(0x146)
	.dwattr $C$DW$745, DW_AT_decl_column(0x05)

$C$DW$746	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$746, DW_AT_name("CC2640R2_LAUNCHXL_GPIOCOUNT")
	.dwattr $C$DW$746, DW_AT_const_value(0x0c)
	.dwattr $C$DW$746, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$746, DW_AT_decl_line(0x147)
	.dwattr $C$DW$746, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$784, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$784, DW_AT_decl_line(0x13a)
	.dwattr $C$DW$T$784, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$784

$C$DW$T$785	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$785, DW_AT_name("CC2640R2_LAUNCHXL_GPIOName")
	.dwattr $C$DW$T$785, DW_AT_type(*$C$DW$T$784)
	.dwattr $C$DW$T$785, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$785, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$785, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$785, DW_AT_decl_column(0x03)


$C$DW$T$786	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$786, DW_AT_name("CC2640R2_LAUNCHXL_GPTimerName")
	.dwattr $C$DW$T$786, DW_AT_byte_size(0x01)
$C$DW$747	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$747, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER0A")
	.dwattr $C$DW$747, DW_AT_const_value(0x00)
	.dwattr $C$DW$747, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$747, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$747, DW_AT_decl_column(0x05)

$C$DW$748	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$748, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER0B")
	.dwattr $C$DW$748, DW_AT_const_value(0x01)
	.dwattr $C$DW$748, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$748, DW_AT_decl_line(0x150)
	.dwattr $C$DW$748, DW_AT_decl_column(0x05)

$C$DW$749	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$749, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER1A")
	.dwattr $C$DW$749, DW_AT_const_value(0x02)
	.dwattr $C$DW$749, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$749, DW_AT_decl_line(0x151)
	.dwattr $C$DW$749, DW_AT_decl_column(0x05)

$C$DW$750	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$750, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER1B")
	.dwattr $C$DW$750, DW_AT_const_value(0x03)
	.dwattr $C$DW$750, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$750, DW_AT_decl_line(0x152)
	.dwattr $C$DW$750, DW_AT_decl_column(0x05)

$C$DW$751	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$751, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER2A")
	.dwattr $C$DW$751, DW_AT_const_value(0x04)
	.dwattr $C$DW$751, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$751, DW_AT_decl_line(0x153)
	.dwattr $C$DW$751, DW_AT_decl_column(0x05)

$C$DW$752	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$752, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER2B")
	.dwattr $C$DW$752, DW_AT_const_value(0x05)
	.dwattr $C$DW$752, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$752, DW_AT_decl_line(0x154)
	.dwattr $C$DW$752, DW_AT_decl_column(0x05)

$C$DW$753	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$753, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER3A")
	.dwattr $C$DW$753, DW_AT_const_value(0x06)
	.dwattr $C$DW$753, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$753, DW_AT_decl_line(0x155)
	.dwattr $C$DW$753, DW_AT_decl_column(0x05)

$C$DW$754	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$754, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER3B")
