;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
;* Date/Time created: Fri Apr  2 00:57:45 2021                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=none --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../MPU9250/inv_mpu.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
	.global	reg
	.sect	".const:reg"
	.align	1
	.elfsym	reg,SYM_SIZE(42)
reg:
	.bits		0x75,8
			; reg.who_am_i @ 0
	.bits		0x19,8
			; reg.rate_div @ 8
	.bits		0x1a,8
			; reg.lpf @ 16
	.bits		0xc,8
			; reg.prod_id @ 24
	.bits		0x6a,8
			; reg.user_ctrl @ 32
	.bits		0x23,8
			; reg.fifo_en @ 40
	.bits		0x1b,8
			; reg.gyro_cfg @ 48
	.bits		0x1c,8
			; reg.accel_cfg @ 56
	.bits		0x1d,8
			; reg.accel_cfg2 @ 64
	.bits		0x1e,8
			; reg.lp_accel_odr @ 72
	.bits		0x1f,8
			; reg.motion_thr @ 80
	.bits		0x20,8
			; reg.motion_dur @ 88

	.sect	".text:mpu_load_firmware"
	.align	4
||$C$CON179||:	.bits	st+37,32
	.align	4
||$C$CON180||:	.bits	st,32
	.align	4
||$C$CON181||:	.bits	st+38,32
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:mpu_set_dmp_state"
	.align	4
||$C$CON182||:	.bits	st+36,32
	.align	4
||$C$CON183||:	.bits	st+37,32
	.align	4
||$C$CON184||:	.bits	st+38,32
	.align	4
||$C$CON185||:	.bits	st+16,32
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:mpu_get_dmp_state"
	.align	4
||$C$CON186||:	.bits	st+36,32
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:mpu_get_compass_reg"
	.align	4
||$C$CON187||:	.bits	st+10,32
	.align	4
||$C$CON188||:	.bits	st,32
	.align	4
||$C$CON189||:	.bits	st+44,32
	.align	4
||$C$CON190||:	.bits	st+46,32
	.align	4
||$C$CON191||:	.bits	st+48,32
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:mpu_get_compass_fsr"
	.align	4
||$C$CON192||:	.bits	st+4,32
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:mpu_lp_motion_interrupt"
	.align	4
||$C$CON193||:	.bits	st+21,32
	.align	4
||$C$CON194||:	.bits	st+36,32
	.align	4
||$C$CON195||:	.bits	st+32,32
	.align	4
||$C$CON196||:	.bits	st+22,32
	.align	4
||$C$CON197||:	.bits	st+24,32
	.align	4
||$C$CON198||:	.bits	st+26,32
	.align	4
||$C$CON199||:	.bits	st+28,32
	.align	4
||$C$CON200||:	.bits	st+30,32
	.align	4
||$C$CON201||:	.bits	st+10,32
	.align	4
||$C$CON202||:	.bits	st+31,32
	.align	4
||$C$CON203||:	.bits	st,32
	.align	4
||$C$CON204||:	.bits	st+8,32
	.align	4
||$C$CON205||:	.bits	st+9,32
	.align	4
||$C$CON206||:	.bits	st+11,32
	.align	4
||$C$CON207||:	.bits	st+14,32
	.align	4
||$C$CON208||:	.bits	st+16,32
	.align	4
||$C$CON209||:	.bits	st+12,32
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	WR_MPU
	.global	RD_MPU
	.global	Delay_Ms
	.global	memset
	.global	memcmp
	.global	__aeabi_fdiv
	.global	__aeabi_i2f
	.global	__aeabi_fsub
	.global	__aeabi_fmul
	.global	__aeabi_fadd
	.global	__aeabi_ui2f
	.global	__aeabi_f2iz
	.global	__aeabi_ldivmod
	.global	__aeabi_f2d
	.global	__aeabi_cdrcmple
	.global	__aeabi_cfcmple
	.global	__aeabi_cfrcmple
	.global	__aeabi_i2d
	.global	__aeabi_cdcmple
;*****************************************************************************
;* SECTION GROUPS                                                            *
;*****************************************************************************
	.group    "__fpclassify", 1
	.gmember  ".text:__fpclassify"
	.endgroup
	.group    "__fpclassifyf", 1
	.gmember  ".text:__fpclassifyf"
	.endgroup
	.group    "__fpclassifyl", 1
	.gmember  ".text:__fpclassifyl"
	.endgroup
	.group    "__isfinite", 1
	.gmember  ".text:__isfinite"
	.endgroup
	.group    "__isfinitef", 1
	.gmember  ".text:__isfinitef"
	.endgroup
	.group    "__isfinitel", 1
	.gmember  ".text:__isfinitel"
	.endgroup
	.group    "__isinf", 1
	.gmember  ".text:__isinf"
	.endgroup
	.group    "__isinff", 1
	.gmember  ".text:__isinff"
	.endgroup
	.group    "__isinfl", 1
	.gmember  ".text:__isinfl"
	.endgroup
	.group    "__isnan", 1
	.gmember  ".text:__isnan"
	.endgroup
	.group    "__isnanf", 1
	.gmember  ".text:__isnanf"
	.endgroup
	.group    "__isnanl", 1
	.gmember  ".text:__isnanl"
	.endgroup
	.group    "__isnormal", 1
	.gmember  ".text:__isnormal"
	.endgroup
	.group    "__isnormalf", 1
	.gmember  ".text:__isnormalf"
	.endgroup
	.group    "__isnormall", 1
	.gmember  ".text:__isnormall"
	.endgroup
	.group    "__signbit", 1
	.gmember  ".text:__signbit"
	.endgroup
	.group    "__signbitf", 1
	.gmember  ".text:__signbitf"
	.endgroup
	.group    "__signbitl", 1
	.gmember  ".text:__signbitl"
	.endgroup


;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
	.battr "TI", Tag_File, 1, Tag_FP_interface(0)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0xdc)
$C$DW$819	.dwtag  DW_TAG_member
	.dwattr $C$DW$819, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$819, DW_AT_name("tmp")
	.dwattr $C$DW$819, DW_AT_TI_symbol_name("tmp")
	.dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$819, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$819, DW_AT_decl_line(0x18)
	.dwattr $C$DW$819, DW_AT_decl_column(0x1b)

$C$DW$820	.dwtag  DW_TAG_member
	.dwattr $C$DW$820, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$820, DW_AT_name("ofs")
	.dwattr $C$DW$820, DW_AT_TI_symbol_name("ofs")
	.dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$820, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$820, DW_AT_decl_line(0x19)
	.dwattr $C$DW$820, DW_AT_decl_column(0x1b)

$C$DW$821	.dwtag  DW_TAG_member
	.dwattr $C$DW$821, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$821, DW_AT_name("fsA")
	.dwattr $C$DW$821, DW_AT_TI_symbol_name("fsA")
	.dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$821, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$821, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$821, DW_AT_decl_column(0x1b)

$C$DW$822	.dwtag  DW_TAG_member
	.dwattr $C$DW$822, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$822, DW_AT_name("fsG")
	.dwattr $C$DW$822, DW_AT_TI_symbol_name("fsG")
	.dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$822, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$822, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$822, DW_AT_decl_column(0x1b)

$C$DW$823	.dwtag  DW_TAG_member
	.dwattr $C$DW$823, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$823, DW_AT_name("raw")
	.dwattr $C$DW$823, DW_AT_TI_symbol_name("raw")
	.dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$823, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$823, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$823, DW_AT_decl_column(0x1b)

$C$DW$824	.dwtag  DW_TAG_member
	.dwattr $C$DW$824, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$824, DW_AT_name("val")
	.dwattr $C$DW$824, DW_AT_TI_symbol_name("val")
	.dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$824, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$824, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$824, DW_AT_decl_column(0x1b)

$C$DW$825	.dwtag  DW_TAG_member
	.dwattr $C$DW$825, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$825, DW_AT_name("phy")
	.dwattr $C$DW$825, DW_AT_TI_symbol_name("phy")
	.dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$825, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$825, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$825, DW_AT_decl_column(0x1b)

$C$DW$826	.dwtag  DW_TAG_member
	.dwattr $C$DW$826, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$826, DW_AT_name("avg")
	.dwattr $C$DW$826, DW_AT_TI_symbol_name("avg")
	.dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$826, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$826, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$826, DW_AT_decl_column(0x1b)

$C$DW$827	.dwtag  DW_TAG_member
	.dwattr $C$DW$827, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$827, DW_AT_name("tem")
	.dwattr $C$DW$827, DW_AT_TI_symbol_name("tem")
	.dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$827, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$827, DW_AT_decl_line(0x20)
	.dwattr $C$DW$827, DW_AT_decl_column(0x1b)

$C$DW$828	.dwtag  DW_TAG_member
	.dwattr $C$DW$828, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$828, DW_AT_name("irq")
	.dwattr $C$DW$828, DW_AT_TI_symbol_name("irq")
	.dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
	.dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$828, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$828, DW_AT_decl_line(0x21)
	.dwattr $C$DW$828, DW_AT_decl_column(0x1b)

$C$DW$829	.dwtag  DW_TAG_member
	.dwattr $C$DW$829, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$829, DW_AT_name("cn0")
	.dwattr $C$DW$829, DW_AT_TI_symbol_name("cn0")
	.dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
	.dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$829, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$829, DW_AT_decl_line(0x22)
	.dwattr $C$DW$829, DW_AT_decl_column(0x1b)

$C$DW$830	.dwtag  DW_TAG_member
	.dwattr $C$DW$830, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$830, DW_AT_name("cn1")
	.dwattr $C$DW$830, DW_AT_TI_symbol_name("cn1")
	.dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$830, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$830, DW_AT_decl_line(0x23)
	.dwattr $C$DW$830, DW_AT_decl_column(0x1b)

	.dwattr $C$DW$T$28, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$28

$C$DW$T$139	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$139, DW_AT_name("MPU_t")
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$139, DW_AT_decl_file("../MPU9250/inv_mpu.h")
	.dwattr $C$DW$T$139, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$139, DW_AT_decl_column(0x12)


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
$C$DW$831	.dwtag  DW_TAG_member
	.dwattr $C$DW$831, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$831, DW_AT_name("__max_align1")
	.dwattr $C$DW$831, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$831, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$831, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$831, DW_AT_decl_column(0x0c)

$C$DW$832	.dwtag  DW_TAG_member
	.dwattr $C$DW$832, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$832, DW_AT_name("__max_align2")
	.dwattr $C$DW$832, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$832, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$832, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$832, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$29, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$29

$C$DW$T$140	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$140, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$140, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$140, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$140, DW_AT_decl_column(0x03)


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
$C$DW$833	.dwtag  DW_TAG_member
	.dwattr $C$DW$833, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$833, DW_AT_name("quot")
	.dwattr $C$DW$833, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$833, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$833, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$833, DW_AT_decl_column(0x16)

$C$DW$834	.dwtag  DW_TAG_member
	.dwattr $C$DW$834, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$834, DW_AT_name("rem")
	.dwattr $C$DW$834, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$834, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$834, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$834, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$30, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$30

$C$DW$T$141	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$141, DW_AT_name("div_t")
	.dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$141, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$T$141, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$141, DW_AT_decl_column(0x23)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
$C$DW$835	.dwtag  DW_TAG_member
	.dwattr $C$DW$835, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$835, DW_AT_name("quot")
	.dwattr $C$DW$835, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$835, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$835, DW_AT_decl_line(0x53)
	.dwattr $C$DW$835, DW_AT_decl_column(0x16)

$C$DW$836	.dwtag  DW_TAG_member
	.dwattr $C$DW$836, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$836, DW_AT_name("rem")
	.dwattr $C$DW$836, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$836, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$836, DW_AT_decl_line(0x53)
	.dwattr $C$DW$836, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$31, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$31

$C$DW$T$142	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$142, DW_AT_name("ldiv_t")
	.dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$142, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$T$142, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$142, DW_AT_decl_column(0x23)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
$C$DW$837	.dwtag  DW_TAG_member
	.dwattr $C$DW$837, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$837, DW_AT_name("quot")
	.dwattr $C$DW$837, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$837, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$837, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$837, DW_AT_decl_column(0x1c)

$C$DW$838	.dwtag  DW_TAG_member
	.dwattr $C$DW$838, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$838, DW_AT_name("rem")
	.dwattr $C$DW$838, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$838, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$838, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$838, DW_AT_decl_column(0x22)

	.dwattr $C$DW$T$32, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$32

$C$DW$T$143	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$143, DW_AT_name("lldiv_t")
	.dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$143, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$T$143, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$143, DW_AT_decl_column(0x29)


$C$DW$T$77	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$77, DW_AT_byte_size(0x4c)
$C$DW$839	.dwtag  DW_TAG_member
	.dwattr $C$DW$839, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$839, DW_AT_name("Crc32")
	.dwattr $C$DW$839, DW_AT_TI_symbol_name("Crc32")
	.dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$839, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$839, DW_AT_decl_line(0x76)
	.dwattr $C$DW$839, DW_AT_decl_column(0x25)

$C$DW$840	.dwtag  DW_TAG_member
	.dwattr $C$DW$840, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$840, DW_AT_name("FlashGetSize")
	.dwattr $C$DW$840, DW_AT_TI_symbol_name("FlashGetSize")
	.dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$840, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$840, DW_AT_decl_line(0x77)
	.dwattr $C$DW$840, DW_AT_decl_column(0x25)

$C$DW$841	.dwtag  DW_TAG_member
	.dwattr $C$DW$841, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$841, DW_AT_name("GetChipId")
	.dwattr $C$DW$841, DW_AT_TI_symbol_name("GetChipId")
	.dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$841, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$841, DW_AT_decl_line(0x78)
	.dwattr $C$DW$841, DW_AT_decl_column(0x25)

$C$DW$842	.dwtag  DW_TAG_member
	.dwattr $C$DW$842, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$842, DW_AT_name("ReservedLocation1")
	.dwattr $C$DW$842, DW_AT_TI_symbol_name("ReservedLocation1")
	.dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$842, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$842, DW_AT_decl_line(0x79)
	.dwattr $C$DW$842, DW_AT_decl_column(0x25)

$C$DW$843	.dwtag  DW_TAG_member
	.dwattr $C$DW$843, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$843, DW_AT_name("ReservedLocation2")
	.dwattr $C$DW$843, DW_AT_TI_symbol_name("ReservedLocation2")
	.dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$843, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$843, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$843, DW_AT_decl_column(0x25)

$C$DW$844	.dwtag  DW_TAG_member
	.dwattr $C$DW$844, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$844, DW_AT_name("ReservedLocation3")
	.dwattr $C$DW$844, DW_AT_TI_symbol_name("ReservedLocation3")
	.dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$844, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$844, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$844, DW_AT_decl_column(0x25)

$C$DW$845	.dwtag  DW_TAG_member
	.dwattr $C$DW$845, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$845, DW_AT_name("ResetDevice")
	.dwattr $C$DW$845, DW_AT_TI_symbol_name("ResetDevice")
	.dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$845, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$845, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$845, DW_AT_decl_column(0x25)

$C$DW$846	.dwtag  DW_TAG_member
	.dwattr $C$DW$846, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$846, DW_AT_name("Fletcher32")
	.dwattr $C$DW$846, DW_AT_TI_symbol_name("Fletcher32")
	.dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$846, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$846, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$846, DW_AT_decl_column(0x25)

$C$DW$847	.dwtag  DW_TAG_member
	.dwattr $C$DW$847, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$847, DW_AT_name("MinValue")
	.dwattr $C$DW$847, DW_AT_TI_symbol_name("MinValue")
	.dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$847, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$847, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$847, DW_AT_decl_column(0x25)

$C$DW$848	.dwtag  DW_TAG_member
	.dwattr $C$DW$848, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$848, DW_AT_name("MaxValue")
	.dwattr $C$DW$848, DW_AT_TI_symbol_name("MaxValue")
	.dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$848, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$848, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$848, DW_AT_decl_column(0x25)

$C$DW$849	.dwtag  DW_TAG_member
	.dwattr $C$DW$849, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$849, DW_AT_name("MeanValue")
	.dwattr $C$DW$849, DW_AT_TI_symbol_name("MeanValue")
	.dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$849, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$849, DW_AT_decl_line(0x80)
	.dwattr $C$DW$849, DW_AT_decl_column(0x25)

$C$DW$850	.dwtag  DW_TAG_member
	.dwattr $C$DW$850, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$850, DW_AT_name("StandDeviationValue")
	.dwattr $C$DW$850, DW_AT_TI_symbol_name("StandDeviationValue")
	.dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$850, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$850, DW_AT_decl_line(0x81)
	.dwattr $C$DW$850, DW_AT_decl_column(0x25)

$C$DW$851	.dwtag  DW_TAG_member
	.dwattr $C$DW$851, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$851, DW_AT_name("ReservedLocation4")
	.dwattr $C$DW$851, DW_AT_TI_symbol_name("ReservedLocation4")
	.dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$851, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$851, DW_AT_decl_line(0x82)
	.dwattr $C$DW$851, DW_AT_decl_column(0x25)

$C$DW$852	.dwtag  DW_TAG_member
	.dwattr $C$DW$852, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$852, DW_AT_name("ReservedLocation5")
	.dwattr $C$DW$852, DW_AT_TI_symbol_name("ReservedLocation5")
	.dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$852, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$852, DW_AT_decl_line(0x83)
	.dwattr $C$DW$852, DW_AT_decl_column(0x25)

$C$DW$853	.dwtag  DW_TAG_member
	.dwattr $C$DW$853, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$853, DW_AT_name("HFSourceSafeSwitch")
	.dwattr $C$DW$853, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
	.dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$853, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$853, DW_AT_decl_line(0x84)
	.dwattr $C$DW$853, DW_AT_decl_column(0x25)

$C$DW$854	.dwtag  DW_TAG_member
	.dwattr $C$DW$854, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$854, DW_AT_name("SelectCompAInput")
	.dwattr $C$DW$854, DW_AT_TI_symbol_name("SelectCompAInput")
	.dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$854, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$854, DW_AT_decl_line(0x85)
	.dwattr $C$DW$854, DW_AT_decl_column(0x25)

$C$DW$855	.dwtag  DW_TAG_member
	.dwattr $C$DW$855, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$855, DW_AT_name("SelectCompARef")
	.dwattr $C$DW$855, DW_AT_TI_symbol_name("SelectCompARef")
	.dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$855, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$855, DW_AT_decl_line(0x86)
	.dwattr $C$DW$855, DW_AT_decl_column(0x25)

$C$DW$856	.dwtag  DW_TAG_member
	.dwattr $C$DW$856, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$856, DW_AT_name("SelectADCCompBInput")
	.dwattr $C$DW$856, DW_AT_TI_symbol_name("SelectADCCompBInput")
	.dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$856, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$856, DW_AT_decl_line(0x87)
	.dwattr $C$DW$856, DW_AT_decl_column(0x25)

$C$DW$857	.dwtag  DW_TAG_member
	.dwattr $C$DW$857, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$857, DW_AT_name("SelectCompBRef")
	.dwattr $C$DW$857, DW_AT_TI_symbol_name("SelectCompBRef")
	.dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$857, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$857, DW_AT_decl_line(0x88)
	.dwattr $C$DW$857, DW_AT_decl_column(0x25)

	.dwattr $C$DW$T$77, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$77

$C$DW$T$144	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$144, DW_AT_name("HARD_API_T")
	.dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$144, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$144, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$144, DW_AT_decl_column(0x03)


$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x3c)
$C$DW$858	.dwtag  DW_TAG_member
	.dwattr $C$DW$858, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$858, DW_AT_name("ref")
	.dwattr $C$DW$858, DW_AT_TI_symbol_name("ref")
	.dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$858, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$858, DW_AT_decl_line(0x03)
	.dwattr $C$DW$858, DW_AT_decl_column(0x18)

$C$DW$859	.dwtag  DW_TAG_member
	.dwattr $C$DW$859, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$859, DW_AT_name("fdb")
	.dwattr $C$DW$859, DW_AT_TI_symbol_name("fdb")
	.dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$859, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$859, DW_AT_decl_line(0x04)
	.dwattr $C$DW$859, DW_AT_decl_column(0x18)

$C$DW$860	.dwtag  DW_TAG_member
	.dwattr $C$DW$860, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$860, DW_AT_name("Kp")
	.dwattr $C$DW$860, DW_AT_TI_symbol_name("Kp")
	.dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$860, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$860, DW_AT_decl_line(0x05)
	.dwattr $C$DW$860, DW_AT_decl_column(0x18)

$C$DW$861	.dwtag  DW_TAG_member
	.dwattr $C$DW$861, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$861, DW_AT_name("Ki")
	.dwattr $C$DW$861, DW_AT_TI_symbol_name("Ki")
	.dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$861, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$861, DW_AT_decl_line(0x06)
	.dwattr $C$DW$861, DW_AT_decl_column(0x18)

$C$DW$862	.dwtag  DW_TAG_member
	.dwattr $C$DW$862, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$862, DW_AT_name("Kd")
	.dwattr $C$DW$862, DW_AT_TI_symbol_name("Kd")
	.dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$862, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$862, DW_AT_decl_line(0x07)
	.dwattr $C$DW$862, DW_AT_decl_column(0x18)

$C$DW$863	.dwtag  DW_TAG_member
	.dwattr $C$DW$863, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$863, DW_AT_name("Kc")
	.dwattr $C$DW$863, DW_AT_TI_symbol_name("Kc")
	.dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$863, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$863, DW_AT_decl_line(0x08)
	.dwattr $C$DW$863, DW_AT_decl_column(0x18)

$C$DW$864	.dwtag  DW_TAG_member
	.dwattr $C$DW$864, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$864, DW_AT_name("Gp")
	.dwattr $C$DW$864, DW_AT_TI_symbol_name("Gp")
	.dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$864, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$864, DW_AT_decl_line(0x09)
	.dwattr $C$DW$864, DW_AT_decl_column(0x18)

$C$DW$865	.dwtag  DW_TAG_member
	.dwattr $C$DW$865, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$865, DW_AT_name("Gi")
	.dwattr $C$DW$865, DW_AT_TI_symbol_name("Gi")
	.dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$865, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$865, DW_AT_decl_line(0x0a)
	.dwattr $C$DW$865, DW_AT_decl_column(0x18)

$C$DW$866	.dwtag  DW_TAG_member
	.dwattr $C$DW$866, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$866, DW_AT_name("yn")
	.dwattr $C$DW$866, DW_AT_TI_symbol_name("yn")
	.dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$866, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$866, DW_AT_decl_line(0x0b)
	.dwattr $C$DW$866, DW_AT_decl_column(0x18)

$C$DW$867	.dwtag  DW_TAG_member
	.dwattr $C$DW$867, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$867, DW_AT_name("yp")
	.dwattr $C$DW$867, DW_AT_TI_symbol_name("yp")
	.dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$867, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$867, DW_AT_decl_line(0x0c)
	.dwattr $C$DW$867, DW_AT_decl_column(0x18)

$C$DW$868	.dwtag  DW_TAG_member
	.dwattr $C$DW$868, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$868, DW_AT_name("ep")
	.dwattr $C$DW$868, DW_AT_TI_symbol_name("ep")
	.dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$868, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$868, DW_AT_decl_line(0x0d)
	.dwattr $C$DW$868, DW_AT_decl_column(0x18)

$C$DW$869	.dwtag  DW_TAG_member
	.dwattr $C$DW$869, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$869, DW_AT_name("es")
	.dwattr $C$DW$869, DW_AT_TI_symbol_name("es")
	.dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$869, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$869, DW_AT_decl_line(0x0e)
	.dwattr $C$DW$869, DW_AT_decl_column(0x18)

$C$DW$870	.dwtag  DW_TAG_member
	.dwattr $C$DW$870, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$870, DW_AT_name("ei")
	.dwattr $C$DW$870, DW_AT_TI_symbol_name("ei")
	.dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$870, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$870, DW_AT_decl_line(0x0f)
	.dwattr $C$DW$870, DW_AT_decl_column(0x18)

$C$DW$871	.dwtag  DW_TAG_member
	.dwattr $C$DW$871, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$871, DW_AT_name("ed")
	.dwattr $C$DW$871, DW_AT_TI_symbol_name("ed")
	.dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$871, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$871, DW_AT_decl_line(0x10)
	.dwattr $C$DW$871, DW_AT_decl_column(0x18)

$C$DW$872	.dwtag  DW_TAG_member
	.dwattr $C$DW$872, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$872, DW_AT_name("y")
	.dwattr $C$DW$872, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$872, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$872, DW_AT_decl_line(0x11)
	.dwattr $C$DW$872, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$79, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x03)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$79

$C$DW$T$145	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$145, DW_AT_name("PID_t")
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$145, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x11)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x1d)


$C$DW$T$87	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$87, DW_AT_name("GPTimerCC26XX_Config")
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x0c)
$C$DW$873	.dwtag  DW_TAG_member
	.dwattr $C$DW$873, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$873, DW_AT_name("object")
	.dwattr $C$DW$873, DW_AT_TI_symbol_name("object")
	.dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$873, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$873, DW_AT_decl_line(0x198)
	.dwattr $C$DW$873, DW_AT_decl_column(0x22)

$C$DW$874	.dwtag  DW_TAG_member
	.dwattr $C$DW$874, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$874, DW_AT_name("hwAttrs")
	.dwattr $C$DW$874, DW_AT_TI_symbol_name("hwAttrs")
	.dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$874, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$874, DW_AT_decl_line(0x199)
	.dwattr $C$DW$874, DW_AT_decl_column(0x22)

$C$DW$875	.dwtag  DW_TAG_member
	.dwattr $C$DW$875, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$875, DW_AT_name("timerPart")
	.dwattr $C$DW$875, DW_AT_TI_symbol_name("timerPart")
	.dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$875, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$875, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$875, DW_AT_decl_column(0x21)

	.dwattr $C$DW$T$87, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0x196)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$87

$C$DW$T$97	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$97, DW_AT_name("GPTimerCC26XX_Config")
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$97, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$97, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$97, DW_AT_decl_column(0x27)

$C$DW$T$98	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$T$98, DW_AT_address_class(0x20)

$C$DW$T$99	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$99, DW_AT_name("GPTimerCC26XX_Handle")
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$99, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$99, DW_AT_decl_line(0x133)
	.dwattr $C$DW$T$99, DW_AT_decl_column(0x2d)


$C$DW$T$114	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$114, DW_AT_name("GPTimerCC26XX_DebugMode")
	.dwattr $C$DW$T$114, DW_AT_byte_size(0x01)
$C$DW$876	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$876, DW_AT_name("GPTimerCC26XX_DEBUG_STALL_OFF")
	.dwattr $C$DW$876, DW_AT_const_value(0x00)
	.dwattr $C$DW$876, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$876, DW_AT_decl_line(0x104)
	.dwattr $C$DW$876, DW_AT_decl_column(0x05)

$C$DW$877	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$877, DW_AT_name("GPTimerCC26XX_DEBUG_STALL_ON")
	.dwattr $C$DW$877, DW_AT_const_value(0x01)
	.dwattr $C$DW$877, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$877, DW_AT_decl_line(0x105)
	.dwattr $C$DW$877, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$114, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$114, DW_AT_decl_line(0x102)
	.dwattr $C$DW$T$114, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$114

$C$DW$T$115	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$115, DW_AT_name("GPTimerCC26XX_DebugMode")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$115, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$115, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$115, DW_AT_decl_column(0x03)


$C$DW$T$112	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$112, DW_AT_name("GPTimerCC26XX_Direction")
	.dwattr $C$DW$T$112, DW_AT_byte_size(0x01)
$C$DW$878	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$878, DW_AT_name("GPTimerCC26XX_DIRECTION_DOWN")
	.dwattr $C$DW$878, DW_AT_const_value(0x00)
	.dwattr $C$DW$878, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$878, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$878, DW_AT_decl_column(0x05)

$C$DW$879	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$879, DW_AT_name("GPTimerCC26XX_DIRECTION_UP")
	.dwattr $C$DW$879, DW_AT_const_value(0x01)
	.dwattr $C$DW$879, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$879, DW_AT_decl_line(0x110)
	.dwattr $C$DW$879, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$112, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$112, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$T$112, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$112

$C$DW$T$113	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$113, DW_AT_name("GPTimerCC26XX_Direction")
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$113, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$113, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$113, DW_AT_decl_column(0x03)


$C$DW$T$146	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$146, DW_AT_name("GPTimerCC26XX_Edge")
	.dwattr $C$DW$T$146, DW_AT_byte_size(0x01)
$C$DW$880	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$880, DW_AT_name("GPTimerCC26XX_POS_EDGE")
	.dwattr $C$DW$880, DW_AT_const_value(0x00)
	.dwattr $C$DW$880, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$880, DW_AT_decl_line(0x129)
	.dwattr $C$DW$880, DW_AT_decl_column(0x05)

$C$DW$881	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$881, DW_AT_name("GPTimerCC26XX_NEG_EDGE")
	.dwattr $C$DW$881, DW_AT_const_value(0x04)
	.dwattr $C$DW$881, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$881, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$881, DW_AT_decl_column(0x05)

$C$DW$882	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$882, DW_AT_name("GPTimerCC26XX_BOTH_EDGES")
	.dwattr $C$DW$882, DW_AT_const_value(0x0c)
	.dwattr $C$DW$882, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$882, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$882, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$146, DW_AT_decl_line(0x127)
	.dwattr $C$DW$T$146, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$146

$C$DW$T$147	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$147, DW_AT_name("GPTimerCC26XX_Edge")
	.dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x03)


$C$DW$T$90	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$90, DW_AT_name("GPTimerCC26XX_HWAttrs")
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x0c)
$C$DW$883	.dwtag  DW_TAG_member
	.dwattr $C$DW$883, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$883, DW_AT_name("baseAddr")
	.dwattr $C$DW$883, DW_AT_TI_symbol_name("baseAddr")
	.dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$883, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$883, DW_AT_decl_line(0x155)
	.dwattr $C$DW$883, DW_AT_decl_column(0x0e)

$C$DW$884	.dwtag  DW_TAG_member
	.dwattr $C$DW$884, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$884, DW_AT_name("intNum")
	.dwattr $C$DW$884, DW_AT_TI_symbol_name("intNum")
	.dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$884, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$884, DW_AT_decl_line(0x157)
	.dwattr $C$DW$884, DW_AT_decl_column(0x0e)

$C$DW$885	.dwtag  DW_TAG_member
	.dwattr $C$DW$885, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$885, DW_AT_name("intPriority")
	.dwattr $C$DW$885, DW_AT_TI_symbol_name("intPriority")
	.dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$885, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$885, DW_AT_decl_line(0x161)
	.dwattr $C$DW$885, DW_AT_decl_column(0x1a)

$C$DW$886	.dwtag  DW_TAG_member
	.dwattr $C$DW$886, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$886, DW_AT_name("powerMngrId")
	.dwattr $C$DW$886, DW_AT_TI_symbol_name("powerMngrId")
	.dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$886, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$886, DW_AT_decl_line(0x163)
	.dwattr $C$DW$886, DW_AT_decl_column(0x1a)

$C$DW$887	.dwtag  DW_TAG_member
	.dwattr $C$DW$887, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$887, DW_AT_name("timer")
	.dwattr $C$DW$887, DW_AT_TI_symbol_name("timer")
	.dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$887, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$887, DW_AT_decl_line(0x165)
	.dwattr $C$DW$887, DW_AT_decl_column(0x1a)

$C$DW$888	.dwtag  DW_TAG_member
	.dwattr $C$DW$888, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$888, DW_AT_name("pinMux")
	.dwattr $C$DW$888, DW_AT_TI_symbol_name("pinMux")
	.dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$888, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$888, DW_AT_decl_line(0x167)
	.dwattr $C$DW$888, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$90, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x152)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$90

$C$DW$T$82	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$82, DW_AT_name("GPTimerCC26XX_HWAttrs")
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$82, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x03)

$C$DW$T$83	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)

$C$DW$T$84	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$84, DW_AT_address_class(0x20)


$C$DW$T$148	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$148, DW_AT_name("GPTimerCC26XX_Interrupt")
	.dwattr $C$DW$T$148, DW_AT_byte_size(0x01)
$C$DW$889	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$889, DW_AT_name("GPT_INT_TIMEOUT")
	.dwattr $C$DW$889, DW_AT_const_value(0x01)
	.dwattr $C$DW$889, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$889, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$889, DW_AT_decl_column(0x05)

$C$DW$890	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$890, DW_AT_name("GPT_INT_CAPTURE_MATCH")
	.dwattr $C$DW$890, DW_AT_const_value(0x02)
	.dwattr $C$DW$890, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$890, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$890, DW_AT_decl_column(0x09)

$C$DW$891	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$891, DW_AT_name("GPT_INT_CAPTURE")
	.dwattr $C$DW$891, DW_AT_const_value(0x04)
	.dwattr $C$DW$891, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$891, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$891, DW_AT_decl_column(0x09)

$C$DW$892	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$892, DW_AT_name("GPT_INT_MATCH")
	.dwattr $C$DW$892, DW_AT_const_value(0x08)
	.dwattr $C$DW$892, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$892, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$892, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$148, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$T$148, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$148

$C$DW$T$149	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$149, DW_AT_name("GPTimerCC26XX_Interrupt")
	.dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$149, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$149, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$T$149, DW_AT_decl_column(0x03)


$C$DW$T$108	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$108, DW_AT_name("GPTimerCC26XX_Mode")
	.dwattr $C$DW$T$108, DW_AT_byte_size(0x02)
$C$DW$893	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$893, DW_AT_name("GPT_MODE_ONESHOT")
	.dwattr $C$DW$893, DW_AT_const_value(0x21)
	.dwattr $C$DW$893, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$893, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$893, DW_AT_decl_column(0x05)

$C$DW$894	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$894, DW_AT_name("GPT_MODE_PERIODIC")
	.dwattr $C$DW$894, DW_AT_const_value(0x22)
	.dwattr $C$DW$894, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$894, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$894, DW_AT_decl_column(0x05)

$C$DW$895	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$895, DW_AT_name("GPT_MODE_EDGE_COUNT")
	.dwattr $C$DW$895, DW_AT_const_value(0x03)
	.dwattr $C$DW$895, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$895, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$895, DW_AT_decl_column(0x05)

$C$DW$896	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$896, DW_AT_name("GPT_MODE_EDGE_TIME")
	.dwattr $C$DW$896, DW_AT_const_value(0x07)
	.dwattr $C$DW$896, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$896, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$896, DW_AT_decl_column(0x05)

$C$DW$897	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$897, DW_AT_name("GPT_MODE_PWM")
	.dwattr $C$DW$897, DW_AT_const_value(0xa0a)
	.dwattr $C$DW$897, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$897, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$897, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$108, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$108, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$108, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$108

$C$DW$T$109	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$109, DW_AT_name("GPTimerCC26XX_Mode")
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$109, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$109, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$T$109, DW_AT_decl_column(0x03)


$C$DW$T$107	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$107, DW_AT_name("GPTimerCC26XX_Object")
	.dwattr $C$DW$T$107, DW_AT_byte_size(0x48)
$C$DW$898	.dwtag  DW_TAG_member
	.dwattr $C$DW$898, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$898, DW_AT_name("width")
	.dwattr $C$DW$898, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$898, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$898, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$898, DW_AT_decl_column(0x1a)

$C$DW$899	.dwtag  DW_TAG_member
	.dwattr $C$DW$899, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$899, DW_AT_name("isOpen")
	.dwattr $C$DW$899, DW_AT_TI_symbol_name("isOpen")
	.dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$899, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$899, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$899, DW_AT_decl_column(0x1a)

$C$DW$900	.dwtag  DW_TAG_member
	.dwattr $C$DW$900, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$900, DW_AT_name("hwi")
	.dwattr $C$DW$900, DW_AT_TI_symbol_name("hwi")
	.dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$900, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$900, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$900, DW_AT_decl_column(0x1b)

$C$DW$901	.dwtag  DW_TAG_member
	.dwattr $C$DW$901, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$901, DW_AT_name("hwiCallbackFxn")
	.dwattr $C$DW$901, DW_AT_TI_symbol_name("hwiCallbackFxn")
	.dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$901, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$901, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$901, DW_AT_decl_column(0x1a)

$C$DW$902	.dwtag  DW_TAG_member
	.dwattr $C$DW$902, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$902, DW_AT_name("powerConstraint")
	.dwattr $C$DW$902, DW_AT_TI_symbol_name("powerConstraint")
	.dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$902, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$902, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$902, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$107, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$107, DW_AT_decl_line(0x178)
	.dwattr $C$DW$T$107, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$107

$C$DW$T$80	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$80, DW_AT_name("GPTimerCC26XX_Object")
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$80, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$80, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$80, DW_AT_decl_column(0x03)

$C$DW$T$81	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$81, DW_AT_address_class(0x20)


$C$DW$T$116	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$116, DW_AT_name("GPTimerCC26XX_Params")
	.dwattr $C$DW$T$116, DW_AT_byte_size(0x08)
$C$DW$903	.dwtag  DW_TAG_member
	.dwattr $C$DW$903, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$903, DW_AT_name("width")
	.dwattr $C$DW$903, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$903, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$903, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$903, DW_AT_decl_column(0x25)

$C$DW$904	.dwtag  DW_TAG_member
	.dwattr $C$DW$904, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$904, DW_AT_name("mode")
	.dwattr $C$DW$904, DW_AT_TI_symbol_name("mode")
	.dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$904, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$904, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$904, DW_AT_decl_column(0x25)

$C$DW$905	.dwtag  DW_TAG_member
	.dwattr $C$DW$905, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$905, DW_AT_name("matchTiming")
	.dwattr $C$DW$905, DW_AT_TI_symbol_name("matchTiming")
	.dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$905, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$905, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$905, DW_AT_decl_column(0x25)

$C$DW$906	.dwtag  DW_TAG_member
	.dwattr $C$DW$906, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$906, DW_AT_name("direction")
	.dwattr $C$DW$906, DW_AT_TI_symbol_name("direction")
	.dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$906, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$906, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$906, DW_AT_decl_column(0x25)

$C$DW$907	.dwtag  DW_TAG_member
	.dwattr $C$DW$907, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$907, DW_AT_name("debugStallMode")
	.dwattr $C$DW$907, DW_AT_TI_symbol_name("debugStallMode")
	.dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$907, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$907, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$907, DW_AT_decl_column(0x25)

	.dwattr $C$DW$T$116, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$116, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$116, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$116

$C$DW$T$150	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$150, DW_AT_name("GPTimerCC26XX_Params")
	.dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$150, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$150, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$T$150, DW_AT_decl_column(0x03)


$C$DW$T$85	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$85, DW_AT_name("GPTimerCC26XX_Part")
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
$C$DW$908	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$908, DW_AT_name("GPT_A")
	.dwattr $C$DW$908, DW_AT_const_value(0x00)
	.dwattr $C$DW$908, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$908, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$908, DW_AT_decl_column(0x05)

$C$DW$909	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$909, DW_AT_name("GPT_B")
	.dwattr $C$DW$909, DW_AT_const_value(0x01)
	.dwattr $C$DW$909, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$909, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$909, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$85, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$85

$C$DW$T$86	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$86, DW_AT_name("GPTimerCC26XX_Part")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$86, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x03)


$C$DW$T$88	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$88, DW_AT_name("GPTimerCC26XX_PinMux")
	.dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
$C$DW$910	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$910, DW_AT_name("GPT_PIN_0A")
	.dwattr $C$DW$910, DW_AT_const_value(0x17)
	.dwattr $C$DW$910, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$910, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$910, DW_AT_decl_column(0x05)

$C$DW$911	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$911, DW_AT_name("GPT_PIN_0B")
	.dwattr $C$DW$911, DW_AT_const_value(0x18)
	.dwattr $C$DW$911, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$911, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$911, DW_AT_decl_column(0x05)

$C$DW$912	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$912, DW_AT_name("GPT_PIN_1A")
	.dwattr $C$DW$912, DW_AT_const_value(0x19)
	.dwattr $C$DW$912, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$912, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$912, DW_AT_decl_column(0x05)

$C$DW$913	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$913, DW_AT_name("GPT_PIN_1B")
	.dwattr $C$DW$913, DW_AT_const_value(0x1a)
	.dwattr $C$DW$913, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$913, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$913, DW_AT_decl_column(0x05)

$C$DW$914	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$914, DW_AT_name("GPT_PIN_2A")
	.dwattr $C$DW$914, DW_AT_const_value(0x1b)
	.dwattr $C$DW$914, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$914, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$914, DW_AT_decl_column(0x05)

$C$DW$915	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$915, DW_AT_name("GPT_PIN_2B")
	.dwattr $C$DW$915, DW_AT_const_value(0x1c)
	.dwattr $C$DW$915, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$915, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$915, DW_AT_decl_column(0x05)

$C$DW$916	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$916, DW_AT_name("GPT_PIN_3A")
	.dwattr $C$DW$916, DW_AT_const_value(0x1d)
	.dwattr $C$DW$916, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$916, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$916, DW_AT_decl_column(0x05)

$C$DW$917	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$917, DW_AT_name("GPT_PIN_3B")
	.dwattr $C$DW$917, DW_AT_const_value(0x1e)
	.dwattr $C$DW$917, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$917, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$917, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$88, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$88, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$T$88, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$88

$C$DW$T$89	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$89, DW_AT_name("GPTimerCC26XX_PinMux")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$89, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$89, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$89, DW_AT_decl_column(0x03)


$C$DW$T$110	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$110, DW_AT_name("GPTimerCC26XX_SetMatchTiming")
	.dwattr $C$DW$T$110, DW_AT_byte_size(0x01)
$C$DW$918	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$918, DW_AT_name("GPTimerCC26XX_SET_MATCH_NEXT_CLOCK")
	.dwattr $C$DW$918, DW_AT_const_value(0x00)
	.dwattr $C$DW$918, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$918, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$918, DW_AT_decl_column(0x05)

$C$DW$919	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$919, DW_AT_name("GPTimerCC26XX_SET_MATCH_ON_TIMEOUT")
	.dwattr $C$DW$919, DW_AT_const_value(0x01)
	.dwattr $C$DW$919, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$919, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$919, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$110, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$110, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$T$110, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$110

$C$DW$T$111	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$111, DW_AT_name("GPTimerCC26XX_SetMatchTiming")
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$111, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$111, DW_AT_decl_line(0x120)
	.dwattr $C$DW$T$111, DW_AT_decl_column(0x03)


$C$DW$T$91	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$91, DW_AT_name("GPTimerCC26XX_Width")
	.dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
$C$DW$920	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$920, DW_AT_name("GPT_CONFIG_32BIT")
	.dwattr $C$DW$920, DW_AT_const_value(0x00)
	.dwattr $C$DW$920, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$920, DW_AT_decl_line(0xae)
	.dwattr $C$DW$920, DW_AT_decl_column(0x05)

$C$DW$921	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$921, DW_AT_name("GPT_CONFIG_16BIT")
	.dwattr $C$DW$921, DW_AT_const_value(0x04)
	.dwattr $C$DW$921, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$921, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$921, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$91, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$91, DW_AT_decl_line(0xac)
	.dwattr $C$DW$T$91, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$91

$C$DW$T$92	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$92, DW_AT_name("GPTimerCC26XX_Width")
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$92, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$92, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$T$92, DW_AT_decl_column(0x03)


$C$DW$T$119	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$119, DW_AT_name("HwiP_Params")
	.dwattr $C$DW$T$119, DW_AT_byte_size(0x0c)
$C$DW$922	.dwtag  DW_TAG_member
	.dwattr $C$DW$922, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$922, DW_AT_name("arg")
	.dwattr $C$DW$922, DW_AT_TI_symbol_name("arg")
	.dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$922, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$922, DW_AT_decl_line(0x72)
	.dwattr $C$DW$922, DW_AT_decl_column(0x10)

$C$DW$923	.dwtag  DW_TAG_member
	.dwattr $C$DW$923, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$923, DW_AT_name("priority")
	.dwattr $C$DW$923, DW_AT_TI_symbol_name("priority")
	.dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$923, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$923, DW_AT_decl_line(0x73)
	.dwattr $C$DW$923, DW_AT_decl_column(0x10)

$C$DW$924	.dwtag  DW_TAG_member
	.dwattr $C$DW$924, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$924, DW_AT_name("enableInt")
	.dwattr $C$DW$924, DW_AT_TI_symbol_name("enableInt")
	.dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$924, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$924, DW_AT_decl_line(0x74)
	.dwattr $C$DW$924, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$119, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$T$119, DW_AT_decl_line(0x71)
	.dwattr $C$DW$T$119, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$119

$C$DW$T$151	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$151, DW_AT_name("HwiP_Params")
	.dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$151, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$T$151, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$151, DW_AT_decl_column(0x03)


$C$DW$T$152	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$152, DW_AT_name("HwiP_Status")
	.dwattr $C$DW$T$152, DW_AT_byte_size(0x01)
$C$DW$925	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$925, DW_AT_name("HwiP_OK")
	.dwattr $C$DW$925, DW_AT_const_value(0x00)
	.dwattr $C$DW$925, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$925, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$925, DW_AT_decl_column(0x05)

$C$DW$926	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$926, DW_AT_name("HwiP_FAILURE")
	.dwattr $C$DW$926, DW_AT_const_value(-1)
	.dwattr $C$DW$926, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$926, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$926, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$152, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$T$152, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$152, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$152

$C$DW$T$153	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$153, DW_AT_name("HwiP_Status")
	.dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$153, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$T$153, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$T$153, DW_AT_decl_column(0x03)


$C$DW$T$122	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$122, DW_AT_name("HwiP_Struct")
	.dwattr $C$DW$T$122, DW_AT_byte_size(0x1c)
$C$DW$927	.dwtag  DW_TAG_member
	.dwattr $C$DW$927, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$927, DW_AT_name("dummy")
	.dwattr $C$DW$927, DW_AT_TI_symbol_name("dummy")
	.dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$927, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$927, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$927, DW_AT_decl_column(0x0e)

$C$DW$928	.dwtag  DW_TAG_member
	.dwattr $C$DW$928, DW_AT_type(*$C$DW$T$121)
	.dwattr $C$DW$928, DW_AT_name("data")
	.dwattr $C$DW$928, DW_AT_TI_symbol_name("data")
	.dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$928, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$928, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$928, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$122, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$T$122, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$T$122, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$122

$C$DW$T$95	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$95, DW_AT_name("HwiP_Struct")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$95, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$T$95, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$95, DW_AT_decl_column(0x03)


$C$DW$T$96	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x38)
$C$DW$929	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$929, DW_AT_upper_bound(0x01)

	.dwendtag $C$DW$T$96

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)

$C$DW$T$154	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$154, DW_AT_name("HwiP_Handle")
	.dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$154, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$T$154, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$154, DW_AT_decl_column(0x10)


$C$DW$T$50	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
	.dwendtag $C$DW$T$50

$C$DW$T$51	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_address_class(0x20)

$C$DW$T$70	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$70, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$70, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x19)

$C$DW$T$52	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$52, DW_AT_name("FPTR_RESETDEV_T")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$52, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x19)

$C$DW$T$163	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$163, DW_AT_name("FPTR_VOID_VOID_T")
	.dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$163, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../inc/hw_types.h")
	.dwattr $C$DW$T$163, DW_AT_decl_line(0x33)
	.dwattr $C$DW$T$163, DW_AT_decl_column(0x11)

$C$DW$T$164	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$164, DW_AT_name("__TI_atexit_fn")
	.dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$164, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$T$164, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$164, DW_AT_decl_column(0x14)


$C$DW$T$66	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
$C$DW$930	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$930, DW_AT_type(*$C$DW$T$34)

	.dwendtag $C$DW$T$66

$C$DW$T$67	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$67, DW_AT_address_class(0x20)

$C$DW$T$68	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$68, DW_AT_name("FPTR_RESERVED4_T")
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$68, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x61)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x19)

$C$DW$T$69	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$69, DW_AT_name("FPTR_RESERVED5_T")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$69, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x63)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x19)


$C$DW$T$71	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
$C$DW$931	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$931, DW_AT_type(*$C$DW$T$36)

	.dwendtag $C$DW$T$71

$C$DW$T$72	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$72, DW_AT_address_class(0x20)

$C$DW$T$75	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$75, DW_AT_name("FPTR_ADCCOMPBIN_T")
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x69)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x19)

$C$DW$T$73	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$73, DW_AT_name("FPTR_COMPAIN_T")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x65)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x19)

$C$DW$T$74	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$74, DW_AT_name("FPTR_COMPAREF_T")
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$74, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x67)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x19)

$C$DW$T$76	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$76, DW_AT_name("FPTR_COMPBREF_T")
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$76, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x19)

$C$DW$T$168	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$168, DW_AT_name("FPTR_VOID_UINT8_T")
	.dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$168, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../inc/hw_types.h")
	.dwattr $C$DW$T$168, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$168, DW_AT_decl_column(0x11)


$C$DW$T$101	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
$C$DW$932	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$932, DW_AT_type(*$C$DW$T$99)

$C$DW$933	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$933, DW_AT_type(*$C$DW$T$100)

	.dwendtag $C$DW$T$101

$C$DW$T$102	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$T$102, DW_AT_address_class(0x20)

$C$DW$T$103	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$103, DW_AT_name("GPTimerCC26XX_HwiFxn")
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$103, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$103, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$T$103, DW_AT_decl_column(0x10)


$C$DW$T$104	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$104, DW_AT_byte_size(0x08)
$C$DW$934	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$934, DW_AT_upper_bound(0x01)

	.dwendtag $C$DW$T$104

$C$DW$T$157	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$2)

$C$DW$T$158	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$T$158, DW_AT_address_class(0x20)


$C$DW$T$165	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
$C$DW$935	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$935, DW_AT_type(*$C$DW$T$118)

	.dwendtag $C$DW$T$165

$C$DW$T$166	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$T$166, DW_AT_address_class(0x20)

$C$DW$T$167	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$167, DW_AT_name("HwiP_Fxn")
	.dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$167, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/dpl/HwiP.h")
	.dwattr $C$DW$T$167, DW_AT_decl_line(0x63)
	.dwattr $C$DW$T$167, DW_AT_decl_column(0x10)

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$169	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$169, DW_AT_name("I08")
	.dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$169, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/koltypes.h")
	.dwattr $C$DW$T$169, DW_AT_decl_line(0x0a)
	.dwattr $C$DW$T$169, DW_AT_decl_column(0x1f)

$C$DW$T$170	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$170, DW_AT_name("__int8_t")
	.dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$170, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$170, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$170, DW_AT_decl_column(0x16)

$C$DW$T$171	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$171, DW_AT_name("__int_least8_t")
	.dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$171, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0x69)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x12)

$C$DW$T$172	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$172, DW_AT_name("int_least8_t")
	.dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
	.dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$172, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/stdint.h")
	.dwattr $C$DW$T$172, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$172, DW_AT_decl_column(0x19)

$C$DW$T$173	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$173, DW_AT_name("int8_t")
	.dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$173, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_stdint.h")
	.dwattr $C$DW$T$173, DW_AT_decl_line(0x25)
	.dwattr $C$DW$T$173, DW_AT_decl_column(0x13)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$22	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$22, DW_AT_name("U08")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/koltypes.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x05)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x1f)

$C$DW$T$174	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$22)


$C$DW$T$175	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$175, DW_AT_byte_size(0x06)
$C$DW$936	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$936, DW_AT_upper_bound(0x05)

	.dwendtag $C$DW$T$175


$C$DW$T$23	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
$C$DW$937	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$937, DW_AT_upper_bound(0x0f)

	.dwendtag $C$DW$T$23

$C$DW$T$176	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$176, DW_AT_address_class(0x20)


$C$DW$T$177	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$177, DW_AT_byte_size(0x06)
$C$DW$938	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$938, DW_AT_upper_bound(0x05)

	.dwendtag $C$DW$T$177

$C$DW$T$123	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$123, DW_AT_address_class(0x20)

$C$DW$T$178	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$6)

$C$DW$T$179	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$T$179, DW_AT_address_class(0x20)


$C$DW$T$180	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$180, DW_AT_byte_size(0x02)
$C$DW$939	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$939, DW_AT_upper_bound(0x01)

	.dwendtag $C$DW$T$180


$C$DW$T$181	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$181, DW_AT_byte_size(0x06)
$C$DW$940	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$940, DW_AT_upper_bound(0x05)

	.dwendtag $C$DW$T$181


$C$DW$T$183	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$183, DW_AT_byte_size(0x0c)
$C$DW$941	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$941, DW_AT_upper_bound(0x0b)

	.dwendtag $C$DW$T$183


$C$DW$T$184	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$184, DW_AT_byte_size(0x03)
$C$DW$942	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$942, DW_AT_upper_bound(0x02)

	.dwendtag $C$DW$T$184


$C$DW$T$185	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$185, DW_AT_byte_size(0x200)
$C$DW$943	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$943, DW_AT_upper_bound(0x1ff)

	.dwendtag $C$DW$T$185


$C$DW$T$186	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$186, DW_AT_byte_size(0x10)
$C$DW$944	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$944, DW_AT_upper_bound(0x0f)

	.dwendtag $C$DW$T$186


$C$DW$T$187	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$187, DW_AT_byte_size(0x09)
$C$DW$945	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$945, DW_AT_upper_bound(0x08)

	.dwendtag $C$DW$T$187

$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("__uint8_t")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$35, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x18)

$C$DW$T$188	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$188, DW_AT_name("__sa_family_t")
	.dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$188, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$188, DW_AT_decl_line(0x47)
	.dwattr $C$DW$T$188, DW_AT_decl_column(0x13)

$C$DW$T$189	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$189, DW_AT_name("__uint_least8_t")
	.dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$189, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$189, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$T$189, DW_AT_decl_column(0x13)

$C$DW$T$190	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$190, DW_AT_name("uint_least8_t")
	.dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
	.dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$190, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/stdint.h")
	.dwattr $C$DW$T$190, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$190, DW_AT_decl_column(0x1a)

$C$DW$T$36	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$36, DW_AT_name("uint8_t")
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$36, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_stdint.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x14)

$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x20)

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)

$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)

$C$DW$T$191	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$191, DW_AT_name("I16")
	.dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$191, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/koltypes.h")
	.dwattr $C$DW$T$191, DW_AT_decl_line(0x0b)
	.dwattr $C$DW$T$191, DW_AT_decl_column(0x1f)

$C$DW$T$192	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$191)

$C$DW$T$193	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$193, DW_AT_name("VI16")
	.dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
	.dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$193, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/koltypes.h")
	.dwattr $C$DW$T$193, DW_AT_decl_line(0x13)
	.dwattr $C$DW$T$193, DW_AT_decl_column(0x1f)


$C$DW$T$126	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$126, DW_AT_byte_size(0x06)
$C$DW$946	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$946, DW_AT_upper_bound(0x02)

	.dwendtag $C$DW$T$126

$C$DW$T$196	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$196, DW_AT_address_class(0x20)

$C$DW$T$198	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$198, DW_AT_name("__int16_t")
	.dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$198, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$198, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$T$198, DW_AT_decl_column(0x11)

$C$DW$T$199	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$199, DW_AT_name("__int_least16_t")
	.dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$198)
	.dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$199, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$199, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$199, DW_AT_decl_column(0x13)

$C$DW$T$200	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$200, DW_AT_name("int_least16_t")
	.dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
	.dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$200, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/stdint.h")
	.dwattr $C$DW$T$200, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$200, DW_AT_decl_column(0x1a)

$C$DW$T$201	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$201, DW_AT_name("int16_t")
	.dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$198)
	.dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$201, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_stdint.h")
	.dwattr $C$DW$T$201, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$201, DW_AT_decl_column(0x14)

$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)

$C$DW$T$27	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$27, DW_AT_name("U16")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$27, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/koltypes.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x06)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x1f)

$C$DW$T$202	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$27)

$C$DW$T$203	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$203, DW_AT_name("VU16")
	.dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$202)
	.dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$203, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/koltypes.h")
	.dwattr $C$DW$T$203, DW_AT_decl_line(0x12)
	.dwattr $C$DW$T$203, DW_AT_decl_column(0x1f)

$C$DW$T$204	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$204, DW_AT_name("___wchar_t")
	.dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$204, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$204, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$T$204, DW_AT_decl_column(0x1a)

$C$DW$T$205	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$205, DW_AT_address_class(0x20)

$C$DW$T$206	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$9)


$C$DW$T$207	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$207, DW_AT_byte_size(0x200)
$C$DW$947	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$947, DW_AT_upper_bound(0xff)

	.dwendtag $C$DW$T$207

$C$DW$T$53	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$53, DW_AT_name("__uint16_t")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$53, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x19)

$C$DW$T$209	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$209, DW_AT_name("__mode_t")
	.dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$209, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$209, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$209, DW_AT_decl_column(0x14)

$C$DW$T$210	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$210, DW_AT_name("__uint_least16_t")
	.dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$210, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$210, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$210, DW_AT_decl_column(0x14)

$C$DW$T$211	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$211, DW_AT_name("__char16_t")
	.dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$210)
	.dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$211, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$211, DW_AT_decl_line(0x71)
	.dwattr $C$DW$T$211, DW_AT_decl_column(0x1a)

$C$DW$T$212	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$212, DW_AT_name("uint_least16_t")
	.dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$210)
	.dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$212, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/stdint.h")
	.dwattr $C$DW$T$212, DW_AT_decl_line(0x30)
	.dwattr $C$DW$T$212, DW_AT_decl_column(0x1a)

$C$DW$T$54	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$54, DW_AT_name("uint16_t")
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$54, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_stdint.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x15)

$C$DW$T$100	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$100, DW_AT_name("GPTimerCC26XX_IntMask")
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$100, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0x136)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x2d)

$C$DW$T$55	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$55, DW_AT_address_class(0x20)

$C$DW$T$213	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$213, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$213, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/stdlib.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x1a)

$C$DW$T$10	.dwtag  DW_TAG_base_type
