;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
;* Date/Time created: Fri Apr  2 00:57:45 2021                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=none --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../App/kro.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("hIntStt")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("hIntStt")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$1, DW_AT_decl_column(0x1d)

	.global	kro
	.common	kro,40,4
$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("kro")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("kro")

        LDR       A1, [SP, #0]          ; [DPU_V7M3_PIPE] |42| 
        LDR       A2, [SP, #0]          ; [DPU_V7M3_PIPE] |42| 
        LDR       A1, [A1, #16]         ; [DPU_V7M3_PIPE] |42| 
        LDR       A2, [A2, #8]          ; [DPU_V7M3_PIPE] |42| 
        CMP       A1, A2                ; [DPU_V7M3_PIPE] |42| 
        BLE       ||$C$L6||             ; [DPU_V7M3_PIPE] |42| 
        ; BRANCHCC OCCURS {||$C$L6||}    ; [] |42| 
;* --------------------------------------------------------------------------*
	.dwpsn	file "../App/kro.c",line 42,column 18,is_stmt,isa 1
        LDR       A1, [SP, #0]          ; [DPU_V7M3_PIPE] |42| 
        LDR       A2, [SP, #0]          ; [DPU_V7M3_PIPE] |42| 
        LDR       A1, [A1, #8]          ; [DPU_V7M3_PIPE] |42| 
        STR       A1, [A2, #16]         ; [DPU_V7M3_PIPE] |42| 
	.dwpsn	file "../App/kro.c",line 42,column 31,is_stmt,isa 1
;* --------------------------------------------------------------------------*
||$C$L6||:    
$C$DW$21	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$21, DW_AT_low_pc(0x00)
	.dwattr $C$DW$21, DW_AT_TI_return

        POP       {A2, A3, A4, PC}      ; [DPU_V7M3_PIPE] 
	.dwcfi	cfa_offset, 0
	.dwcfi	restore_reg, 3
	.dwcfi	restore_reg, 2
	.dwcfi	restore_reg, 1
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$16, DW_AT_TI_end_file("../App/kro.c")
	.dwattr $C$DW$16, DW_AT_TI_end_line(0x2a)
	.dwattr $C$DW$16, DW_AT_TI_end_column(0x1f)
	.dwendentry
	.dwendtag $C$DW$16

;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:Init_KRO"
	.align	4
||$C$CON1||:	.bits	kro,32
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:Kro_Run"
	.align	4
||$C$CON2||:	.bits	kro,32
	.align	4
||$C$CON3||:	.bits	hIntStt,32
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:Kro_Stp"
	.align	4
||$C$CON4||:	.bits	kro,32
	.align	4
||$C$CON5||:	.bits	hIntStt,32
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	hIntStt
	.global	GPTimerCC26XX_getValue

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$124	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$124, DW_AT_byte_size(0x01)
$C$DW$22	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$22, DW_AT_name("PIN_SUCCESS")
	.dwattr $C$DW$22, DW_AT_const_value(0x00)
	.dwattr $C$DW$22, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$22, DW_AT_decl_line(0x2cd)
	.dwattr $C$DW$22, DW_AT_decl_column(0x05)

$C$DW$23	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$23, DW_AT_name("PIN_ALREADY_ALLOCATED")
	.dwattr $C$DW$23, DW_AT_const_value(0x01)
	.dwattr $C$DW$23, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$23, DW_AT_decl_line(0x2ce)
	.dwattr $C$DW$23, DW_AT_decl_column(0x05)

$C$DW$24	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$24, DW_AT_name("PIN_NO_ACCESS")
	.dwattr $C$DW$24, DW_AT_const_value(0x02)
	.dwattr $C$DW$24, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$24, DW_AT_decl_line(0x2cf)
	.dwattr $C$DW$24, DW_AT_decl_column(0x05)

$C$DW$25	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$25, DW_AT_name("PIN_UNSUPPORTED")
	.dwattr $C$DW$25, DW_AT_const_value(0x03)
	.dwattr $C$DW$25, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$25, DW_AT_decl_line(0x2d0)
	.dwattr $C$DW$25, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$124, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$T$124, DW_AT_decl_line(0x2cc)
	.dwattr $C$DW$T$124, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$124

$C$DW$T$125	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$125, DW_AT_name("PIN_Status")
	.dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$125, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/PIN.h")
	.dwattr $C$DW$T$125, DW_AT_decl_line(0x2d1)
	.dwattr $C$DW$T$125, DW_AT_decl_column(0x03)


$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x14)
$C$DW$26	.dwtag  DW_TAG_member
	.dwattr $C$DW$26, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$26, DW_AT_name("t0")
	.dwattr $C$DW$26, DW_AT_TI_symbol_name("t0")
	.dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$26, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$26, DW_AT_decl_line(0x07)
	.dwattr $C$DW$26, DW_AT_decl_column(0x16)

$C$DW$27	.dwtag  DW_TAG_member
	.dwattr $C$DW$27, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$27, DW_AT_name("t1")
	.dwattr $C$DW$27, DW_AT_TI_symbol_name("t1")
	.dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$27, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$27, DW_AT_decl_line(0x08)
	.dwattr $C$DW$27, DW_AT_decl_column(0x16)

$C$DW$28	.dwtag  DW_TAG_member
	.dwattr $C$DW$28, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$28, DW_AT_name("dt")
	.dwattr $C$DW$28, DW_AT_TI_symbol_name("dt")
	.dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$28, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$28, DW_AT_decl_line(0x09)
	.dwattr $C$DW$28, DW_AT_decl_column(0x16)

$C$DW$29	.dwtag  DW_TAG_member
	.dwattr $C$DW$29, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$29, DW_AT_name("mx")
	.dwattr $C$DW$29, DW_AT_TI_symbol_name("mx")
	.dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$29, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$29, DW_AT_decl_line(0x0a)
	.dwattr $C$DW$29, DW_AT_decl_column(0x16)

$C$DW$30	.dwtag  DW_TAG_member
	.dwattr $C$DW$30, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$30, DW_AT_name("mn")
	.dwattr $C$DW$30, DW_AT_TI_symbol_name("mn")
	.dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$30, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$30, DW_AT_decl_line(0x0b)
	.dwattr $C$DW$30, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$22, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x07)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$22

$C$DW$T$126	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$126, DW_AT_name("KRO_t")
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$126, DW_AT_decl_file("../App/kro.h")
	.dwattr $C$DW$T$126, DW_AT_decl_line(0x0c)
	.dwattr $C$DW$T$126, DW_AT_decl_column(0x12)


$C$DW$T$127	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$127, DW_AT_byte_size(0x28)
$C$DW$31	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$31, DW_AT_upper_bound(0x01)

	.dwendtag $C$DW$T$127

$C$DW$T$128	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$128, DW_AT_address_class(0x20)


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
$C$DW$32	.dwtag  DW_TAG_member
	.dwattr $C$DW$32, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$32, DW_AT_name("__max_align1")
	.dwattr $C$DW$32, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$32, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$32, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$32, DW_AT_decl_column(0x0c)

$C$DW$33	.dwtag  DW_TAG_member
	.dwattr $C$DW$33, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$33, DW_AT_name("__max_align2")
	.dwattr $C$DW$33, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$33, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$33, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$33, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$23, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$23

$C$DW$T$129	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$129, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$129, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$129, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$129, DW_AT_decl_column(0x03)


$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x4c)
$C$DW$34	.dwtag  DW_TAG_member
	.dwattr $C$DW$34, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$34, DW_AT_name("Crc32")
	.dwattr $C$DW$34, DW_AT_TI_symbol_name("Crc32")
	.dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$34, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$34, DW_AT_decl_line(0x76)
	.dwattr $C$DW$34, DW_AT_decl_column(0x25)

$C$DW$35	.dwtag  DW_TAG_member
	.dwattr $C$DW$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$35, DW_AT_name("FlashGetSize")
	.dwattr $C$DW$35, DW_AT_TI_symbol_name("FlashGetSize")
	.dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$35, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$35, DW_AT_decl_line(0x77)
	.dwattr $C$DW$35, DW_AT_decl_column(0x25)

$C$DW$36	.dwtag  DW_TAG_member
	.dwattr $C$DW$36, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$36, DW_AT_name("GetChipId")
	.dwattr $C$DW$36, DW_AT_TI_symbol_name("GetChipId")
	.dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$36, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$36, DW_AT_decl_line(0x78)
	.dwattr $C$DW$36, DW_AT_decl_column(0x25)

$C$DW$37	.dwtag  DW_TAG_member
	.dwattr $C$DW$37, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$37, DW_AT_name("ReservedLocation1")
	.dwattr $C$DW$37, DW_AT_TI_symbol_name("ReservedLocation1")
	.dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$37, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$37, DW_AT_decl_line(0x79)
	.dwattr $C$DW$37, DW_AT_decl_column(0x25)

$C$DW$38	.dwtag  DW_TAG_member
	.dwattr $C$DW$38, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$38, DW_AT_name("ReservedLocation2")
	.dwattr $C$DW$38, DW_AT_TI_symbol_name("ReservedLocation2")
	.dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$38, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$38, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$38, DW_AT_decl_column(0x25)

$C$DW$39	.dwtag  DW_TAG_member
	.dwattr $C$DW$39, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$39, DW_AT_name("ReservedLocation3")
	.dwattr $C$DW$39, DW_AT_TI_symbol_name("ReservedLocation3")
	.dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$39, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$39, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$39, DW_AT_decl_column(0x25)

$C$DW$40	.dwtag  DW_TAG_member
	.dwattr $C$DW$40, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$40, DW_AT_name("ResetDevice")
	.dwattr $C$DW$40, DW_AT_TI_symbol_name("ResetDevice")
	.dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$40, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$40, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$40, DW_AT_decl_column(0x25)

$C$DW$41	.dwtag  DW_TAG_member
	.dwattr $C$DW$41, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$41, DW_AT_name("Fletcher32")
	.dwattr $C$DW$41, DW_AT_TI_symbol_name("Fletcher32")
	.dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$41, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$41, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$41, DW_AT_decl_column(0x25)

$C$DW$42	.dwtag  DW_TAG_member
	.dwattr $C$DW$42, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$42, DW_AT_name("MinValue")
	.dwattr $C$DW$42, DW_AT_TI_symbol_name("MinValue")
	.dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$42, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$42, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$42, DW_AT_decl_column(0x25)

$C$DW$43	.dwtag  DW_TAG_member
	.dwattr $C$DW$43, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$43, DW_AT_name("MaxValue")
	.dwattr $C$DW$43, DW_AT_TI_symbol_name("MaxValue")
	.dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$43, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$43, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$43, DW_AT_decl_column(0x25)

$C$DW$44	.dwtag  DW_TAG_member
	.dwattr $C$DW$44, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$44, DW_AT_name("MeanValue")
	.dwattr $C$DW$44, DW_AT_TI_symbol_name("MeanValue")
	.dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$44, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$44, DW_AT_decl_line(0x80)
	.dwattr $C$DW$44, DW_AT_decl_column(0x25)

$C$DW$45	.dwtag  DW_TAG_member
	.dwattr $C$DW$45, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$45, DW_AT_name("StandDeviationValue")
	.dwattr $C$DW$45, DW_AT_TI_symbol_name("StandDeviationValue")
	.dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$45, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$45, DW_AT_decl_line(0x81)
	.dwattr $C$DW$45, DW_AT_decl_column(0x25)

$C$DW$46	.dwtag  DW_TAG_member
	.dwattr $C$DW$46, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$46, DW_AT_name("ReservedLocation4")
	.dwattr $C$DW$46, DW_AT_TI_symbol_name("ReservedLocation4")
	.dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$46, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$46, DW_AT_decl_line(0x82)
	.dwattr $C$DW$46, DW_AT_decl_column(0x25)

$C$DW$47	.dwtag  DW_TAG_member
	.dwattr $C$DW$47, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$47, DW_AT_name("ReservedLocation5")
	.dwattr $C$DW$47, DW_AT_TI_symbol_name("ReservedLocation5")
	.dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$47, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$47, DW_AT_decl_line(0x83)
	.dwattr $C$DW$47, DW_AT_decl_column(0x25)

$C$DW$48	.dwtag  DW_TAG_member
	.dwattr $C$DW$48, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$48, DW_AT_name("HFSourceSafeSwitch")
	.dwattr $C$DW$48, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
	.dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$48, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$48, DW_AT_decl_line(0x84)
	.dwattr $C$DW$48, DW_AT_decl_column(0x25)

$C$DW$49	.dwtag  DW_TAG_member
	.dwattr $C$DW$49, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$49, DW_AT_name("SelectCompAInput")
	.dwattr $C$DW$49, DW_AT_TI_symbol_name("SelectCompAInput")
	.dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$49, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$49, DW_AT_decl_line(0x85)
	.dwattr $C$DW$49, DW_AT_decl_column(0x25)

$C$DW$50	.dwtag  DW_TAG_member
	.dwattr $C$DW$50, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$50, DW_AT_name("SelectCompARef")
	.dwattr $C$DW$50, DW_AT_TI_symbol_name("SelectCompARef")
	.dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$50, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$50, DW_AT_decl_line(0x86)
	.dwattr $C$DW$50, DW_AT_decl_column(0x25)

$C$DW$51	.dwtag  DW_TAG_member
	.dwattr $C$DW$51, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$51, DW_AT_name("SelectADCCompBInput")
	.dwattr $C$DW$51, DW_AT_TI_symbol_name("SelectADCCompBInput")
	.dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$51, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$51, DW_AT_decl_line(0x87)
	.dwattr $C$DW$51, DW_AT_decl_column(0x25)

$C$DW$52	.dwtag  DW_TAG_member
	.dwattr $C$DW$52, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$52, DW_AT_name("SelectCompBRef")
	.dwattr $C$DW$52, DW_AT_TI_symbol_name("SelectCompBRef")
	.dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$52, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$52, DW_AT_decl_line(0x88)
	.dwattr $C$DW$52, DW_AT_decl_column(0x25)

	.dwattr $C$DW$T$68, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$68

$C$DW$T$130	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$130, DW_AT_name("HARD_API_T")
	.dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$130, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$130, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$130, DW_AT_decl_column(0x03)


$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x3c)
$C$DW$53	.dwtag  DW_TAG_member
	.dwattr $C$DW$53, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$53, DW_AT_name("ref")
	.dwattr $C$DW$53, DW_AT_TI_symbol_name("ref")
	.dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$53, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$53, DW_AT_decl_line(0x03)
	.dwattr $C$DW$53, DW_AT_decl_column(0x18)

$C$DW$54	.dwtag  DW_TAG_member
	.dwattr $C$DW$54, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$54, DW_AT_name("fdb")
	.dwattr $C$DW$54, DW_AT_TI_symbol_name("fdb")
	.dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$54, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$54, DW_AT_decl_line(0x04)
	.dwattr $C$DW$54, DW_AT_decl_column(0x18)

$C$DW$55	.dwtag  DW_TAG_member
	.dwattr $C$DW$55, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$55, DW_AT_name("Kp")
	.dwattr $C$DW$55, DW_AT_TI_symbol_name("Kp")
	.dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$55, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$55, DW_AT_decl_line(0x05)
	.dwattr $C$DW$55, DW_AT_decl_column(0x18)

$C$DW$56	.dwtag  DW_TAG_member
	.dwattr $C$DW$56, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$56, DW_AT_name("Ki")
	.dwattr $C$DW$56, DW_AT_TI_symbol_name("Ki")
	.dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$56, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$56, DW_AT_decl_line(0x06)
	.dwattr $C$DW$56, DW_AT_decl_column(0x18)

$C$DW$57	.dwtag  DW_TAG_member
	.dwattr $C$DW$57, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$57, DW_AT_name("Kd")
	.dwattr $C$DW$57, DW_AT_TI_symbol_name("Kd")
	.dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$57, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$57, DW_AT_decl_line(0x07)
	.dwattr $C$DW$57, DW_AT_decl_column(0x18)

$C$DW$58	.dwtag  DW_TAG_member
	.dwattr $C$DW$58, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$58, DW_AT_name("Kc")
	.dwattr $C$DW$58, DW_AT_TI_symbol_name("Kc")
	.dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$58, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$58, DW_AT_decl_line(0x08)
	.dwattr $C$DW$58, DW_AT_decl_column(0x18)

$C$DW$59	.dwtag  DW_TAG_member
	.dwattr $C$DW$59, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$59, DW_AT_name("Gp")
	.dwattr $C$DW$59, DW_AT_TI_symbol_name("Gp")
	.dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$59, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$59, DW_AT_decl_line(0x09)
	.dwattr $C$DW$59, DW_AT_decl_column(0x18)

$C$DW$60	.dwtag  DW_TAG_member
	.dwattr $C$DW$60, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$60, DW_AT_name("Gi")
	.dwattr $C$DW$60, DW_AT_TI_symbol_name("Gi")
	.dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$60, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$60, DW_AT_decl_line(0x0a)
	.dwattr $C$DW$60, DW_AT_decl_column(0x18)

$C$DW$61	.dwtag  DW_TAG_member
	.dwattr $C$DW$61, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$61, DW_AT_name("yn")
	.dwattr $C$DW$61, DW_AT_TI_symbol_name("yn")
	.dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$61, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$61, DW_AT_decl_line(0x0b)
	.dwattr $C$DW$61, DW_AT_decl_column(0x18)

$C$DW$62	.dwtag  DW_TAG_member
	.dwattr $C$DW$62, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$62, DW_AT_name("yp")
	.dwattr $C$DW$62, DW_AT_TI_symbol_name("yp")
	.dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$62, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$62, DW_AT_decl_line(0x0c)
	.dwattr $C$DW$62, DW_AT_decl_column(0x18)

$C$DW$63	.dwtag  DW_TAG_member
	.dwattr $C$DW$63, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$63, DW_AT_name("ep")
	.dwattr $C$DW$63, DW_AT_TI_symbol_name("ep")
	.dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$63, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$63, DW_AT_decl_line(0x0d)
	.dwattr $C$DW$63, DW_AT_decl_column(0x18)

$C$DW$64	.dwtag  DW_TAG_member
	.dwattr $C$DW$64, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$64, DW_AT_name("es")
	.dwattr $C$DW$64, DW_AT_TI_symbol_name("es")
	.dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$64, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$64, DW_AT_decl_line(0x0e)
	.dwattr $C$DW$64, DW_AT_decl_column(0x18)

$C$DW$65	.dwtag  DW_TAG_member
	.dwattr $C$DW$65, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$65, DW_AT_name("ei")
	.dwattr $C$DW$65, DW_AT_TI_symbol_name("ei")
	.dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$65, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$65, DW_AT_decl_line(0x0f)
	.dwattr $C$DW$65, DW_AT_decl_column(0x18)

$C$DW$66	.dwtag  DW_TAG_member
	.dwattr $C$DW$66, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$66, DW_AT_name("ed")
	.dwattr $C$DW$66, DW_AT_TI_symbol_name("ed")
	.dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$66, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$66, DW_AT_decl_line(0x10)
	.dwattr $C$DW$66, DW_AT_decl_column(0x18)

$C$DW$67	.dwtag  DW_TAG_member
	.dwattr $C$DW$67, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$67, DW_AT_name("y")
	.dwattr $C$DW$67, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$67, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$67, DW_AT_decl_line(0x11)
	.dwattr $C$DW$67, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$71, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x03)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$71

$C$DW$T$131	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$131, DW_AT_name("PID_t")
	.dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$131, DW_AT_decl_file("../App/flight.h")
	.dwattr $C$DW$T$131, DW_AT_decl_line(0x11)
	.dwattr $C$DW$T$131, DW_AT_decl_column(0x1d)


$C$DW$T$132	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$132, DW_AT_name("CC2640R2_LAUNCHXL_ADCBuf0ChannelName")
	.dwattr $C$DW$T$132, DW_AT_byte_size(0x01)
$C$DW$68	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$68, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL0")
	.dwattr $C$DW$68, DW_AT_const_value(0x00)
	.dwattr $C$DW$68, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$68, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$68, DW_AT_decl_column(0x05)

$C$DW$69	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$69, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL1")
	.dwattr $C$DW$69, DW_AT_const_value(0x01)
	.dwattr $C$DW$69, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$69, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$69, DW_AT_decl_column(0x05)

$C$DW$70	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$70, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL2")
	.dwattr $C$DW$70, DW_AT_const_value(0x02)
	.dwattr $C$DW$70, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$70, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$70, DW_AT_decl_column(0x05)

$C$DW$71	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$71, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL3")
	.dwattr $C$DW$71, DW_AT_const_value(0x03)
	.dwattr $C$DW$71, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$71, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$71, DW_AT_decl_column(0x05)

$C$DW$72	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$72, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL4")
	.dwattr $C$DW$72, DW_AT_const_value(0x04)
	.dwattr $C$DW$72, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$72, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$72, DW_AT_decl_column(0x05)

$C$DW$73	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$73, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL5")
	.dwattr $C$DW$73, DW_AT_const_value(0x05)
	.dwattr $C$DW$73, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$73, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$73, DW_AT_decl_column(0x05)

$C$DW$74	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$74, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL6")
	.dwattr $C$DW$74, DW_AT_const_value(0x06)
	.dwattr $C$DW$74, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$74, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$74, DW_AT_decl_column(0x05)

$C$DW$75	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$75, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNEL7")
	.dwattr $C$DW$75, DW_AT_const_value(0x07)
	.dwattr $C$DW$75, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$75, DW_AT_decl_line(0xca)
	.dwattr $C$DW$75, DW_AT_decl_column(0x05)

$C$DW$76	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$76, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNELVDDS")
	.dwattr $C$DW$76, DW_AT_const_value(0x08)
	.dwattr $C$DW$76, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$76, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$76, DW_AT_decl_column(0x05)

$C$DW$77	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$77, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNELDCOUPL")
	.dwattr $C$DW$77, DW_AT_const_value(0x09)
	.dwattr $C$DW$77, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$77, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$77, DW_AT_decl_column(0x05)

$C$DW$78	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$78, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNELVSS")
	.dwattr $C$DW$78, DW_AT_const_value(0x0a)
	.dwattr $C$DW$78, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$78, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$78, DW_AT_decl_column(0x05)

$C$DW$79	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$79, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0CHANNELCOUNT")
	.dwattr $C$DW$79, DW_AT_const_value(0x0b)
	.dwattr $C$DW$79, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$79, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$79, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$132, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$132, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$T$132, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$132

$C$DW$T$133	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$133, DW_AT_name("CC2640R2_LAUNCHXL_ADCBuf0ChannelName")
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$133, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$133, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$T$133, DW_AT_decl_column(0x03)


$C$DW$T$134	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$134, DW_AT_name("CC2640R2_LAUNCHXL_ADCBufName")
	.dwattr $C$DW$T$134, DW_AT_byte_size(0x01)
$C$DW$80	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$80, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUF0")
	.dwattr $C$DW$80, DW_AT_const_value(0x00)
	.dwattr $C$DW$80, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$80, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$80, DW_AT_decl_column(0x05)

$C$DW$81	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$81, DW_AT_name("CC2640R2_LAUNCHXL_ADCBUFCOUNT")
	.dwattr $C$DW$81, DW_AT_const_value(0x01)
	.dwattr $C$DW$81, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$81, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$81, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$134, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$134, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$134, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$134

$C$DW$T$135	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$135, DW_AT_name("CC2640R2_LAUNCHXL_ADCBufName")
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$135, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$135, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$T$135, DW_AT_decl_column(0x03)


$C$DW$T$136	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$136, DW_AT_name("CC2640R2_LAUNCHXL_ADCName")
	.dwattr $C$DW$T$136, DW_AT_byte_size(0x01)
$C$DW$82	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$82, DW_AT_name("CC2640R2_LAUNCHXL_ADC0")
	.dwattr $C$DW$82, DW_AT_const_value(0x00)
	.dwattr $C$DW$82, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$82, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$82, DW_AT_decl_column(0x05)

$C$DW$83	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$83, DW_AT_name("CC2640R2_LAUNCHXL_ADC1")
	.dwattr $C$DW$83, DW_AT_const_value(0x01)
	.dwattr $C$DW$83, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$83, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$83, DW_AT_decl_column(0x05)

$C$DW$84	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$84, DW_AT_name("CC2640R2_LAUNCHXL_ADC2")
	.dwattr $C$DW$84, DW_AT_const_value(0x02)
	.dwattr $C$DW$84, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$84, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$84, DW_AT_decl_column(0x05)

$C$DW$85	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$85, DW_AT_name("CC2640R2_LAUNCHXL_ADC3")
	.dwattr $C$DW$85, DW_AT_const_value(0x03)
	.dwattr $C$DW$85, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$85, DW_AT_decl_line(0xda)
	.dwattr $C$DW$85, DW_AT_decl_column(0x05)

$C$DW$86	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$86, DW_AT_name("CC2640R2_LAUNCHXL_ADC4")
	.dwattr $C$DW$86, DW_AT_const_value(0x04)
	.dwattr $C$DW$86, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$86, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$86, DW_AT_decl_column(0x05)

$C$DW$87	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$87, DW_AT_name("CC2640R2_LAUNCHXL_ADC5")
	.dwattr $C$DW$87, DW_AT_const_value(0x05)
	.dwattr $C$DW$87, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$87, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$87, DW_AT_decl_column(0x05)

$C$DW$88	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$88, DW_AT_name("CC2640R2_LAUNCHXL_ADC6")
	.dwattr $C$DW$88, DW_AT_const_value(0x06)
	.dwattr $C$DW$88, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$88, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$88, DW_AT_decl_column(0x05)

$C$DW$89	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$89, DW_AT_name("CC2640R2_LAUNCHXL_ADC7")
	.dwattr $C$DW$89, DW_AT_const_value(0x07)
	.dwattr $C$DW$89, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$89, DW_AT_decl_line(0xde)
	.dwattr $C$DW$89, DW_AT_decl_column(0x05)

$C$DW$90	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$90, DW_AT_name("CC2640R2_LAUNCHXL_ADCDCOUPL")
	.dwattr $C$DW$90, DW_AT_const_value(0x08)
	.dwattr $C$DW$90, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$90, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$90, DW_AT_decl_column(0x05)

$C$DW$91	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$91, DW_AT_name("CC2640R2_LAUNCHXL_ADCVSS")
	.dwattr $C$DW$91, DW_AT_const_value(0x09)
	.dwattr $C$DW$91, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$91, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$91, DW_AT_decl_column(0x05)

$C$DW$92	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$92, DW_AT_name("CC2640R2_LAUNCHXL_ADCVDDS")
	.dwattr $C$DW$92, DW_AT_const_value(0x0a)
	.dwattr $C$DW$92, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$92, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$92, DW_AT_decl_column(0x05)

$C$DW$93	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$93, DW_AT_name("CC2640R2_LAUNCHXL_ADCCOUNT")
	.dwattr $C$DW$93, DW_AT_const_value(0x0b)
	.dwattr $C$DW$93, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$93, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$93, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$136, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$136, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$T$136, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$136

$C$DW$T$137	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$137, DW_AT_name("CC2640R2_LAUNCHXL_ADCName")
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$137, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$137, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$137, DW_AT_decl_column(0x03)


$C$DW$T$138	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$138, DW_AT_name("CC2640R2_LAUNCHXL_AESCBCName")
	.dwattr $C$DW$T$138, DW_AT_byte_size(0x01)
$C$DW$94	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$94, DW_AT_name("CC2640R2_LAUNCHXL_AESCBC0")
	.dwattr $C$DW$94, DW_AT_const_value(0x00)
	.dwattr $C$DW$94, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$94, DW_AT_decl_line(0x109)
	.dwattr $C$DW$94, DW_AT_decl_column(0x05)

$C$DW$95	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$95, DW_AT_name("CC2640R2_LAUNCHXL_AESCBCCOUNT")
	.dwattr $C$DW$95, DW_AT_const_value(0x01)
	.dwattr $C$DW$95, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$95, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$95, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$138, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$138, DW_AT_decl_line(0x108)
	.dwattr $C$DW$T$138, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$138

$C$DW$T$139	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$139, DW_AT_name("CC2640R2_LAUNCHXL_AESCBCName")
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$139, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$139, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$T$139, DW_AT_decl_column(0x03)


$C$DW$T$140	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$140, DW_AT_name("CC2640R2_LAUNCHXL_AESCCMName")
	.dwattr $C$DW$T$140, DW_AT_byte_size(0x01)
$C$DW$96	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$96, DW_AT_name("CC2640R2_LAUNCHXL_AESCCM0")
	.dwattr $C$DW$96, DW_AT_const_value(0x00)
	.dwattr $C$DW$96, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$96, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$96, DW_AT_decl_column(0x05)

$C$DW$97	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$97, DW_AT_name("CC2640R2_LAUNCHXL_AESCCMCOUNT")
	.dwattr $C$DW$97, DW_AT_const_value(0x01)
	.dwattr $C$DW$97, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$97, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$97, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$140, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$140, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$140, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$140

$C$DW$T$141	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$141, DW_AT_name("CC2640R2_LAUNCHXL_AESCCMName")
	.dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$140)
	.dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$141, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$141, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$141, DW_AT_decl_column(0x03)


$C$DW$T$142	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$142, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRDRBGName")
	.dwattr $C$DW$T$142, DW_AT_byte_size(0x01)
$C$DW$98	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$98, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRDRBG0")
	.dwattr $C$DW$98, DW_AT_const_value(0x00)
	.dwattr $C$DW$98, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$98, DW_AT_decl_line(0x127)
	.dwattr $C$DW$98, DW_AT_decl_column(0x05)

$C$DW$99	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$99, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRDRBGCOUNT")
	.dwattr $C$DW$99, DW_AT_const_value(0x01)
	.dwattr $C$DW$99, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$99, DW_AT_decl_line(0x129)
	.dwattr $C$DW$99, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$142, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$142, DW_AT_decl_line(0x126)
	.dwattr $C$DW$T$142, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$142

$C$DW$T$143	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$143, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRDRBGName")
	.dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$142)
	.dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$143, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$143, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$T$143, DW_AT_decl_column(0x03)


$C$DW$T$144	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$144, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRName")
	.dwattr $C$DW$T$144, DW_AT_byte_size(0x01)
$C$DW$100	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$100, DW_AT_name("CC2640R2_LAUNCHXL_AESCTR0")
	.dwattr $C$DW$100, DW_AT_const_value(0x00)
	.dwattr $C$DW$100, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$100, DW_AT_decl_line(0x113)
	.dwattr $C$DW$100, DW_AT_decl_column(0x05)

$C$DW$101	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$101, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRCOUNT")
	.dwattr $C$DW$101, DW_AT_const_value(0x01)
	.dwattr $C$DW$101, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$101, DW_AT_decl_line(0x115)
	.dwattr $C$DW$101, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$144, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$144, DW_AT_decl_line(0x112)
	.dwattr $C$DW$T$144, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$144

$C$DW$T$145	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$145, DW_AT_name("CC2640R2_LAUNCHXL_AESCTRName")
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
	.dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$145, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x116)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x03)


$C$DW$T$146	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$146, DW_AT_name("CC2640R2_LAUNCHXL_AESECBName")
	.dwattr $C$DW$T$146, DW_AT_byte_size(0x01)
$C$DW$102	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$102, DW_AT_name("CC2640R2_LAUNCHXL_AESECB0")
	.dwattr $C$DW$102, DW_AT_const_value(0x00)
	.dwattr $C$DW$102, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$102, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$102, DW_AT_decl_column(0x05)

$C$DW$103	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$103, DW_AT_name("CC2640R2_LAUNCHXL_AESECBCOUNT")
	.dwattr $C$DW$103, DW_AT_const_value(0x01)
	.dwattr $C$DW$103, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$103, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$103, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$146, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$146, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$T$146, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$146

$C$DW$T$147	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$147, DW_AT_name("CC2640R2_LAUNCHXL_AESECBName")
	.dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$147, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0x120)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x03)


$C$DW$T$148	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$148, DW_AT_name("CC2640R2_LAUNCHXL_AESGCMName")
	.dwattr $C$DW$T$148, DW_AT_byte_size(0x01)
$C$DW$104	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$104, DW_AT_name("CC2640R2_LAUNCHXL_AESGCM0")
	.dwattr $C$DW$104, DW_AT_const_value(0x00)
	.dwattr $C$DW$104, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$104, DW_AT_decl_line(0xff)
	.dwattr $C$DW$104, DW_AT_decl_column(0x05)

$C$DW$105	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$105, DW_AT_name("CC2640R2_LAUNCHXL_AESGCMCOUNT")
	.dwattr $C$DW$105, DW_AT_const_value(0x01)
	.dwattr $C$DW$105, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$105, DW_AT_decl_line(0x101)
	.dwattr $C$DW$105, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$148, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$148, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$T$148, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$148

$C$DW$T$149	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$149, DW_AT_name("CC2640R2_LAUNCHXL_AESGCMName")
	.dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$149, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$149, DW_AT_decl_line(0x102)
	.dwattr $C$DW$T$149, DW_AT_decl_column(0x03)


$C$DW$T$150	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$150, DW_AT_name("CC2640R2_LAUNCHXL_CryptoName")
	.dwattr $C$DW$T$150, DW_AT_byte_size(0x01)
$C$DW$106	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$106, DW_AT_name("CC2640R2_LAUNCHXL_CRYPTO0")
	.dwattr $C$DW$106, DW_AT_const_value(0x00)
	.dwattr $C$DW$106, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$106, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$106, DW_AT_decl_column(0x05)

$C$DW$107	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$107, DW_AT_name("CC2640R2_LAUNCHXL_CRYPTOCOUNT")
	.dwattr $C$DW$107, DW_AT_const_value(0x01)
	.dwattr $C$DW$107, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$107, DW_AT_decl_line(0xed)
	.dwattr $C$DW$107, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$150, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$150, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$150, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$150

$C$DW$T$151	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$151, DW_AT_name("CC2640R2_LAUNCHXL_CryptoName")
	.dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$151, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$151, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$151, DW_AT_decl_column(0x03)


$C$DW$T$152	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$152, DW_AT_name("CC2640R2_LAUNCHXL_GPIOName")
	.dwattr $C$DW$T$152, DW_AT_byte_size(0x01)
$C$DW$108	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$108, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_S1")
	.dwattr $C$DW$108, DW_AT_const_value(0x00)
	.dwattr $C$DW$108, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$108, DW_AT_decl_line(0x13b)
	.dwattr $C$DW$108, DW_AT_decl_column(0x05)

$C$DW$109	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$109, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_S2")
	.dwattr $C$DW$109, DW_AT_const_value(0x01)
	.dwattr $C$DW$109, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$109, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$109, DW_AT_decl_column(0x05)

$C$DW$110	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$110, DW_AT_name("CC2640R2_LAUNCHXL_SPI_MASTER_READY")
	.dwattr $C$DW$110, DW_AT_const_value(0x02)
	.dwattr $C$DW$110, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$110, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$110, DW_AT_decl_column(0x05)

$C$DW$111	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$111, DW_AT_name("CC2640R2_LAUNCHXL_SPI_SLAVE_READY")
	.dwattr $C$DW$111, DW_AT_const_value(0x03)
	.dwattr $C$DW$111, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$111, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$111, DW_AT_decl_column(0x05)

$C$DW$112	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$112, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_LED_GREEN")
	.dwattr $C$DW$112, DW_AT_const_value(0x04)
	.dwattr $C$DW$112, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$112, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$112, DW_AT_decl_column(0x05)

$C$DW$113	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$113, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_LED_RED")
	.dwattr $C$DW$113, DW_AT_const_value(0x05)
	.dwattr $C$DW$113, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$113, DW_AT_decl_line(0x140)
	.dwattr $C$DW$113, DW_AT_decl_column(0x05)

$C$DW$114	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$114, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_TMP116_EN")
	.dwattr $C$DW$114, DW_AT_const_value(0x06)
	.dwattr $C$DW$114, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$114, DW_AT_decl_line(0x141)
	.dwattr $C$DW$114, DW_AT_decl_column(0x05)

$C$DW$115	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$115, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_SPI_FLASH_CS")
	.dwattr $C$DW$115, DW_AT_const_value(0x07)
	.dwattr $C$DW$115, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$115, DW_AT_decl_line(0x142)
	.dwattr $C$DW$115, DW_AT_decl_column(0x05)

$C$DW$116	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$116, DW_AT_name("CC2640R2_LAUNCHXL_SDSPI_CS")
	.dwattr $C$DW$116, DW_AT_const_value(0x08)
	.dwattr $C$DW$116, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$116, DW_AT_decl_line(0x143)
	.dwattr $C$DW$116, DW_AT_decl_column(0x05)

$C$DW$117	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$117, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_LCD_CS")
	.dwattr $C$DW$117, DW_AT_const_value(0x09)
	.dwattr $C$DW$117, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$117, DW_AT_decl_line(0x144)
	.dwattr $C$DW$117, DW_AT_decl_column(0x05)

$C$DW$118	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$118, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_LCD_POWER")
	.dwattr $C$DW$118, DW_AT_const_value(0x0a)
	.dwattr $C$DW$118, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$118, DW_AT_decl_line(0x145)
	.dwattr $C$DW$118, DW_AT_decl_column(0x05)

$C$DW$119	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$119, DW_AT_name("CC2640R2_LAUNCHXL_GPIO_LCD_ENABLE")
	.dwattr $C$DW$119, DW_AT_const_value(0x0b)
	.dwattr $C$DW$119, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$119, DW_AT_decl_line(0x146)
	.dwattr $C$DW$119, DW_AT_decl_column(0x05)

$C$DW$120	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$120, DW_AT_name("CC2640R2_LAUNCHXL_GPIOCOUNT")
	.dwattr $C$DW$120, DW_AT_const_value(0x0c)
	.dwattr $C$DW$120, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$120, DW_AT_decl_line(0x147)
	.dwattr $C$DW$120, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$152, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$152, DW_AT_decl_line(0x13a)
	.dwattr $C$DW$T$152, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$152

$C$DW$T$153	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$153, DW_AT_name("CC2640R2_LAUNCHXL_GPIOName")
	.dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$153, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$153, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$153, DW_AT_decl_column(0x03)


$C$DW$T$154	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$154, DW_AT_name("CC2640R2_LAUNCHXL_GPTimerName")
	.dwattr $C$DW$T$154, DW_AT_byte_size(0x01)
$C$DW$121	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$121, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER0A")
	.dwattr $C$DW$121, DW_AT_const_value(0x00)
	.dwattr $C$DW$121, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$121, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$121, DW_AT_decl_column(0x05)

$C$DW$122	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$122, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER0B")
	.dwattr $C$DW$122, DW_AT_const_value(0x01)
	.dwattr $C$DW$122, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$122, DW_AT_decl_line(0x150)
	.dwattr $C$DW$122, DW_AT_decl_column(0x05)

$C$DW$123	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$123, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER1A")
	.dwattr $C$DW$123, DW_AT_const_value(0x02)
	.dwattr $C$DW$123, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$123, DW_AT_decl_line(0x151)
	.dwattr $C$DW$123, DW_AT_decl_column(0x05)

$C$DW$124	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$124, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER1B")
	.dwattr $C$DW$124, DW_AT_const_value(0x03)
	.dwattr $C$DW$124, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$124, DW_AT_decl_line(0x152)
	.dwattr $C$DW$124, DW_AT_decl_column(0x05)

$C$DW$125	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$125, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER2A")
	.dwattr $C$DW$125, DW_AT_const_value(0x04)
	.dwattr $C$DW$125, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$125, DW_AT_decl_line(0x153)
	.dwattr $C$DW$125, DW_AT_decl_column(0x05)

$C$DW$126	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$126, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER2B")
	.dwattr $C$DW$126, DW_AT_const_value(0x05)
	.dwattr $C$DW$126, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$126, DW_AT_decl_line(0x154)
	.dwattr $C$DW$126, DW_AT_decl_column(0x05)

$C$DW$127	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$127, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER3A")
	.dwattr $C$DW$127, DW_AT_const_value(0x06)
	.dwattr $C$DW$127, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$127, DW_AT_decl_line(0x155)
	.dwattr $C$DW$127, DW_AT_decl_column(0x05)

$C$DW$128	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$128, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER3B")
	.dwattr $C$DW$128, DW_AT_const_value(0x07)
	.dwattr $C$DW$128, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$128, DW_AT_decl_line(0x156)
	.dwattr $C$DW$128, DW_AT_decl_column(0x05)

$C$DW$129	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$129, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMERPARTSCOUNT")
	.dwattr $C$DW$129, DW_AT_const_value(0x08)
	.dwattr $C$DW$129, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$129, DW_AT_decl_line(0x158)
	.dwattr $C$DW$129, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$154, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$154, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$T$154, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$154

$C$DW$T$155	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$155, DW_AT_name("CC2640R2_LAUNCHXL_GPTimerName")
	.dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$155, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$155, DW_AT_decl_line(0x159)
	.dwattr $C$DW$T$155, DW_AT_decl_column(0x03)


$C$DW$T$156	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$156, DW_AT_name("CC2640R2_LAUNCHXL_GPTimers")
	.dwattr $C$DW$T$156, DW_AT_byte_size(0x01)
$C$DW$130	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$130, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER0")
	.dwattr $C$DW$130, DW_AT_const_value(0x00)
	.dwattr $C$DW$130, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$130, DW_AT_decl_line(0x160)
	.dwattr $C$DW$130, DW_AT_decl_column(0x05)

$C$DW$131	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$131, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER1")
	.dwattr $C$DW$131, DW_AT_const_value(0x01)
	.dwattr $C$DW$131, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$131, DW_AT_decl_line(0x161)
	.dwattr $C$DW$131, DW_AT_decl_column(0x05)

$C$DW$132	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$132, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER2")
	.dwattr $C$DW$132, DW_AT_const_value(0x02)
	.dwattr $C$DW$132, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$132, DW_AT_decl_line(0x162)
	.dwattr $C$DW$132, DW_AT_decl_column(0x05)

$C$DW$133	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$133, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMER3")
	.dwattr $C$DW$133, DW_AT_const_value(0x03)
	.dwattr $C$DW$133, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$133, DW_AT_decl_line(0x163)
	.dwattr $C$DW$133, DW_AT_decl_column(0x05)

$C$DW$134	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$134, DW_AT_name("CC2640R2_LAUNCHXL_GPTIMERCOUNT")
	.dwattr $C$DW$134, DW_AT_const_value(0x04)
	.dwattr $C$DW$134, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$134, DW_AT_decl_line(0x165)
	.dwattr $C$DW$134, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$156, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$156, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$T$156, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$156

$C$DW$T$157	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$157, DW_AT_name("CC2640R2_LAUNCHXL_GPTimers")
	.dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$157, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$157, DW_AT_decl_line(0x166)
	.dwattr $C$DW$T$157, DW_AT_decl_column(0x03)


$C$DW$T$158	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$158, DW_AT_name("CC2640R2_LAUNCHXL_I2CName")
	.dwattr $C$DW$T$158, DW_AT_byte_size(0x01)
$C$DW$135	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$135, DW_AT_name("CC2640R2_LAUNCHXL_I2C0")
	.dwattr $C$DW$135, DW_AT_const_value(0x00)
	.dwattr $C$DW$135, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$135, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$135, DW_AT_decl_column(0x05)

$C$DW$136	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$136, DW_AT_name("CC2640R2_LAUNCHXL_I2CCOUNT")
	.dwattr $C$DW$136, DW_AT_const_value(0x01)
	.dwattr $C$DW$136, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$136, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$136, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$158, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$158, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$T$158, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$158

$C$DW$T$159	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$159, DW_AT_name("CC2640R2_LAUNCHXL_I2CName")
	.dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$159, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$159, DW_AT_decl_line(0x170)
	.dwattr $C$DW$T$159, DW_AT_decl_column(0x03)


$C$DW$T$160	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$160, DW_AT_name("CC2640R2_LAUNCHXL_I2SName")
	.dwattr $C$DW$T$160, DW_AT_byte_size(0x01)
$C$DW$137	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$137, DW_AT_name("CC2640R2_LAUNCHXL_I2S0")
	.dwattr $C$DW$137, DW_AT_const_value(0x00)
	.dwattr $C$DW$137, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$137, DW_AT_decl_line(0x177)
	.dwattr $C$DW$137, DW_AT_decl_column(0x05)

$C$DW$138	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$138, DW_AT_name("CC2640R2_LAUNCHXL_I2SCOUNT")
	.dwattr $C$DW$138, DW_AT_const_value(0x01)
	.dwattr $C$DW$138, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$138, DW_AT_decl_line(0x179)
	.dwattr $C$DW$138, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$160, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$160, DW_AT_decl_line(0x176)
	.dwattr $C$DW$T$160, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$160

$C$DW$T$161	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$161, DW_AT_name("CC2640R2_LAUNCHXL_I2SName")
	.dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$161, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$161, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$161, DW_AT_decl_column(0x03)


$C$DW$T$162	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$162, DW_AT_name("CC2640R2_LAUNCHXL_NVSName")
	.dwattr $C$DW$T$162, DW_AT_byte_size(0x01)
$C$DW$139	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$139, DW_AT_name("CC2640R2_LAUNCHXL_NVSCC26XX0")
	.dwattr $C$DW$139, DW_AT_const_value(0x00)
	.dwattr $C$DW$139, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$139, DW_AT_decl_line(0x182)
	.dwattr $C$DW$139, DW_AT_decl_column(0x05)

$C$DW$140	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$140, DW_AT_name("CC2640R2_LAUNCHXL_NVSSPI25X0")
	.dwattr $C$DW$140, DW_AT_const_value(0x01)
	.dwattr $C$DW$140, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$140, DW_AT_decl_line(0x185)
	.dwattr $C$DW$140, DW_AT_decl_column(0x05)

$C$DW$141	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$141, DW_AT_name("CC2640R2_LAUNCHXL_NVSCOUNT")
	.dwattr $C$DW$141, DW_AT_const_value(0x02)
	.dwattr $C$DW$141, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$141, DW_AT_decl_line(0x188)
	.dwattr $C$DW$141, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$162, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$162, DW_AT_decl_line(0x180)
	.dwattr $C$DW$T$162, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$162

$C$DW$T$163	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$163, DW_AT_name("CC2640R2_LAUNCHXL_NVSName")
	.dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$163, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$163, DW_AT_decl_line(0x189)
	.dwattr $C$DW$T$163, DW_AT_decl_column(0x03)


$C$DW$T$164	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$164, DW_AT_name("CC2640R2_LAUNCHXL_PWMName")
	.dwattr $C$DW$T$164, DW_AT_byte_size(0x01)
$C$DW$142	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$142, DW_AT_name("CC2640R2_LAUNCHXL_PWM0")
	.dwattr $C$DW$142, DW_AT_const_value(0x00)
	.dwattr $C$DW$142, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$142, DW_AT_decl_line(0x190)
	.dwattr $C$DW$142, DW_AT_decl_column(0x05)

$C$DW$143	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$143, DW_AT_name("CC2640R2_LAUNCHXL_PWM1")
	.dwattr $C$DW$143, DW_AT_const_value(0x01)
	.dwattr $C$DW$143, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$143, DW_AT_decl_line(0x191)
	.dwattr $C$DW$143, DW_AT_decl_column(0x05)

$C$DW$144	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$144, DW_AT_name("CC2640R2_LAUNCHXL_PWM2")
	.dwattr $C$DW$144, DW_AT_const_value(0x02)
	.dwattr $C$DW$144, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$144, DW_AT_decl_line(0x192)
	.dwattr $C$DW$144, DW_AT_decl_column(0x05)

$C$DW$145	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$145, DW_AT_name("CC2640R2_LAUNCHXL_PWM3")
	.dwattr $C$DW$145, DW_AT_const_value(0x03)
	.dwattr $C$DW$145, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$145, DW_AT_decl_line(0x193)
	.dwattr $C$DW$145, DW_AT_decl_column(0x05)

$C$DW$146	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$146, DW_AT_name("CC2640R2_LAUNCHXL_PWM4")
	.dwattr $C$DW$146, DW_AT_const_value(0x04)
	.dwattr $C$DW$146, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$146, DW_AT_decl_line(0x194)
	.dwattr $C$DW$146, DW_AT_decl_column(0x05)

$C$DW$147	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$147, DW_AT_name("CC2640R2_LAUNCHXL_PWM5")
	.dwattr $C$DW$147, DW_AT_const_value(0x05)
	.dwattr $C$DW$147, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0x195)
	.dwattr $C$DW$147, DW_AT_decl_column(0x05)

$C$DW$148	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$148, DW_AT_name("CC2640R2_LAUNCHXL_PWM6")
	.dwattr $C$DW$148, DW_AT_const_value(0x06)
	.dwattr $C$DW$148, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0x196)
	.dwattr $C$DW$148, DW_AT_decl_column(0x05)

$C$DW$149	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$149, DW_AT_name("CC2640R2_LAUNCHXL_PWM7")
	.dwattr $C$DW$149, DW_AT_const_value(0x07)
	.dwattr $C$DW$149, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0x197)
	.dwattr $C$DW$149, DW_AT_decl_column(0x05)

$C$DW$150	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$150, DW_AT_name("CC2640R2_LAUNCHXL_PWMCOUNT")
	.dwattr $C$DW$150, DW_AT_const_value(0x08)
	.dwattr $C$DW$150, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0x199)
	.dwattr $C$DW$150, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$164, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$164, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$T$164, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$164

$C$DW$T$165	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$165, DW_AT_name("CC2640R2_LAUNCHXL_PWMName")
	.dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$165, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$165, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$T$165, DW_AT_decl_column(0x03)


$C$DW$T$166	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$166, DW_AT_name("CC2640R2_LAUNCHXL_SDName")
	.dwattr $C$DW$T$166, DW_AT_byte_size(0x01)
$C$DW$151	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$151, DW_AT_name("CC2640R2_LAUNCHXL_SDSPI0")
	.dwattr $C$DW$151, DW_AT_const_value(0x00)
	.dwattr $C$DW$151, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$151, DW_AT_decl_column(0x05)

$C$DW$152	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$152, DW_AT_name("CC2640R2_LAUNCHXL_SDCOUNT")
	.dwattr $C$DW$152, DW_AT_const_value(0x01)
	.dwattr $C$DW$152, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$152, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$166, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$166, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$T$166, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$166

$C$DW$T$167	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$167, DW_AT_name("CC2640R2_LAUNCHXL_SDName")
	.dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$167, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$167, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$T$167, DW_AT_decl_column(0x03)


$C$DW$T$168	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$168, DW_AT_name("CC2640R2_LAUNCHXL_SPIName")
	.dwattr $C$DW$T$168, DW_AT_byte_size(0x01)
$C$DW$153	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$153, DW_AT_name("CC2640R2_LAUNCHXL_SPI0")
	.dwattr $C$DW$153, DW_AT_const_value(0x00)
	.dwattr $C$DW$153, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$153, DW_AT_decl_column(0x05)

$C$DW$154	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$154, DW_AT_name("CC2640R2_LAUNCHXL_SPI1")
	.dwattr $C$DW$154, DW_AT_const_value(0x01)
	.dwattr $C$DW$154, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$154, DW_AT_decl_column(0x05)

$C$DW$155	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$155, DW_AT_name("CC2640R2_LAUNCHXL_SPICOUNT")
	.dwattr $C$DW$155, DW_AT_const_value(0x02)
	.dwattr $C$DW$155, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$155, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$168, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$168, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$T$168, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$168

$C$DW$T$169	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$169, DW_AT_name("CC2640R2_LAUNCHXL_SPIName")
	.dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$169, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$169, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$T$169, DW_AT_decl_column(0x03)


$C$DW$T$170	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$170, DW_AT_name("CC2640R2_LAUNCHXL_TRNGName")
	.dwattr $C$DW$T$170, DW_AT_byte_size(0x01)
$C$DW$156	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$156, DW_AT_name("CC2640R2_LAUNCHXL_TRNG0")
	.dwattr $C$DW$156, DW_AT_const_value(0x00)
	.dwattr $C$DW$156, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x131)
	.dwattr $C$DW$156, DW_AT_decl_column(0x05)

$C$DW$157	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$157, DW_AT_name("CC2640R2_LAUNCHXL_TRNGCOUNT")
	.dwattr $C$DW$157, DW_AT_const_value(0x01)
	.dwattr $C$DW$157, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x133)
	.dwattr $C$DW$157, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$170, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$170, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$170, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$170

$C$DW$T$171	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$171, DW_AT_name("CC2640R2_LAUNCHXL_TRNGName")
	.dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$171, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0x134)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x03)


$C$DW$T$172	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$172, DW_AT_name("CC2640R2_LAUNCHXL_UARTName")
	.dwattr $C$DW$T$172, DW_AT_byte_size(0x01)
$C$DW$158	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$158, DW_AT_name("CC2640R2_LAUNCHXL_UART0")
	.dwattr $C$DW$158, DW_AT_const_value(0x00)
	.dwattr $C$DW$158, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0x1b6)
	.dwattr $C$DW$158, DW_AT_decl_column(0x05)

$C$DW$159	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$159, DW_AT_name("CC2640R2_LAUNCHXL_UARTCOUNT")
	.dwattr $C$DW$159, DW_AT_const_value(0x01)
	.dwattr $C$DW$159, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$159, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$172, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$172, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$T$172, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$172

$C$DW$T$173	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$173, DW_AT_name("CC2640R2_LAUNCHXL_UARTName")
	.dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$173, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$173, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$T$173, DW_AT_decl_column(0x03)


$C$DW$T$174	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$174, DW_AT_name("CC2640R2_LAUNCHXL_UDMAName")
	.dwattr $C$DW$T$174, DW_AT_byte_size(0x01)
$C$DW$160	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$160, DW_AT_name("CC2640R2_LAUNCHXL_UDMA0")
	.dwattr $C$DW$160, DW_AT_const_value(0x00)
	.dwattr $C$DW$160, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$160, DW_AT_decl_column(0x05)

$C$DW$161	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$161, DW_AT_name("CC2640R2_LAUNCHXL_UDMACOUNT")
	.dwattr $C$DW$161, DW_AT_const_value(0x01)
	.dwattr $C$DW$161, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$161, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$174, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$174, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$T$174, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$174

$C$DW$T$175	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$175, DW_AT_name("CC2640R2_LAUNCHXL_UDMAName")
	.dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$175, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$175, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$T$175, DW_AT_decl_column(0x03)


$C$DW$T$176	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$176, DW_AT_name("CC2640R2_LAUNCHXL_WatchdogName")
	.dwattr $C$DW$T$176, DW_AT_byte_size(0x01)
$C$DW$162	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$162, DW_AT_name("CC2640R2_LAUNCHXL_WATCHDOG0")
	.dwattr $C$DW$162, DW_AT_const_value(0x00)
	.dwattr $C$DW$162, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$162, DW_AT_decl_column(0x05)

$C$DW$163	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$163, DW_AT_name("CC2640R2_LAUNCHXL_WATCHDOGCOUNT")
	.dwattr $C$DW$163, DW_AT_const_value(0x01)
	.dwattr $C$DW$163, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$163, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$176, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$176, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$T$176, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$176

$C$DW$T$177	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$177, DW_AT_name("CC2640R2_LAUNCHXL_WatchdogName")
	.dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$177, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/CC2640R2_LAUNCHXL.h")
	.dwattr $C$DW$T$177, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$T$177, DW_AT_decl_column(0x03)


$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_name("GPTimerCC26XX_Config")
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x0c)
$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$164, DW_AT_name("object")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("object")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$164, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x198)
	.dwattr $C$DW$164, DW_AT_decl_column(0x22)

$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$165, DW_AT_name("hwAttrs")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("hwAttrs")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$165, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x199)
	.dwattr $C$DW$165, DW_AT_decl_column(0x22)

$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$166, DW_AT_name("timerPart")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("timerPart")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$166, DW_AT_decl_column(0x21)

	.dwattr $C$DW$T$79, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x196)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$79

$C$DW$T$89	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$89, DW_AT_name("GPTimerCC26XX_Config")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$89, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$89, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$89, DW_AT_decl_column(0x27)

$C$DW$T$90	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$90, DW_AT_address_class(0x20)

$C$DW$T$91	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$91, DW_AT_name("GPTimerCC26XX_Handle")
	.dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$91, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$91, DW_AT_decl_line(0x133)
	.dwattr $C$DW$T$91, DW_AT_decl_column(0x2d)


$C$DW$T$106	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$106, DW_AT_name("GPTimerCC26XX_DebugMode")
	.dwattr $C$DW$T$106, DW_AT_byte_size(0x01)
$C$DW$167	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$167, DW_AT_name("GPTimerCC26XX_DEBUG_STALL_OFF")
	.dwattr $C$DW$167, DW_AT_const_value(0x00)
	.dwattr $C$DW$167, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x104)
	.dwattr $C$DW$167, DW_AT_decl_column(0x05)

$C$DW$168	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$168, DW_AT_name("GPTimerCC26XX_DEBUG_STALL_ON")
	.dwattr $C$DW$168, DW_AT_const_value(0x01)
	.dwattr $C$DW$168, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0x105)
	.dwattr $C$DW$168, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$106, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$106, DW_AT_decl_line(0x102)
	.dwattr $C$DW$T$106, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$106

$C$DW$T$107	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$107, DW_AT_name("GPTimerCC26XX_DebugMode")
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$107, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$107, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$107, DW_AT_decl_column(0x03)


$C$DW$T$104	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$104, DW_AT_name("GPTimerCC26XX_Direction")
	.dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
$C$DW$169	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$169, DW_AT_name("GPTimerCC26XX_DIRECTION_DOWN")
	.dwattr $C$DW$169, DW_AT_const_value(0x00)
	.dwattr $C$DW$169, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$169, DW_AT_decl_column(0x05)

$C$DW$170	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$170, DW_AT_name("GPTimerCC26XX_DIRECTION_UP")
	.dwattr $C$DW$170, DW_AT_const_value(0x01)
	.dwattr $C$DW$170, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0x110)
	.dwattr $C$DW$170, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$104, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$104, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$T$104, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$104

$C$DW$T$105	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$105, DW_AT_name("GPTimerCC26XX_Direction")
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$105, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$105, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$105, DW_AT_decl_column(0x03)


$C$DW$T$178	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$178, DW_AT_name("GPTimerCC26XX_Edge")
	.dwattr $C$DW$T$178, DW_AT_byte_size(0x01)
$C$DW$171	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$171, DW_AT_name("GPTimerCC26XX_POS_EDGE")
	.dwattr $C$DW$171, DW_AT_const_value(0x00)
	.dwattr $C$DW$171, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x129)
	.dwattr $C$DW$171, DW_AT_decl_column(0x05)

$C$DW$172	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$172, DW_AT_name("GPTimerCC26XX_NEG_EDGE")
	.dwattr $C$DW$172, DW_AT_const_value(0x04)
	.dwattr $C$DW$172, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$172, DW_AT_decl_column(0x05)

$C$DW$173	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$173, DW_AT_name("GPTimerCC26XX_BOTH_EDGES")
	.dwattr $C$DW$173, DW_AT_const_value(0x0c)
	.dwattr $C$DW$173, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$173, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$178, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$178, DW_AT_decl_line(0x127)
	.dwattr $C$DW$T$178, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$178

$C$DW$T$179	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$179, DW_AT_name("GPTimerCC26XX_Edge")
	.dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$179, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$179, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$T$179, DW_AT_decl_column(0x03)


$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_name("GPTimerCC26XX_HWAttrs")
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x0c)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$174, DW_AT_name("baseAddr")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("baseAddr")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x155)
	.dwattr $C$DW$174, DW_AT_decl_column(0x0e)

$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$175, DW_AT_name("intNum")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("intNum")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x157)
	.dwattr $C$DW$175, DW_AT_decl_column(0x0e)

$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$176, DW_AT_name("intPriority")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("intPriority")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x161)
	.dwattr $C$DW$176, DW_AT_decl_column(0x1a)

$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$177, DW_AT_name("powerMngrId")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("powerMngrId")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x163)
	.dwattr $C$DW$177, DW_AT_decl_column(0x1a)

$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$178, DW_AT_name("timer")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("timer")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x165)
	.dwattr $C$DW$178, DW_AT_decl_column(0x1a)

$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$179, DW_AT_name("pinMux")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("pinMux")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x167)
	.dwattr $C$DW$179, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$82, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x152)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$82

$C$DW$T$74	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$74, DW_AT_name("GPTimerCC26XX_HWAttrs")
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$74, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x03)

$C$DW$T$75	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)

$C$DW$T$76	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$76, DW_AT_address_class(0x20)


$C$DW$T$180	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$180, DW_AT_name("GPTimerCC26XX_Interrupt")
	.dwattr $C$DW$T$180, DW_AT_byte_size(0x01)
$C$DW$180	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$180, DW_AT_name("GPT_INT_TIMEOUT")
	.dwattr $C$DW$180, DW_AT_const_value(0x01)
	.dwattr $C$DW$180, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$180, DW_AT_decl_column(0x05)

$C$DW$181	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$181, DW_AT_name("GPT_INT_CAPTURE_MATCH")
	.dwattr $C$DW$181, DW_AT_const_value(0x02)
	.dwattr $C$DW$181, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$181, DW_AT_decl_column(0x09)

$C$DW$182	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$182, DW_AT_name("GPT_INT_CAPTURE")
	.dwattr $C$DW$182, DW_AT_const_value(0x04)
	.dwattr $C$DW$182, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$182, DW_AT_decl_column(0x09)

$C$DW$183	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$183, DW_AT_name("GPT_INT_MATCH")
	.dwattr $C$DW$183, DW_AT_const_value(0x08)
	.dwattr $C$DW$183, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$183, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$180, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$180, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$T$180, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$180

$C$DW$T$181	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$181, DW_AT_name("GPTimerCC26XX_Interrupt")
	.dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$180)
	.dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$181, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$181, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$T$181, DW_AT_decl_column(0x03)


$C$DW$T$100	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$100, DW_AT_name("GPTimerCC26XX_Mode")
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x02)
$C$DW$184	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$184, DW_AT_name("GPT_MODE_ONESHOT")
	.dwattr $C$DW$184, DW_AT_const_value(0x21)
	.dwattr $C$DW$184, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$184, DW_AT_decl_column(0x05)

$C$DW$185	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$185, DW_AT_name("GPT_MODE_PERIODIC")
	.dwattr $C$DW$185, DW_AT_const_value(0x22)
	.dwattr $C$DW$185, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$185, DW_AT_decl_column(0x05)

$C$DW$186	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$186, DW_AT_name("GPT_MODE_EDGE_COUNT")
	.dwattr $C$DW$186, DW_AT_const_value(0x03)
	.dwattr $C$DW$186, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$186, DW_AT_decl_column(0x05)

$C$DW$187	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$187, DW_AT_name("GPT_MODE_EDGE_TIME")
	.dwattr $C$DW$187, DW_AT_const_value(0x07)
	.dwattr $C$DW$187, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$187, DW_AT_decl_column(0x05)

$C$DW$188	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$188, DW_AT_name("GPT_MODE_PWM")
	.dwattr $C$DW$188, DW_AT_const_value(0xa0a)
	.dwattr $C$DW$188, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$188, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$100, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$100

$C$DW$T$101	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$101, DW_AT_name("GPTimerCC26XX_Mode")
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$101, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$101, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$T$101, DW_AT_decl_column(0x03)


$C$DW$T$99	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$99, DW_AT_name("GPTimerCC26XX_Object")
	.dwattr $C$DW$T$99, DW_AT_byte_size(0x48)
$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$189, DW_AT_name("width")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$189, DW_AT_decl_column(0x1a)

$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$190, DW_AT_name("isOpen")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("isOpen")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$190, DW_AT_decl_column(0x1a)

$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$191, DW_AT_name("hwi")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("hwi")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$191, DW_AT_decl_column(0x1b)

$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$192, DW_AT_name("hwiCallbackFxn")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("hwiCallbackFxn")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$192, DW_AT_decl_column(0x1a)

$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$193, DW_AT_name("powerConstraint")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("powerConstraint")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$193, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$99, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$99, DW_AT_decl_line(0x178)
	.dwattr $C$DW$T$99, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$99

$C$DW$T$72	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$72, DW_AT_name("GPTimerCC26XX_Object")
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$72, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x03)

$C$DW$T$73	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_address_class(0x20)


$C$DW$T$108	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$108, DW_AT_name("GPTimerCC26XX_Params")
	.dwattr $C$DW$T$108, DW_AT_byte_size(0x08)
$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$194, DW_AT_name("width")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$194, DW_AT_decl_column(0x25)

$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$195, DW_AT_name("mode")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("mode")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$195, DW_AT_decl_column(0x25)

$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$196, DW_AT_name("matchTiming")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("matchTiming")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$196, DW_AT_decl_column(0x25)

$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$197, DW_AT_name("direction")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("direction")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$197, DW_AT_decl_column(0x25)

$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$198, DW_AT_name("debugStallMode")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("debugStallMode")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/timer/GPTimerCC26XX.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$198, DW_AT_decl_column(0x25)

