TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
       3                    ;* Date/Time created: Fri Apr  2 00:57:45 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
      13                            .global ledPinHandle
      14                            .common ledPinHandle,4,4
      15                    $C$DW$1 .dwtag  DW_TAG_variable

    1439                            .dwattr $C$DW$T$1240, DW_AT_decl_file("../easylink/EasyLink.h")
    1440                            .dwattr $C$DW$T$1240, DW_AT_decl_line(0xc8)
    1441                            .dwattr $C$DW$T$1240, DW_AT_decl_column(0x03)
    1442                    
    1443                    
    1444                    $C$DW$T$1241    .dwtag  DW_TAG_enumeration_type
    1445                            .dwattr $C$DW$T$1241, DW_AT_byte_size(0x01)
    1446                    $C$DW$129       .dwtag  DW_TAG_enumerator
    1447                            .dwattr $C$DW$129, DW_AT_name("EasyLink_Ctrl_AddSize")
    1448                            .dwattr $C$DW$129, DW_AT_const_value(0x00)
    1449                            .dwattr $C$DW$129, DW_AT_decl_file("../easylink/EasyLink.h")
    1450                            .dwattr $C$DW$129, DW_AT_decl_line(0xe6)
    1451                            .dwattr $C$DW$129, DW_AT_decl_column(0x05)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1452                    
    1453                    $C$DW$130       .dwtag  DW_TAG_enumerator
    1454                            .dwattr $C$DW$130, DW_AT_name("EasyLink_Ctrl_Idle_TimeOut")
    1455                            .dwattr $C$DW$130, DW_AT_const_value(0x01)
    1456                            .dwattr $C$DW$130, DW_AT_decl_file("../easylink/EasyLink.h")
    1457                            .dwattr $C$DW$130, DW_AT_decl_line(0xe9)
    1458                            .dwattr $C$DW$130, DW_AT_decl_column(0x05)
    1459                    
    1460                    $C$DW$131       .dwtag  DW_TAG_enumerator
    1461                            .dwattr $C$DW$131, DW_AT_name("EasyLink_Ctrl_MultiClient_Mode")
    1462                            .dwattr $C$DW$131, DW_AT_const_value(0x02)
    1463                            .dwattr $C$DW$131, DW_AT_decl_file("../easylink/EasyLink.h")
    1464                            .dwattr $C$DW$131, DW_AT_decl_line(0xed)
    1465                            .dwattr $C$DW$131, DW_AT_decl_column(0x05)
    1466                    
    1467                    $C$DW$132       .dwtag  DW_TAG_enumerator
    1468                            .dwattr $C$DW$132, DW_AT_name("EasyLink_Ctrl_AsyncRx_TimeOut")
    1469                            .dwattr $C$DW$132, DW_AT_const_value(0x03)
    1470                            .dwattr $C$DW$132, DW_AT_decl_file("../easylink/EasyLink.h")
    1471                            .dwattr $C$DW$132, DW_AT_decl_line(0xf2)
    1472                            .dwattr $C$DW$132, DW_AT_decl_column(0x05)
    1473                    
    1474                    $C$DW$133       .dwtag  DW_TAG_enumerator
    1475                            .dwattr $C$DW$133, DW_AT_name("EasyLink_Ctrl_Test_Tone")
    1476                            .dwattr $C$DW$133, DW_AT_const_value(0x04)
    1477                            .dwattr $C$DW$133, DW_AT_decl_file("../easylink/EasyLink.h")
    1478                            .dwattr $C$DW$133, DW_AT_decl_line(0xf6)
    1479                            .dwattr $C$DW$133, DW_AT_decl_column(0x05)
    1480                    
    1481                    $C$DW$134       .dwtag  DW_TAG_enumerator
    1482                            .dwattr $C$DW$134, DW_AT_name("EasyLink_Ctrl_Test_Signal")
    1483                            .dwattr $C$DW$134, DW_AT_const_value(0x05)
    1484                            .dwattr $C$DW$134, DW_AT_decl_file("../easylink/EasyLink.h")
    1485                            .dwattr $C$DW$134, DW_AT_decl_line(0xf7)
    1486                            .dwattr $C$DW$134, DW_AT_decl_column(0x05)
    1487                    
    1488                    $C$DW$135       .dwtag  DW_TAG_enumerator
    1489                            .dwattr $C$DW$135, DW_AT_name("EasyLink_Ctrl_Rx_Test_Tone")
    1490                            .dwattr $C$DW$135, DW_AT_const_value(0x06)
    1491                            .dwattr $C$DW$135, DW_AT_decl_file("../easylink/EasyLink.h")
    1492                            .dwattr $C$DW$135, DW_AT_decl_line(0xf8)
    1493                            .dwattr $C$DW$135, DW_AT_decl_column(0x05)
    1494                    
    1495                            .dwattr $C$DW$T$1241, DW_AT_decl_file("../easylink/EasyLink.h")
    1496                            .dwattr $C$DW$T$1241, DW_AT_decl_line(0xe5)
    1497                            .dwattr $C$DW$T$1241, DW_AT_decl_column(0x01)
    1498                            .dwendtag $C$DW$T$1241
    1499                    
    1500                    $C$DW$T$1242    .dwtag  DW_TAG_typedef
    1501                            .dwattr $C$DW$T$1242, DW_AT_name("EasyLink_CtrlOption")
    1502                            .dwattr $C$DW$T$1242, DW_AT_type(*$C$DW$T$1241)
    1503                            .dwattr $C$DW$T$1242, DW_AT_language(DW_LANG_C)
    1504                            .dwattr $C$DW$T$1242, DW_AT_decl_file("../easylink/EasyLink.h")
    1505                            .dwattr $C$DW$T$1242, DW_AT_decl_line(0xf9)
    1506                            .dwattr $C$DW$T$1242, DW_AT_decl_column(0x03)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1507                    
    1508                    
    1509                    $C$DW$T$120     .dwtag  DW_TAG_structure_type
    1510                            .dwattr $C$DW$T$120, DW_AT_byte_size(0x10)
    1511                    $C$DW$136       .dwtag  DW_TAG_member
    1512                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$14)
    1513                            .dwattr $C$DW$136, DW_AT_name("__max_align1")
    1514                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("__max_align1")
    1515                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1517                            .dwattr $C$DW$136, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
    1518                            .dwattr $C$DW$136, DW_AT_decl_line(0x7b)
    1519                            .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
    1520                    
    1521                    $C$DW$137       .dwtag  DW_TAG_member
    1522                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$18)
    1523                            .dwattr $C$DW$137, DW_AT_name("__max_align2")
    1524                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("__max_align2")
    1525                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1526                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1527                            .dwattr $C$DW$137, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
    1528                            .dwattr $C$DW$137, DW_AT_decl_line(0x7c)
    1529                            .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    1530                    
    1531                            .dwattr $C$DW$T$120, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-a
    1532                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x7a)
    1533                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x10)
    1534                            .dwendtag $C$DW$T$120
    1535                    
    1536                    $C$DW$T$1243    .dwtag  DW_TAG_typedef
    1537                            .dwattr $C$DW$T$1243, DW_AT_name("__max_align_t")
    1538                            .dwattr $C$DW$T$1243, DW_AT_type(*$C$DW$T$120)
    1539                            .dwattr $C$DW$T$1243, DW_AT_language(DW_LANG_C)
    1540                            .dwattr $C$DW$T$1243, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-
    1541                            .dwattr $C$DW$T$1243, DW_AT_decl_line(0x7d)
    1542                            .dwattr $C$DW$T$1243, DW_AT_decl_column(0x03)
    1543                    
    1544                    
    1545                    $C$DW$T$123     .dwtag  DW_TAG_structure_type
    1546                            .dwattr $C$DW$T$123, DW_AT_byte_size(0x08)
    1547                    $C$DW$138       .dwtag  DW_TAG_member
    1548                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$10)
    1549                            .dwattr $C$DW$138, DW_AT_name("length")
    1550                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("length")
    1551                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1553                            .dwattr $C$DW$138, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
    1554                            .dwattr $C$DW$138, DW_AT_decl_line(0x165)
    1555                            .dwattr $C$DW$138, DW_AT_decl_column(0x16)
    1556                    
    1557                    $C$DW$139       .dwtag  DW_TAG_member
    1558                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$122)
    1559                            .dwattr $C$DW$139, DW_AT_name("elem")
    1560                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("elem")
    1561                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1562                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1563                            .dwattr $C$DW$139, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
    1564                            .dwattr $C$DW$139, DW_AT_decl_line(0x165)
    1565                            .dwattr $C$DW$139, DW_AT_decl_column(0x3a)
    1566                    
    1567                            .dwattr $C$DW$T$123, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
    1568                            .dwattr $C$DW$T$123, DW_AT_decl_line(0x165)
    1569                            .dwattr $C$DW$T$123, DW_AT_decl_column(0x10)
    1570                            .dwendtag $C$DW$T$123
    1571                    
    1572                    $C$DW$T$1244    .dwtag  DW_TAG_typedef
    1573                            .dwattr $C$DW$T$1244, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
    1574                            .dwattr $C$DW$T$1244, DW_AT_type(*$C$DW$T$123)
    1575                            .dwattr $C$DW$T$1244, DW_AT_language(DW_LANG_C)
    1576                            .dwattr $C$DW$T$1244, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirt
    1577                            .dwattr $C$DW$T$1244, DW_AT_decl_line(0x165)
    1578                            .dwattr $C$DW$T$1244, DW_AT_decl_column(0x42)
    1579                    
    1580                    
    1581                    $C$DW$T$126     .dwtag  DW_TAG_structure_type
    1582                            .dwattr $C$DW$T$126, DW_AT_byte_size(0x08)
    1583                    $C$DW$140       .dwtag  DW_TAG_member
    1584                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$10)
    1585                            .dwattr $C$DW$140, DW_AT_name("length")
    1586                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("length")
    1587                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1588                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1589                            .dwattr $C$DW$140, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
    1590                            .dwattr $C$DW$140, DW_AT_decl_line(0x166)
    1591                            .dwattr $C$DW$140, DW_AT_decl_column(0x16)
    1592                    
    1593                    $C$DW$141       .dwtag  DW_TAG_member
    1594                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$125)
    1595                            .dwattr $C$DW$141, DW_AT_name("elem")
    1596                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("elem")
    1597                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1598                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1599                            .dwattr $C$DW$141, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
    1600                            .dwattr $C$DW$141, DW_AT_decl_line(0x166)
    1601                            .dwattr $C$DW$141, DW_AT_decl_column(0x40)
    1602                    
    1603                            .dwattr $C$DW$T$126, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
    1604                            .dwattr $C$DW$T$126, DW_AT_decl_line(0x166)
    1605                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x10)
    1606                            .dwendtag $C$DW$T$126
    1607                    
    1608                    $C$DW$T$1245    .dwtag  DW_TAG_typedef
    1609                            .dwattr $C$DW$T$1245, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
    1610                            .dwattr $C$DW$T$1245, DW_AT_type(*$C$DW$T$126)
    1611                            .dwattr $C$DW$T$1245, DW_AT_language(DW_LANG_C)
    1612                            .dwattr $C$DW$T$1245, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirt
    1613                            .dwattr $C$DW$T$1245, DW_AT_decl_line(0x166)
    1614                            .dwattr $C$DW$T$1245, DW_AT_decl_column(0x48)
    1615                    
    1616                    $C$DW$T$1246    .dwtag  DW_TAG_typedef
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1617                            .dwattr $C$DW$T$1246, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    1618                            .dwattr $C$DW$T$1246, DW_AT_type(*$C$DW$T$1245)
    1619                            .dwattr $C$DW$T$1246, DW_AT_language(DW_LANG_C)
    1620                            .dwattr $C$DW$T$1246, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirt
    1621                            .dwattr $C$DW$T$1246, DW_AT_decl_line(0x168)
    1622                            .dwattr $C$DW$T$1246, DW_AT_decl_column(0x2a)
    1623                    
    1624                    $C$DW$T$1247    .dwtag  DW_TAG_typedef
    1625                            .dwattr $C$DW$T$1247, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    1626                            .dwattr $C$DW$T$1247, DW_AT_type(*$C$DW$T$1245)
    1627                            .dwattr $C$DW$T$1247, DW_AT_language(DW_LANG_C)
    1628                            .dwattr $C$DW$T$1247, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirt
    1629                            .dwattr $C$DW$T$1247, DW_AT_decl_line(0x167)
    1630                            .dwattr $C$DW$T$1247, DW_AT_decl_column(0x2a)
    1631                    
    1632                    
    1633                    $C$DW$T$129     .dwtag  DW_TAG_structure_type
    1634                            .dwattr $C$DW$T$129, DW_AT_byte_size(0x08)
    1635                    $C$DW$142       .dwtag  DW_TAG_member
    1636                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$10)
    1637                            .dwattr $C$DW$142, DW_AT_name("length")
    1638                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("length")
    1639                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1640                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1641                            .dwattr $C$DW$142, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
    1642                            .dwattr $C$DW$142, DW_AT_decl_line(0x29b)
    1643                            .dwattr $C$DW$142, DW_AT_decl_column(0x16)
    1644                    
    1645                    $C$DW$143       .dwtag  DW_TAG_member
    1646                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$128)
    1647                            .dwattr $C$DW$143, DW_AT_name("elem")
    1648                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("elem")
    1649                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1650                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1651                            .dwattr $C$DW$143, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
    1652                            .dwattr $C$DW$143, DW_AT_decl_line(0x29b)
    1653                            .dwattr $C$DW$143, DW_AT_decl_column(0x3b)
    1654                    
    1655                            .dwattr $C$DW$T$129, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
    1656                            .dwattr $C$DW$T$129, DW_AT_decl_line(0x29b)
    1657                            .dwattr $C$DW$T$129, DW_AT_decl_column(0x10)
    1658                            .dwendtag $C$DW$T$129
    1659                    
    1660                    $C$DW$T$1248    .dwtag  DW_TAG_typedef
    1661                            .dwattr $C$DW$T$1248, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
    1662                            .dwattr $C$DW$T$1248, DW_AT_type(*$C$DW$T$129)
    1663                            .dwattr $C$DW$T$1248, DW_AT_language(DW_LANG_C)
    1664                            .dwattr $C$DW$T$1248, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirt
    1665                            .dwattr $C$DW$T$1248, DW_AT_decl_line(0x29b)
    1666                            .dwattr $C$DW$T$1248, DW_AT_decl_column(0x43)
    1667                    
    1668                    
    1669                    $C$DW$T$132     .dwtag  DW_TAG_structure_type
    1670                            .dwattr $C$DW$T$132, DW_AT_byte_size(0x08)
    1671                    $C$DW$144       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1672                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$10)
    1673                            .dwattr $C$DW$144, DW_AT_name("length")
    1674                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("length")
    1675                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1676                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1677                            .dwattr $C$DW$144, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
    1678                            .dwattr $C$DW$144, DW_AT_decl_line(0x29c)
    1679                            .dwattr $C$DW$144, DW_AT_decl_column(0x16)
    1680                    
    1681                    $C$DW$145       .dwtag  DW_TAG_member
    1682                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$131)
    1683                            .dwattr $C$DW$145, DW_AT_name("elem")
    1684                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("elem")
    1685                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1686                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1687                            .dwattr $C$DW$145, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
    1688                            .dwattr $C$DW$145, DW_AT_decl_line(0x29c)
    1689                            .dwattr $C$DW$145, DW_AT_decl_column(0x41)
    1690                    
    1691                            .dwattr $C$DW$T$132, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
    1692                            .dwattr $C$DW$T$132, DW_AT_decl_line(0x29c)
    1693                            .dwattr $C$DW$T$132, DW_AT_decl_column(0x10)
    1694                            .dwendtag $C$DW$T$132
    1695                    
    1696                    $C$DW$T$1249    .dwtag  DW_TAG_typedef
    1697                            .dwattr $C$DW$T$1249, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
    1698                            .dwattr $C$DW$T$1249, DW_AT_type(*$C$DW$T$132)
    1699                            .dwattr $C$DW$T$1249, DW_AT_language(DW_LANG_C)
    1700                            .dwattr $C$DW$T$1249, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirt
    1701                            .dwattr $C$DW$T$1249, DW_AT_decl_line(0x29c)
    1702                            .dwattr $C$DW$T$1249, DW_AT_decl_column(0x49)
    1703                    
    1704                    $C$DW$T$1250    .dwtag  DW_TAG_typedef
    1705                            .dwattr $C$DW$T$1250, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    1706                            .dwattr $C$DW$T$1250, DW_AT_type(*$C$DW$T$1249)
    1707                            .dwattr $C$DW$T$1250, DW_AT_language(DW_LANG_C)
    1708                            .dwattr $C$DW$T$1250, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirt
    1709                            .dwattr $C$DW$T$1250, DW_AT_decl_line(0x29e)
    1710                            .dwattr $C$DW$T$1250, DW_AT_decl_column(0x2b)
    1711                    
    1712                    $C$DW$T$1251    .dwtag  DW_TAG_typedef
    1713                            .dwattr $C$DW$T$1251, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    1714                            .dwattr $C$DW$T$1251, DW_AT_type(*$C$DW$T$1249)
    1715                            .dwattr $C$DW$T$1251, DW_AT_language(DW_LANG_C)
    1716                            .dwattr $C$DW$T$1251, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirt
    1717                            .dwattr $C$DW$T$1251, DW_AT_decl_line(0x29d)
    1718                            .dwattr $C$DW$T$1251, DW_AT_decl_column(0x2b)
    1719                    
    1720                    
    1721                    $C$DW$T$145     .dwtag  DW_TAG_structure_type
    1722                            .dwattr $C$DW$T$145, DW_AT_byte_size(0x14)
    1723                    $C$DW$146       .dwtag  DW_TAG_member
    1724                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$133)
    1725                            .dwattr $C$DW$146, DW_AT_name("link")
    1726                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("link")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1727                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1729                            .dwattr $C$DW$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    1730                            .dwattr $C$DW$146, DW_AT_decl_line(0x1bc)
    1731                            .dwattr $C$DW$146, DW_AT_decl_column(0x0f)
    1732                    
    1733                    $C$DW$147       .dwtag  DW_TAG_member
    1734                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$136)
    1735                            .dwattr $C$DW$147, DW_AT_name("eventTypes")
    1736                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("eventTypes")
    1737                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1738                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1739                            .dwattr $C$DW$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    1740                            .dwattr $C$DW$147, DW_AT_decl_line(0x1bd)
    1741                            .dwattr $C$DW$147, DW_AT_decl_column(0x13)
    1742                    
    1743                    $C$DW$148       .dwtag  DW_TAG_member
    1744                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$144)
    1745                            .dwattr $C$DW$148, DW_AT_name("notifyFxn")
    1746                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("notifyFxn")
    1747                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1748                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1749                            .dwattr $C$DW$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    1750                            .dwattr $C$DW$148, DW_AT_decl_line(0x1be)
    1751                            .dwattr $C$DW$148, DW_AT_decl_column(0x15)
    1752                    
    1753                    $C$DW$149       .dwtag  DW_TAG_member
    1754                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$141)
    1755                            .dwattr $C$DW$149, DW_AT_name("clientArg")
    1756                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("clientArg")
    1757                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1758                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1759                            .dwattr $C$DW$149, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    1760                            .dwattr $C$DW$149, DW_AT_decl_line(0x1bf)
    1761                            .dwattr $C$DW$149, DW_AT_decl_column(0x0f)
    1762                    
    1763                            .dwattr $C$DW$T$145, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    1764                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x1bb)
    1765                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
    1766                            .dwendtag $C$DW$T$145
    1767                    
    1768                    $C$DW$T$1252    .dwtag  DW_TAG_typedef
    1769                            .dwattr $C$DW$T$1252, DW_AT_name("Power_NotifyObj")
    1770                            .dwattr $C$DW$T$1252, DW_AT_type(*$C$DW$T$145)
    1771                            .dwattr $C$DW$T$1252, DW_AT_language(DW_LANG_C)
    1772                            .dwattr $C$DW$T$1252, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/d
    1773                            .dwattr $C$DW$T$1252, DW_AT_decl_line(0x1c0)
    1774                            .dwattr $C$DW$T$1252, DW_AT_decl_column(0x03)
    1775                    
    1776                    
    1777                    $C$DW$T$189     .dwtag  DW_TAG_structure_type
    1778                            .dwattr $C$DW$T$189, DW_AT_byte_size(0x4c)
    1779                    $C$DW$150       .dwtag  DW_TAG_member
    1780                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$152)
    1781                            .dwattr $C$DW$150, DW_AT_name("Crc32")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   34

    1782                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("Crc32")
    1783                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1784                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1785                            .dwattr $C$DW$150, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1786                            .dwattr $C$DW$150, DW_AT_decl_line(0x76)
    1787                            .dwattr $C$DW$150, DW_AT_decl_column(0x25)
    1788                    
    1789                    $C$DW$151       .dwtag  DW_TAG_member
    1790                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$155)
    1791                            .dwattr $C$DW$151, DW_AT_name("FlashGetSize")
    1792                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("FlashGetSize")
    1793                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1794                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1795                            .dwattr $C$DW$151, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1796                            .dwattr $C$DW$151, DW_AT_decl_line(0x77)
    1797                            .dwattr $C$DW$151, DW_AT_decl_column(0x25)
    1798                    
    1799                    $C$DW$152       .dwtag  DW_TAG_member
    1800                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$156)
    1801                            .dwattr $C$DW$152, DW_AT_name("GetChipId")
    1802                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("GetChipId")
    1803                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1804                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1805                            .dwattr $C$DW$152, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1806                            .dwattr $C$DW$152, DW_AT_decl_line(0x78)
    1807                            .dwattr $C$DW$152, DW_AT_decl_column(0x25)
    1808                    
    1809                    $C$DW$153       .dwtag  DW_TAG_member
    1810                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$159)
    1811                            .dwattr $C$DW$153, DW_AT_name("ReservedLocation1")
    1812                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("ReservedLocation1")
    1813                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1814                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1815                            .dwattr $C$DW$153, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1816                            .dwattr $C$DW$153, DW_AT_decl_line(0x79)
    1817                            .dwattr $C$DW$153, DW_AT_decl_column(0x25)
    1818                    
    1819                    $C$DW$154       .dwtag  DW_TAG_member
    1820                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$160)
    1821                            .dwattr $C$DW$154, DW_AT_name("ReservedLocation2")
    1822                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("ReservedLocation2")
    1823                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1824                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1825                            .dwattr $C$DW$154, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1826                            .dwattr $C$DW$154, DW_AT_decl_line(0x7a)
    1827                            .dwattr $C$DW$154, DW_AT_decl_column(0x25)
    1828                    
    1829                    $C$DW$155       .dwtag  DW_TAG_member
    1830                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$161)
    1831                            .dwattr $C$DW$155, DW_AT_name("ReservedLocation3")
    1832                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("ReservedLocation3")
    1833                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1834                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1835                            .dwattr $C$DW$155, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1836                            .dwattr $C$DW$155, DW_AT_decl_line(0x7b)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   35

    1837                            .dwattr $C$DW$155, DW_AT_decl_column(0x25)
    1838                    
    1839                    $C$DW$156       .dwtag  DW_TAG_member
    1840                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$164)
    1841                            .dwattr $C$DW$156, DW_AT_name("ResetDevice")
    1842                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("ResetDevice")
    1843                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1844                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1845                            .dwattr $C$DW$156, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1846                            .dwattr $C$DW$156, DW_AT_decl_line(0x7c)
    1847                            .dwattr $C$DW$156, DW_AT_decl_column(0x25)
    1848                    
    1849                    $C$DW$157       .dwtag  DW_TAG_member
    1850                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$170)
    1851                            .dwattr $C$DW$157, DW_AT_name("Fletcher32")
    1852                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("Fletcher32")
    1853                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1854                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1855                            .dwattr $C$DW$157, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1856                            .dwattr $C$DW$157, DW_AT_decl_line(0x7d)
    1857                            .dwattr $C$DW$157, DW_AT_decl_column(0x25)
    1858                    
    1859                    $C$DW$158       .dwtag  DW_TAG_member
    1860                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$174)
    1861                            .dwattr $C$DW$158, DW_AT_name("MinValue")
    1862                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("MinValue")
    1863                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1864                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1865                            .dwattr $C$DW$158, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1866                            .dwattr $C$DW$158, DW_AT_decl_line(0x7e)
    1867                            .dwattr $C$DW$158, DW_AT_decl_column(0x25)
    1868                    
    1869                    $C$DW$159       .dwtag  DW_TAG_member
    1870                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$175)
    1871                            .dwattr $C$DW$159, DW_AT_name("MaxValue")
    1872                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("MaxValue")
    1873                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1874                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1875                            .dwattr $C$DW$159, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1876                            .dwattr $C$DW$159, DW_AT_decl_line(0x7f)
    1877                            .dwattr $C$DW$159, DW_AT_decl_column(0x25)
    1878                    
    1879                    $C$DW$160       .dwtag  DW_TAG_member
    1880                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$176)
    1881                            .dwattr $C$DW$160, DW_AT_name("MeanValue")
    1882                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("MeanValue")
    1883                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1884                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1885                            .dwattr $C$DW$160, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1886                            .dwattr $C$DW$160, DW_AT_decl_line(0x80)
    1887                            .dwattr $C$DW$160, DW_AT_decl_column(0x25)
    1888                    
    1889                    $C$DW$161       .dwtag  DW_TAG_member
    1890                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$177)
    1891                            .dwattr $C$DW$161, DW_AT_name("StandDeviationValue")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   36

    1892                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("StandDeviationValue")
    1893                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1894                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1895                            .dwattr $C$DW$161, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1896                            .dwattr $C$DW$161, DW_AT_decl_line(0x81)
    1897                            .dwattr $C$DW$161, DW_AT_decl_column(0x25)
    1898                    
    1899                    $C$DW$162       .dwtag  DW_TAG_member
    1900                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$180)
    1901                            .dwattr $C$DW$162, DW_AT_name("ReservedLocation4")
    1902                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("ReservedLocation4")
    1903                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1904                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1905                            .dwattr $C$DW$162, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1906                            .dwattr $C$DW$162, DW_AT_decl_line(0x82)
    1907                            .dwattr $C$DW$162, DW_AT_decl_column(0x25)
    1908                    
    1909                    $C$DW$163       .dwtag  DW_TAG_member
    1910                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$181)
    1911                            .dwattr $C$DW$163, DW_AT_name("ReservedLocation5")
    1912                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("ReservedLocation5")
    1913                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1914                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1915                            .dwattr $C$DW$163, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1916                            .dwattr $C$DW$163, DW_AT_decl_line(0x83)
    1917                            .dwattr $C$DW$163, DW_AT_decl_column(0x25)
    1918                    
    1919                    $C$DW$164       .dwtag  DW_TAG_member
    1920                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$182)
    1921                            .dwattr $C$DW$164, DW_AT_name("HFSourceSafeSwitch")
    1922                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1923                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1924                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1925                            .dwattr $C$DW$164, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1926                            .dwattr $C$DW$164, DW_AT_decl_line(0x84)
    1927                            .dwattr $C$DW$164, DW_AT_decl_column(0x25)
    1928                    
    1929                    $C$DW$165       .dwtag  DW_TAG_member
    1930                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$185)
    1931                            .dwattr $C$DW$165, DW_AT_name("SelectCompAInput")
    1932                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("SelectCompAInput")
    1933                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1934                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1935                            .dwattr $C$DW$165, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1936                            .dwattr $C$DW$165, DW_AT_decl_line(0x85)
    1937                            .dwattr $C$DW$165, DW_AT_decl_column(0x25)
    1938                    
    1939                    $C$DW$166       .dwtag  DW_TAG_member
    1940                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$186)
    1941                            .dwattr $C$DW$166, DW_AT_name("SelectCompARef")
    1942                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("SelectCompARef")
    1943                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1944                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1945                            .dwattr $C$DW$166, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1946                            .dwattr $C$DW$166, DW_AT_decl_line(0x86)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   37

    1947                            .dwattr $C$DW$166, DW_AT_decl_column(0x25)
    1948                    
    1949                    $C$DW$167       .dwtag  DW_TAG_member
    1950                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$187)
    1951                            .dwattr $C$DW$167, DW_AT_name("SelectADCCompBInput")
    1952                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1953                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1954                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1955                            .dwattr $C$DW$167, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1956                            .dwattr $C$DW$167, DW_AT_decl_line(0x87)
    1957                            .dwattr $C$DW$167, DW_AT_decl_column(0x25)
    1958                    
    1959                    $C$DW$168       .dwtag  DW_TAG_member
    1960                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$188)
    1961                            .dwattr $C$DW$168, DW_AT_name("SelectCompBRef")
    1962                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("SelectCompBRef")
    1963                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1964                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1965                            .dwattr $C$DW$168, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1966                            .dwattr $C$DW$168, DW_AT_decl_line(0x88)
    1967                            .dwattr $C$DW$168, DW_AT_decl_column(0x25)
    1968                    
    1969                            .dwattr $C$DW$T$189, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    1970                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x75)
    1971                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x01)
    1972                            .dwendtag $C$DW$T$189
    1973                    
    1974                    $C$DW$T$1253    .dwtag  DW_TAG_typedef
    1975                            .dwattr $C$DW$T$1253, DW_AT_name("HARD_API_T")
    1976                            .dwattr $C$DW$T$1253, DW_AT_type(*$C$DW$T$189)
    1977                            .dwattr $C$DW$T$1253, DW_AT_language(DW_LANG_C)
    1978                            .dwattr $C$DW$T$1253, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/d
    1979                            .dwattr $C$DW$T$1253, DW_AT_decl_line(0x89)
    1980                            .dwattr $C$DW$T$1253, DW_AT_decl_column(0x03)
    1981                    
    1982                    
    1983                    $C$DW$T$190     .dwtag  DW_TAG_structure_type
    1984                            .dwattr $C$DW$T$190, DW_AT_byte_size(0x08)
    1985                    $C$DW$169       .dwtag  DW_TAG_member
    1986                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$149)
    1987                            .dwattr $C$DW$169, DW_AT_name("pCurrEntry")
    1988                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("pCurrEntry")
    1989                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1990                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1991                            .dwattr $C$DW$169, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1992                            .dwattr $C$DW$169, DW_AT_decl_line(0x3f)
    1993                            .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    1994                    
    1995                    $C$DW$170       .dwtag  DW_TAG_member
    1996                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$149)
    1997                            .dwattr $C$DW$170, DW_AT_name("pLastEntry")
    1998                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("pLastEntry")
    1999                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2000                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2001                            .dwattr $C$DW$170, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   38

    2002                            .dwattr $C$DW$170, DW_AT_decl_line(0x40)
    2003                            .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    2004                    
    2005                            .dwattr $C$DW$T$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2006                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x3e)
    2007                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x10)
    2008                            .dwendtag $C$DW$T$190
    2009                    
    2010                    $C$DW$T$704     .dwtag  DW_TAG_typedef
    2011                            .dwattr $C$DW$T$704, DW_AT_name("dataQueue_t")
    2012                            .dwattr $C$DW$T$704, DW_AT_type(*$C$DW$T$190)
    2013                            .dwattr $C$DW$T$704, DW_AT_language(DW_LANG_C)
    2014                            .dwattr $C$DW$T$704, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2015                            .dwattr $C$DW$T$704, DW_AT_decl_line(0x41)
    2016                            .dwattr $C$DW$T$704, DW_AT_decl_column(0x03)
    2017                    
    2018                    $C$DW$T$705     .dwtag  DW_TAG_pointer_type
    2019                            .dwattr $C$DW$T$705, DW_AT_type(*$C$DW$T$704)
    2020                            .dwattr $C$DW$T$705, DW_AT_address_class(0x20)
    2021                    
    2022                    
    2023                    $C$DW$T$191     .dwtag  DW_TAG_structure_type
    2024                            .dwattr $C$DW$T$191, DW_AT_byte_size(0x01)
    2025                    $C$DW$171       .dwtag  DW_TAG_member
    2026                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$148)
    2027                            .dwattr $C$DW$171, DW_AT_name("triggerType")
    2028                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("triggerType")
    2029                            .dwattr $C$DW$171, DW_AT_bit_offset(0x04)
    2030                            .dwattr $C$DW$171, DW_AT_bit_size(0x04)
    2031                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2033                            .dwattr $C$DW$171, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2034                            .dwattr $C$DW$171, DW_AT_decl_line(0x7e)
    2035                            .dwattr $C$DW$171, DW_AT_decl_column(0x0f)
    2036                    
    2037                    $C$DW$172       .dwtag  DW_TAG_member
    2038                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$148)
    2039                            .dwattr $C$DW$172, DW_AT_name("bEnaCmd")
    2040                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("bEnaCmd")
    2041                            .dwattr $C$DW$172, DW_AT_bit_offset(0x03)
    2042                            .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2043                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2044                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2045                            .dwattr $C$DW$172, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2046                            .dwattr $C$DW$172, DW_AT_decl_line(0x7f)
    2047                            .dwattr $C$DW$172, DW_AT_decl_column(0x0f)
    2048                    
    2049                    $C$DW$173       .dwtag  DW_TAG_member
    2050                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$148)
    2051                            .dwattr $C$DW$173, DW_AT_name("triggerNo")
    2052                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("triggerNo")
    2053                            .dwattr $C$DW$173, DW_AT_bit_offset(0x01)
    2054                            .dwattr $C$DW$173, DW_AT_bit_size(0x02)
    2055                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2056                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   39

    2057                            .dwattr $C$DW$173, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2058                            .dwattr $C$DW$173, DW_AT_decl_line(0x81)
    2059                            .dwattr $C$DW$173, DW_AT_decl_column(0x0f)
    2060                    
    2061                    $C$DW$174       .dwtag  DW_TAG_member
    2062                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$148)
    2063                            .dwattr $C$DW$174, DW_AT_name("pastTrig")
    2064                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("pastTrig")
    2065                            .dwattr $C$DW$174, DW_AT_bit_offset(0x00)
    2066                            .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2067                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2068                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2069                            .dwattr $C$DW$174, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2070                            .dwattr $C$DW$174, DW_AT_decl_line(0x82)
    2071                            .dwattr $C$DW$174, DW_AT_decl_column(0x0f)
    2072                    
    2073                            .dwattr $C$DW$T$191, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2074                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x7d)
    2075                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x0b)
    2076                            .dwendtag $C$DW$T$191
    2077                    
    2078                    
    2079                    $C$DW$T$192     .dwtag  DW_TAG_structure_type
    2080                            .dwattr $C$DW$T$192, DW_AT_byte_size(0x01)
    2081                    $C$DW$175       .dwtag  DW_TAG_member
    2082                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$148)
    2083                            .dwattr $C$DW$175, DW_AT_name("rule")
    2084                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("rule")
    2085                            .dwattr $C$DW$175, DW_AT_bit_offset(0x04)
    2086                            .dwattr $C$DW$175, DW_AT_bit_size(0x04)
    2087                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2088                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2089                            .dwattr $C$DW$175, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2090                            .dwattr $C$DW$175, DW_AT_decl_line(0x86)
    2091                            .dwattr $C$DW$175, DW_AT_decl_column(0x0f)
    2092                    
    2093                    $C$DW$176       .dwtag  DW_TAG_member
    2094                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$148)
    2095                            .dwattr $C$DW$176, DW_AT_name("nSkip")
    2096                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("nSkip")
    2097                            .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2098                            .dwattr $C$DW$176, DW_AT_bit_size(0x04)
    2099                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwattr $C$DW$176, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2102                            .dwattr $C$DW$176, DW_AT_decl_line(0x87)
    2103                            .dwattr $C$DW$176, DW_AT_decl_column(0x0f)
    2104                    
    2105                            .dwattr $C$DW$T$192, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2106                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x85)
    2107                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x0b)
    2108                            .dwendtag $C$DW$T$192
    2109                    
    2110                    
    2111                    $C$DW$T$193     .dwtag  DW_TAG_structure_type
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   40

    2112                            .dwattr $C$DW$T$193, DW_AT_byte_size(0x01)
    2113                    $C$DW$177       .dwtag  DW_TAG_member
    2114                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$148)
    2115                            .dwattr $C$DW$177, DW_AT_name("triggerType")
    2116                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("triggerType")
    2117                            .dwattr $C$DW$177, DW_AT_bit_offset(0x04)
    2118                            .dwattr $C$DW$177, DW_AT_bit_size(0x04)
    2119                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2120                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2121                            .dwattr $C$DW$177, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2122                            .dwattr $C$DW$177, DW_AT_decl_line(0x99)
    2123                            .dwattr $C$DW$177, DW_AT_decl_column(0x0f)
    2124                    
    2125                    $C$DW$178       .dwtag  DW_TAG_member
    2126                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$148)
    2127                            .dwattr $C$DW$178, DW_AT_name("bEnaCmd")
    2128                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("bEnaCmd")
    2129                            .dwattr $C$DW$178, DW_AT_bit_offset(0x03)
    2130                            .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2131                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2133                            .dwattr $C$DW$178, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2134                            .dwattr $C$DW$178, DW_AT_decl_line(0x9a)
    2135                            .dwattr $C$DW$178, DW_AT_decl_column(0x0f)
    2136                    
    2137                    $C$DW$179       .dwtag  DW_TAG_member
    2138                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$148)
    2139                            .dwattr $C$DW$179, DW_AT_name("triggerNo")
    2140                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("triggerNo")
    2141                            .dwattr $C$DW$179, DW_AT_bit_offset(0x01)
    2142                            .dwattr $C$DW$179, DW_AT_bit_size(0x02)
    2143                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2145                            .dwattr $C$DW$179, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2146                            .dwattr $C$DW$179, DW_AT_decl_line(0x9c)
    2147                            .dwattr $C$DW$179, DW_AT_decl_column(0x0f)
    2148                    
    2149                    $C$DW$180       .dwtag  DW_TAG_member
    2150                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$148)
    2151                            .dwattr $C$DW$180, DW_AT_name("pastTrig")
    2152                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("pastTrig")
    2153                            .dwattr $C$DW$180, DW_AT_bit_offset(0x00)
    2154                            .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2155                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2156                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2157                            .dwattr $C$DW$180, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2158                            .dwattr $C$DW$180, DW_AT_decl_line(0x9d)
    2159                            .dwattr $C$DW$180, DW_AT_decl_column(0x0f)
    2160                    
    2161                            .dwattr $C$DW$T$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2162                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x98)
    2163                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x0b)
    2164                            .dwendtag $C$DW$T$193
    2165                    
    2166                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   41

    2167                    $C$DW$T$194     .dwtag  DW_TAG_structure_type
    2168                            .dwattr $C$DW$T$194, DW_AT_byte_size(0x01)
    2169                    $C$DW$181       .dwtag  DW_TAG_member
    2170                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$148)
    2171                            .dwattr $C$DW$181, DW_AT_name("rule")
    2172                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("rule")
    2173                            .dwattr $C$DW$181, DW_AT_bit_offset(0x04)
    2174                            .dwattr $C$DW$181, DW_AT_bit_size(0x04)
    2175                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2177                            .dwattr $C$DW$181, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2178                            .dwattr $C$DW$181, DW_AT_decl_line(0xa1)
    2179                            .dwattr $C$DW$181, DW_AT_decl_column(0x0f)
    2180                    
    2181                    $C$DW$182       .dwtag  DW_TAG_member
    2182                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$148)
    2183                            .dwattr $C$DW$182, DW_AT_name("nSkip")
    2184                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("nSkip")
    2185                            .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    2186                            .dwattr $C$DW$182, DW_AT_bit_size(0x04)
    2187                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2188                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2189                            .dwattr $C$DW$182, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2190                            .dwattr $C$DW$182, DW_AT_decl_line(0xa2)
    2191                            .dwattr $C$DW$182, DW_AT_decl_column(0x0f)
    2192                    
    2193                            .dwattr $C$DW$T$194, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2194                            .dwattr $C$DW$T$194, DW_AT_decl_line(0xa0)
    2195                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x0b)
    2196                            .dwendtag $C$DW$T$194
    2197                    
    2198                    
    2199                    $C$DW$T$195     .dwtag  DW_TAG_structure_type
    2200                            .dwattr $C$DW$T$195, DW_AT_byte_size(0x01)
    2201                    $C$DW$183       .dwtag  DW_TAG_member
    2202                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$148)
    2203                            .dwattr $C$DW$183, DW_AT_name("triggerType")
    2204                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("triggerType")
    2205                            .dwattr $C$DW$183, DW_AT_bit_offset(0x04)
    2206                            .dwattr $C$DW$183, DW_AT_bit_size(0x04)
    2207                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2208                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2209                            .dwattr $C$DW$183, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2210                            .dwattr $C$DW$183, DW_AT_decl_line(0xb4)
    2211                            .dwattr $C$DW$183, DW_AT_decl_column(0x0f)
    2212                    
    2213                    $C$DW$184       .dwtag  DW_TAG_member
    2214                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$148)
    2215                            .dwattr $C$DW$184, DW_AT_name("bEnaCmd")
    2216                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("bEnaCmd")
    2217                            .dwattr $C$DW$184, DW_AT_bit_offset(0x03)
    2218                            .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2219                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2221                            .dwattr $C$DW$184, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   42

    2222                            .dwattr $C$DW$184, DW_AT_decl_line(0xb5)
    2223                            .dwattr $C$DW$184, DW_AT_decl_column(0x0f)
    2224                    
    2225                    $C$DW$185       .dwtag  DW_TAG_member
    2226                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$148)
    2227                            .dwattr $C$DW$185, DW_AT_name("triggerNo")
    2228                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("triggerNo")
    2229                            .dwattr $C$DW$185, DW_AT_bit_offset(0x01)
    2230                            .dwattr $C$DW$185, DW_AT_bit_size(0x02)
    2231                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2232                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2233                            .dwattr $C$DW$185, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2234                            .dwattr $C$DW$185, DW_AT_decl_line(0xb7)
    2235                            .dwattr $C$DW$185, DW_AT_decl_column(0x0f)
    2236                    
    2237                    $C$DW$186       .dwtag  DW_TAG_member
    2238                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$148)
    2239                            .dwattr $C$DW$186, DW_AT_name("pastTrig")
    2240                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("pastTrig")
    2241                            .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    2242                            .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2243                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2245                            .dwattr $C$DW$186, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2246                            .dwattr $C$DW$186, DW_AT_decl_line(0xb8)
    2247                            .dwattr $C$DW$186, DW_AT_decl_column(0x0f)
    2248                    
    2249                            .dwattr $C$DW$T$195, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2250                            .dwattr $C$DW$T$195, DW_AT_decl_line(0xb3)
    2251                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x0b)
    2252                            .dwendtag $C$DW$T$195
    2253                    
    2254                    
    2255                    $C$DW$T$196     .dwtag  DW_TAG_structure_type
    2256                            .dwattr $C$DW$T$196, DW_AT_byte_size(0x01)
    2257                    $C$DW$187       .dwtag  DW_TAG_member
    2258                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$148)
    2259                            .dwattr $C$DW$187, DW_AT_name("rule")
    2260                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("rule")
    2261                            .dwattr $C$DW$187, DW_AT_bit_offset(0x04)
    2262                            .dwattr $C$DW$187, DW_AT_bit_size(0x04)
    2263                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2264                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2265                            .dwattr $C$DW$187, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2266                            .dwattr $C$DW$187, DW_AT_decl_line(0xbc)
    2267                            .dwattr $C$DW$187, DW_AT_decl_column(0x0f)
    2268                    
    2269                    $C$DW$188       .dwtag  DW_TAG_member
    2270                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$148)
    2271                            .dwattr $C$DW$188, DW_AT_name("nSkip")
    2272                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("nSkip")
    2273                            .dwattr $C$DW$188, DW_AT_bit_offset(0x00)
    2274                            .dwattr $C$DW$188, DW_AT_bit_size(0x04)
    2275                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2276                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   43

    2277                            .dwattr $C$DW$188, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2278                            .dwattr $C$DW$188, DW_AT_decl_line(0xbd)
    2279                            .dwattr $C$DW$188, DW_AT_decl_column(0x0f)
    2280                    
    2281                            .dwattr $C$DW$T$196, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2282                            .dwattr $C$DW$T$196, DW_AT_decl_line(0xbb)
    2283                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x0b)
    2284                            .dwendtag $C$DW$T$196
    2285                    
    2286                    
    2287                    $C$DW$T$197     .dwtag  DW_TAG_structure_type
    2288                            .dwattr $C$DW$T$197, DW_AT_byte_size(0x02)
    2289                    $C$DW$189       .dwtag  DW_TAG_member
    2290                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$166)
    2291                            .dwattr $C$DW$189, DW_AT_name("frontEndMode")
    2292                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("frontEndMode")
    2293                            .dwattr $C$DW$189, DW_AT_bit_offset(0x0d)
    2294                            .dwattr $C$DW$189, DW_AT_bit_size(0x03)
    2295                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2297                            .dwattr $C$DW$189, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2298                            .dwattr $C$DW$189, DW_AT_decl_line(0xc8)
    2299                            .dwattr $C$DW$189, DW_AT_decl_column(0x10)
    2300                    
    2301                    $C$DW$190       .dwtag  DW_TAG_member
    2302                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$166)
    2303                            .dwattr $C$DW$190, DW_AT_name("biasMode")
    2304                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("biasMode")
    2305                            .dwattr $C$DW$190, DW_AT_bit_offset(0x0c)
    2306                            .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2307                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2308                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2309                            .dwattr $C$DW$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2310                            .dwattr $C$DW$190, DW_AT_decl_line(0xce)
    2311                            .dwattr $C$DW$190, DW_AT_decl_column(0x10)
    2312                    
    2313                    $C$DW$191       .dwtag  DW_TAG_member
    2314                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$166)
    2315                            .dwattr $C$DW$191, DW_AT_name("analogCfgMode")
    2316                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("analogCfgMode")
    2317                            .dwattr $C$DW$191, DW_AT_bit_offset(0x06)
    2318                            .dwattr $C$DW$191, DW_AT_bit_size(0x06)
    2319                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2320                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2321                            .dwattr $C$DW$191, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2322                            .dwattr $C$DW$191, DW_AT_decl_line(0xd0)
    2323                            .dwattr $C$DW$191, DW_AT_decl_column(0x10)
    2324                    
    2325                    $C$DW$192       .dwtag  DW_TAG_member
    2326                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$166)
    2327                            .dwattr $C$DW$192, DW_AT_name("bNoFsPowerUp")
    2328                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("bNoFsPowerUp")
    2329                            .dwattr $C$DW$192, DW_AT_bit_offset(0x05)
    2330                            .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2331                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   44

    2332                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2333                            .dwattr $C$DW$192, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2334                            .dwattr $C$DW$192, DW_AT_decl_line(0xd7)
    2335                            .dwattr $C$DW$192, DW_AT_decl_column(0x10)
    2336                    
    2337                            .dwattr $C$DW$T$197, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2338                            .dwattr $C$DW$T$197, DW_AT_decl_line(0xc7)
    2339                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x0b)
    2340                            .dwendtag $C$DW$T$197
    2341                    
    2342                    
    2343                    $C$DW$T$198     .dwtag  DW_TAG_structure_type
    2344                            .dwattr $C$DW$T$198, DW_AT_byte_size(0x01)
    2345                    $C$DW$193       .dwtag  DW_TAG_member
    2346                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$148)
    2347                            .dwattr $C$DW$193, DW_AT_name("triggerType")
    2348                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("triggerType")
    2349                            .dwattr $C$DW$193, DW_AT_bit_offset(0x04)
    2350                            .dwattr $C$DW$193, DW_AT_bit_size(0x04)
    2351                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2352                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2353                            .dwattr $C$DW$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2354                            .dwattr $C$DW$193, DW_AT_decl_line(0xf3)
    2355                            .dwattr $C$DW$193, DW_AT_decl_column(0x0f)
    2356                    
    2357                    $C$DW$194       .dwtag  DW_TAG_member
    2358                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$148)
    2359                            .dwattr $C$DW$194, DW_AT_name("bEnaCmd")
    2360                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("bEnaCmd")
    2361                            .dwattr $C$DW$194, DW_AT_bit_offset(0x03)
    2362                            .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2363                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2364                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2365                            .dwattr $C$DW$194, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2366                            .dwattr $C$DW$194, DW_AT_decl_line(0xf4)
    2367                            .dwattr $C$DW$194, DW_AT_decl_column(0x0f)
    2368                    
    2369                    $C$DW$195       .dwtag  DW_TAG_member
    2370                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$148)
    2371                            .dwattr $C$DW$195, DW_AT_name("triggerNo")
    2372                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("triggerNo")
    2373                            .dwattr $C$DW$195, DW_AT_bit_offset(0x01)
    2374                            .dwattr $C$DW$195, DW_AT_bit_size(0x02)
    2375                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2376                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2377                            .dwattr $C$DW$195, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2378                            .dwattr $C$DW$195, DW_AT_decl_line(0xf6)
    2379                            .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    2380                    
    2381                    $C$DW$196       .dwtag  DW_TAG_member
    2382                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$148)
    2383                            .dwattr $C$DW$196, DW_AT_name("pastTrig")
    2384                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("pastTrig")
    2385                            .dwattr $C$DW$196, DW_AT_bit_offset(0x00)
    2386                            .dwattr $C$DW$196, DW_AT_bit_size(0x01)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   45

    2387                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2388                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2389                            .dwattr $C$DW$196, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2390                            .dwattr $C$DW$196, DW_AT_decl_line(0xf7)
    2391                            .dwattr $C$DW$196, DW_AT_decl_column(0x0f)
    2392                    
    2393                            .dwattr $C$DW$T$198, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2394                            .dwattr $C$DW$T$198, DW_AT_decl_line(0xf2)
    2395                            .dwattr $C$DW$T$198, DW_AT_decl_column(0x0b)
    2396                            .dwendtag $C$DW$T$198
    2397                    
    2398                    
    2399                    $C$DW$T$199     .dwtag  DW_TAG_structure_type
    2400                            .dwattr $C$DW$T$199, DW_AT_byte_size(0x01)
    2401                    $C$DW$197       .dwtag  DW_TAG_member
    2402                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$148)
    2403                            .dwattr $C$DW$197, DW_AT_name("rule")
    2404                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("rule")
    2405                            .dwattr $C$DW$197, DW_AT_bit_offset(0x04)
    2406                            .dwattr $C$DW$197, DW_AT_bit_size(0x04)
    2407                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2409                            .dwattr $C$DW$197, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2410                            .dwattr $C$DW$197, DW_AT_decl_line(0xfb)
    2411                            .dwattr $C$DW$197, DW_AT_decl_column(0x0f)
    2412                    
    2413                    $C$DW$198       .dwtag  DW_TAG_member
    2414                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$148)
    2415                            .dwattr $C$DW$198, DW_AT_name("nSkip")
    2416                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("nSkip")
    2417                            .dwattr $C$DW$198, DW_AT_bit_offset(0x00)
    2418                            .dwattr $C$DW$198, DW_AT_bit_size(0x04)
    2419                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2420                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2421                            .dwattr $C$DW$198, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2422                            .dwattr $C$DW$198, DW_AT_decl_line(0xfc)
    2423                            .dwattr $C$DW$198, DW_AT_decl_column(0x0f)
    2424                    
    2425                            .dwattr $C$DW$T$199, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2426                            .dwattr $C$DW$T$199, DW_AT_decl_line(0xfa)
    2427                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x0b)
    2428                            .dwendtag $C$DW$T$199
    2429                    
    2430                    
    2431                    $C$DW$T$200     .dwtag  DW_TAG_structure_type
    2432                            .dwattr $C$DW$T$200, DW_AT_byte_size(0x01)
    2433                    $C$DW$199       .dwtag  DW_TAG_member
    2434                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$148)
    2435                            .dwattr $C$DW$199, DW_AT_name("bTxMode")
    2436                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("bTxMode")
    2437                            .dwattr $C$DW$199, DW_AT_bit_offset(0x07)
    2438                            .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2439                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2440                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2441                            .dwattr $C$DW$199, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   46

    2442                            .dwattr $C$DW$199, DW_AT_decl_line(0x101)
    2443                            .dwattr $C$DW$199, DW_AT_decl_column(0x0f)
    2444                    
    2445                    $C$DW$200       .dwtag  DW_TAG_member
    2446                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$148)
    2447                            .dwattr $C$DW$200, DW_AT_name("refFreq")
    2448                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("refFreq")
    2449                            .dwattr $C$DW$200, DW_AT_bit_offset(0x01)
    2450                            .dwattr $C$DW$200, DW_AT_bit_size(0x06)
    2451                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2452                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2453                            .dwattr $C$DW$200, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2454                            .dwattr $C$DW$200, DW_AT_decl_line(0x103)
    2455                            .dwattr $C$DW$200, DW_AT_decl_column(0x0f)
    2456                    
    2457                            .dwattr $C$DW$T$200, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2458                            .dwattr $C$DW$T$200, DW_AT_decl_line(0x100)
    2459                            .dwattr $C$DW$T$200, DW_AT_decl_column(0x0b)
    2460                            .dwendtag $C$DW$T$200
    2461                    
    2462                    
    2463                    $C$DW$T$201     .dwtag  DW_TAG_structure_type
    2464                            .dwattr $C$DW$T$201, DW_AT_byte_size(0x01)
    2465                    $C$DW$201       .dwtag  DW_TAG_member
    2466                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$148)
    2467                            .dwattr $C$DW$201, DW_AT_name("triggerType")
    2468                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("triggerType")
    2469                            .dwattr $C$DW$201, DW_AT_bit_offset(0x04)
    2470                            .dwattr $C$DW$201, DW_AT_bit_size(0x04)
    2471                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2473                            .dwattr $C$DW$201, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2474                            .dwattr $C$DW$201, DW_AT_decl_line(0x11a)
    2475                            .dwattr $C$DW$201, DW_AT_decl_column(0x0f)
    2476                    
    2477                    $C$DW$202       .dwtag  DW_TAG_member
    2478                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$148)
    2479                            .dwattr $C$DW$202, DW_AT_name("bEnaCmd")
    2480                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("bEnaCmd")
    2481                            .dwattr $C$DW$202, DW_AT_bit_offset(0x03)
    2482                            .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2483                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2484                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2485                            .dwattr $C$DW$202, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2486                            .dwattr $C$DW$202, DW_AT_decl_line(0x11b)
    2487                            .dwattr $C$DW$202, DW_AT_decl_column(0x0f)
    2488                    
    2489                    $C$DW$203       .dwtag  DW_TAG_member
    2490                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$148)
    2491                            .dwattr $C$DW$203, DW_AT_name("triggerNo")
    2492                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("triggerNo")
    2493                            .dwattr $C$DW$203, DW_AT_bit_offset(0x01)
    2494                            .dwattr $C$DW$203, DW_AT_bit_size(0x02)
    2495                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2496                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   47

    2497                            .dwattr $C$DW$203, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2498                            .dwattr $C$DW$203, DW_AT_decl_line(0x11d)
    2499                            .dwattr $C$DW$203, DW_AT_decl_column(0x0f)
    2500                    
    2501                    $C$DW$204       .dwtag  DW_TAG_member
    2502                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$148)
    2503                            .dwattr $C$DW$204, DW_AT_name("pastTrig")
    2504                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("pastTrig")
    2505                            .dwattr $C$DW$204, DW_AT_bit_offset(0x00)
    2506                            .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2507                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2508                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2509                            .dwattr $C$DW$204, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2510                            .dwattr $C$DW$204, DW_AT_decl_line(0x11e)
    2511                            .dwattr $C$DW$204, DW_AT_decl_column(0x0f)
    2512                    
    2513                            .dwattr $C$DW$T$201, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2514                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x119)
    2515                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x0b)
    2516                            .dwendtag $C$DW$T$201
    2517                    
    2518                    
    2519                    $C$DW$T$202     .dwtag  DW_TAG_structure_type
    2520                            .dwattr $C$DW$T$202, DW_AT_byte_size(0x01)
    2521                    $C$DW$205       .dwtag  DW_TAG_member
    2522                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$148)
    2523                            .dwattr $C$DW$205, DW_AT_name("rule")
    2524                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("rule")
    2525                            .dwattr $C$DW$205, DW_AT_bit_offset(0x04)
    2526                            .dwattr $C$DW$205, DW_AT_bit_size(0x04)
    2527                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2528                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2529                            .dwattr $C$DW$205, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2530                            .dwattr $C$DW$205, DW_AT_decl_line(0x122)
    2531                            .dwattr $C$DW$205, DW_AT_decl_column(0x0f)
    2532                    
    2533                    $C$DW$206       .dwtag  DW_TAG_member
    2534                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$148)
    2535                            .dwattr $C$DW$206, DW_AT_name("nSkip")
    2536                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("nSkip")
    2537                            .dwattr $C$DW$206, DW_AT_bit_offset(0x00)
    2538                            .dwattr $C$DW$206, DW_AT_bit_size(0x04)
    2539                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2540                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2541                            .dwattr $C$DW$206, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2542                            .dwattr $C$DW$206, DW_AT_decl_line(0x123)
    2543                            .dwattr $C$DW$206, DW_AT_decl_column(0x0f)
    2544                    
    2545                            .dwattr $C$DW$T$202, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2546                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x121)
    2547                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x0b)
    2548                            .dwendtag $C$DW$T$202
    2549                    
    2550                    
    2551                    $C$DW$T$203     .dwtag  DW_TAG_structure_type
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   48

    2552                            .dwattr $C$DW$T$203, DW_AT_byte_size(0x01)
    2553                    $C$DW$207       .dwtag  DW_TAG_member
    2554                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$148)
    2555                            .dwattr $C$DW$207, DW_AT_name("triggerType")
    2556                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("triggerType")
    2557                            .dwattr $C$DW$207, DW_AT_bit_offset(0x04)
    2558                            .dwattr $C$DW$207, DW_AT_bit_size(0x04)
    2559                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2560                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2561                            .dwattr $C$DW$207, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2562                            .dwattr $C$DW$207, DW_AT_decl_line(0x135)
    2563                            .dwattr $C$DW$207, DW_AT_decl_column(0x0f)
    2564                    
    2565                    $C$DW$208       .dwtag  DW_TAG_member
    2566                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$148)
    2567                            .dwattr $C$DW$208, DW_AT_name("bEnaCmd")
    2568                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("bEnaCmd")
    2569                            .dwattr $C$DW$208, DW_AT_bit_offset(0x03)
    2570                            .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2571                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2572                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2573                            .dwattr $C$DW$208, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2574                            .dwattr $C$DW$208, DW_AT_decl_line(0x136)
    2575                            .dwattr $C$DW$208, DW_AT_decl_column(0x0f)
    2576                    
    2577                    $C$DW$209       .dwtag  DW_TAG_member
    2578                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$148)
    2579                            .dwattr $C$DW$209, DW_AT_name("triggerNo")
    2580                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("triggerNo")
    2581                            .dwattr $C$DW$209, DW_AT_bit_offset(0x01)
    2582                            .dwattr $C$DW$209, DW_AT_bit_size(0x02)
    2583                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2584                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2585                            .dwattr $C$DW$209, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2586                            .dwattr $C$DW$209, DW_AT_decl_line(0x138)
    2587                            .dwattr $C$DW$209, DW_AT_decl_column(0x0f)
    2588                    
    2589                    $C$DW$210       .dwtag  DW_TAG_member
    2590                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$148)
    2591                            .dwattr $C$DW$210, DW_AT_name("pastTrig")
    2592                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("pastTrig")
    2593                            .dwattr $C$DW$210, DW_AT_bit_offset(0x00)
    2594                            .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2595                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2596                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2597                            .dwattr $C$DW$210, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2598                            .dwattr $C$DW$210, DW_AT_decl_line(0x139)
    2599                            .dwattr $C$DW$210, DW_AT_decl_column(0x0f)
    2600                    
    2601                            .dwattr $C$DW$T$203, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    2602                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x134)
    2603                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x0b)
    2604                            .dwendtag $C$DW$T$203
    2605                    
    2606                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   49

    2607                    $C$DW$T$204     .dwtag  DW_TAG_structure_type
    2608                            .dwattr $C$DW$T$204, DW_AT_byte_size(0x01)
    2609                    $C$DW$211       .dwtag  DW_TAG_member
    2610                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$148)
    2611                            .dwattr $C$DW$211, DW_AT_name("rule")
    2612                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("rule")
    2613                            .dwattr $C$DW$211, DW_AT_bit_offset(0x04)
    2614                            .dwattr $C$DW$211, DW_AT_bit_size(0x04)
    2615                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2616                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
