;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
;* Date/Time created: Fri Apr  2 00:57:45 2021                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=none --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../main.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
	.global	ledPinHandle
	.common	ledPinHandle,4,4
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("ledPinHandle")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("ledPinHandle")
	.dwattr $C$DW$1, DW_AT_location[DW_OP_addr ledPinHandle]
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$634)
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../main.c")
	.dwattr $C$DW$1, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1, DW_AT_decl_column(0x0c)

	.global	ledPinState
	.common	ledPinState,12,4
$C$DW$2	.dwtag  DW_TAG_variable

	.dwattr $C$DW$120, DW_AT_name("EasyLink_Status_Param_Error")
	.dwattr $C$DW$120, DW_AT_const_value(0x02)
	.dwattr $C$DW$120, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$120, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$120, DW_AT_decl_column(0x05)

$C$DW$121	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$121, DW_AT_name("EasyLink_Status_Mem_Error")
	.dwattr $C$DW$121, DW_AT_const_value(0x03)
	.dwattr $C$DW$121, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$121, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$121, DW_AT_decl_column(0x05)

$C$DW$122	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$122, DW_AT_name("EasyLink_Status_Cmd_Error")
	.dwattr $C$DW$122, DW_AT_const_value(0x04)
	.dwattr $C$DW$122, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$122, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$122, DW_AT_decl_column(0x05)

$C$DW$123	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$123, DW_AT_name("EasyLink_Status_Tx_Error")
	.dwattr $C$DW$123, DW_AT_const_value(0x05)
	.dwattr $C$DW$123, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$123, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$123, DW_AT_decl_column(0x05)

$C$DW$124	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$124, DW_AT_name("EasyLink_Status_Rx_Error")
	.dwattr $C$DW$124, DW_AT_const_value(0x06)
	.dwattr $C$DW$124, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$124, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$124, DW_AT_decl_column(0x05)

$C$DW$125	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$125, DW_AT_name("EasyLink_Status_Rx_Timeout")
	.dwattr $C$DW$125, DW_AT_const_value(0x07)
	.dwattr $C$DW$125, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$125, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$125, DW_AT_decl_column(0x05)

$C$DW$126	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$126, DW_AT_name("EasyLink_Status_Rx_Buffer_Error")
	.dwattr $C$DW$126, DW_AT_const_value(0x08)
	.dwattr $C$DW$126, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$126, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$126, DW_AT_decl_column(0x05)

$C$DW$127	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$127, DW_AT_name("EasyLink_Status_Busy_Error")
	.dwattr $C$DW$127, DW_AT_const_value(0x09)
	.dwattr $C$DW$127, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$127, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$127, DW_AT_decl_column(0x05)

$C$DW$128	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$128, DW_AT_name("EasyLink_Status_Aborted")
	.dwattr $C$DW$128, DW_AT_const_value(0x0a)
	.dwattr $C$DW$128, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$128, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$128, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$1239, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$T$1239, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$T$1239, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$1239

$C$DW$T$1240	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1240, DW_AT_name("EasyLink_Status")
	.dwattr $C$DW$T$1240, DW_AT_type(*$C$DW$T$1239)
	.dwattr $C$DW$T$1240, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1240, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$T$1240, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$T$1240, DW_AT_decl_column(0x03)


$C$DW$T$1241	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1241, DW_AT_byte_size(0x01)
$C$DW$129	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$129, DW_AT_name("EasyLink_Ctrl_AddSize")
	.dwattr $C$DW$129, DW_AT_const_value(0x00)
	.dwattr $C$DW$129, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$129, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$129, DW_AT_decl_column(0x05)

$C$DW$130	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$130, DW_AT_name("EasyLink_Ctrl_Idle_TimeOut")
	.dwattr $C$DW$130, DW_AT_const_value(0x01)
	.dwattr $C$DW$130, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$130, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$130, DW_AT_decl_column(0x05)

$C$DW$131	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$131, DW_AT_name("EasyLink_Ctrl_MultiClient_Mode")
	.dwattr $C$DW$131, DW_AT_const_value(0x02)
	.dwattr $C$DW$131, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$131, DW_AT_decl_line(0xed)
	.dwattr $C$DW$131, DW_AT_decl_column(0x05)

$C$DW$132	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$132, DW_AT_name("EasyLink_Ctrl_AsyncRx_TimeOut")
	.dwattr $C$DW$132, DW_AT_const_value(0x03)
	.dwattr $C$DW$132, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$132, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$132, DW_AT_decl_column(0x05)

$C$DW$133	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$133, DW_AT_name("EasyLink_Ctrl_Test_Tone")
	.dwattr $C$DW$133, DW_AT_const_value(0x04)
	.dwattr $C$DW$133, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$133, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$133, DW_AT_decl_column(0x05)

$C$DW$134	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$134, DW_AT_name("EasyLink_Ctrl_Test_Signal")
	.dwattr $C$DW$134, DW_AT_const_value(0x05)
	.dwattr $C$DW$134, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$134, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$134, DW_AT_decl_column(0x05)

$C$DW$135	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$135, DW_AT_name("EasyLink_Ctrl_Rx_Test_Tone")
	.dwattr $C$DW$135, DW_AT_const_value(0x06)
	.dwattr $C$DW$135, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$135, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$135, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$1241, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$T$1241, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$1241, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$1241

$C$DW$T$1242	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1242, DW_AT_name("EasyLink_CtrlOption")
	.dwattr $C$DW$T$1242, DW_AT_type(*$C$DW$T$1241)
	.dwattr $C$DW$T$1242, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1242, DW_AT_decl_file("../easylink/EasyLink.h")
	.dwattr $C$DW$T$1242, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$T$1242, DW_AT_decl_column(0x03)


$C$DW$T$120	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$120, DW_AT_byte_size(0x10)
$C$DW$136	.dwtag  DW_TAG_member
	.dwattr $C$DW$136, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$136, DW_AT_name("__max_align1")
	.dwattr $C$DW$136, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$136, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$136, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$136, DW_AT_decl_column(0x0c)

$C$DW$137	.dwtag  DW_TAG_member
	.dwattr $C$DW$137, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$137, DW_AT_name("__max_align2")
	.dwattr $C$DW$137, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$137, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$137, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$137, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$120, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$120, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$120, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$120

$C$DW$T$1243	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1243, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$1243, DW_AT_type(*$C$DW$T$120)
	.dwattr $C$DW$T$1243, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1243, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$1243, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$1243, DW_AT_decl_column(0x03)


$C$DW$T$123	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$123, DW_AT_byte_size(0x08)
$C$DW$138	.dwtag  DW_TAG_member
	.dwattr $C$DW$138, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$138, DW_AT_name("length")
	.dwattr $C$DW$138, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$138, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$138, DW_AT_decl_line(0x165)
	.dwattr $C$DW$138, DW_AT_decl_column(0x16)

$C$DW$139	.dwtag  DW_TAG_member
	.dwattr $C$DW$139, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$139, DW_AT_name("elem")
	.dwattr $C$DW$139, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$139, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$139, DW_AT_decl_line(0x165)
	.dwattr $C$DW$139, DW_AT_decl_column(0x3a)

	.dwattr $C$DW$T$123, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$123, DW_AT_decl_line(0x165)
	.dwattr $C$DW$T$123, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$123

$C$DW$T$1244	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1244, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1244, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$T$1244, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1244, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1244, DW_AT_decl_line(0x165)
	.dwattr $C$DW$T$1244, DW_AT_decl_column(0x42)


$C$DW$T$126	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$126, DW_AT_byte_size(0x08)
$C$DW$140	.dwtag  DW_TAG_member
	.dwattr $C$DW$140, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$140, DW_AT_name("length")
	.dwattr $C$DW$140, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$140, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$140, DW_AT_decl_line(0x166)
	.dwattr $C$DW$140, DW_AT_decl_column(0x16)

$C$DW$141	.dwtag  DW_TAG_member
	.dwattr $C$DW$141, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$141, DW_AT_name("elem")
	.dwattr $C$DW$141, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$141, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$141, DW_AT_decl_line(0x166)
	.dwattr $C$DW$141, DW_AT_decl_column(0x40)

	.dwattr $C$DW$T$126, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$126, DW_AT_decl_line(0x166)
	.dwattr $C$DW$T$126, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$126

$C$DW$T$1245	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1245, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1245, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$1245, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1245, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1245, DW_AT_decl_line(0x166)
	.dwattr $C$DW$T$1245, DW_AT_decl_column(0x48)

$C$DW$T$1246	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1246, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1246, DW_AT_type(*$C$DW$T$1245)
	.dwattr $C$DW$T$1246, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1246, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1246, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$1246, DW_AT_decl_column(0x2a)

$C$DW$T$1247	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1247, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1247, DW_AT_type(*$C$DW$T$1245)
	.dwattr $C$DW$T$1247, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1247, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1247, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$1247, DW_AT_decl_column(0x2a)


$C$DW$T$129	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$129, DW_AT_byte_size(0x08)
$C$DW$142	.dwtag  DW_TAG_member
	.dwattr $C$DW$142, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$142, DW_AT_name("length")
	.dwattr $C$DW$142, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$142, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$142, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$142, DW_AT_decl_column(0x16)

$C$DW$143	.dwtag  DW_TAG_member
	.dwattr $C$DW$143, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$143, DW_AT_name("elem")
	.dwattr $C$DW$143, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$143, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$143, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$143, DW_AT_decl_column(0x3b)

	.dwattr $C$DW$T$129, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$129, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$129, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$129

$C$DW$T$1248	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1248, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1248, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$1248, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1248, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1248, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$1248, DW_AT_decl_column(0x43)


$C$DW$T$132	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$132, DW_AT_byte_size(0x08)
$C$DW$144	.dwtag  DW_TAG_member
	.dwattr $C$DW$144, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$144, DW_AT_name("length")
	.dwattr $C$DW$144, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$144, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$144, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$144, DW_AT_decl_column(0x16)

$C$DW$145	.dwtag  DW_TAG_member
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$145, DW_AT_name("elem")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$145, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$145, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$145, DW_AT_decl_column(0x41)

	.dwattr $C$DW$T$132, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$132, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$T$132, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$132

$C$DW$T$1249	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1249, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1249, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$T$1249, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1249, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1249, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$T$1249, DW_AT_decl_column(0x49)

$C$DW$T$1250	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1250, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1250, DW_AT_type(*$C$DW$T$1249)
	.dwattr $C$DW$T$1250, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1250, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1250, DW_AT_decl_line(0x29e)
	.dwattr $C$DW$T$1250, DW_AT_decl_column(0x2b)

$C$DW$T$1251	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1251, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1251, DW_AT_type(*$C$DW$T$1249)
	.dwattr $C$DW$T$1251, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1251, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1251, DW_AT_decl_line(0x29d)
	.dwattr $C$DW$T$1251, DW_AT_decl_column(0x2b)


$C$DW$T$145	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$145, DW_AT_byte_size(0x14)
$C$DW$146	.dwtag  DW_TAG_member
	.dwattr $C$DW$146, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$146, DW_AT_name("link")
	.dwattr $C$DW$146, DW_AT_TI_symbol_name("link")
	.dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$146, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$146, DW_AT_decl_column(0x0f)

$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$147, DW_AT_name("eventTypes")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("eventTypes")
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$147, DW_AT_decl_column(0x13)

$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$144)
	.dwattr $C$DW$148, DW_AT_name("notifyFxn")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("notifyFxn")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$148, DW_AT_decl_column(0x15)

$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$149, DW_AT_name("clientArg")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("clientArg")
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$149, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$149, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$145, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$145

$C$DW$T$1252	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1252, DW_AT_name("Power_NotifyObj")
	.dwattr $C$DW$T$1252, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$T$1252, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1252, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/Power.h")
	.dwattr $C$DW$T$1252, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$T$1252, DW_AT_decl_column(0x03)


$C$DW$T$189	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$189, DW_AT_byte_size(0x4c)
$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$150, DW_AT_name("Crc32")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("Crc32")
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$150, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0x76)
	.dwattr $C$DW$150, DW_AT_decl_column(0x25)

$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$151, DW_AT_name("FlashGetSize")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("FlashGetSize")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$151, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0x77)
	.dwattr $C$DW$151, DW_AT_decl_column(0x25)

$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$152, DW_AT_name("GetChipId")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("GetChipId")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$152, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0x78)
	.dwattr $C$DW$152, DW_AT_decl_column(0x25)

$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$153, DW_AT_name("ReservedLocation1")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("ReservedLocation1")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$153, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x79)
	.dwattr $C$DW$153, DW_AT_decl_column(0x25)

$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$154, DW_AT_name("ReservedLocation2")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("ReservedLocation2")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$154, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$154, DW_AT_decl_column(0x25)

$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$155, DW_AT_name("ReservedLocation3")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("ReservedLocation3")
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$155, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$155, DW_AT_decl_column(0x25)

$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$156, DW_AT_name("ResetDevice")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("ResetDevice")
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$156, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$156, DW_AT_decl_column(0x25)

$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$157, DW_AT_name("Fletcher32")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("Fletcher32")
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$157, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$157, DW_AT_decl_column(0x25)

$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$158, DW_AT_name("MinValue")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("MinValue")
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$158, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$158, DW_AT_decl_column(0x25)

$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$175)
	.dwattr $C$DW$159, DW_AT_name("MaxValue")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("MaxValue")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$159, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$159, DW_AT_decl_column(0x25)

$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$160, DW_AT_name("MeanValue")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("MeanValue")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$160, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0x80)
	.dwattr $C$DW$160, DW_AT_decl_column(0x25)

$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$161, DW_AT_name("StandDeviationValue")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("StandDeviationValue")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$161, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0x81)
	.dwattr $C$DW$161, DW_AT_decl_column(0x25)

$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$180)
	.dwattr $C$DW$162, DW_AT_name("ReservedLocation4")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("ReservedLocation4")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$162, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0x82)
	.dwattr $C$DW$162, DW_AT_decl_column(0x25)

$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$181)
	.dwattr $C$DW$163, DW_AT_name("ReservedLocation5")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("ReservedLocation5")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$163, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x83)
	.dwattr $C$DW$163, DW_AT_decl_column(0x25)

$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$182)
	.dwattr $C$DW$164, DW_AT_name("HFSourceSafeSwitch")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$164, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x84)
	.dwattr $C$DW$164, DW_AT_decl_column(0x25)

$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$185)
	.dwattr $C$DW$165, DW_AT_name("SelectCompAInput")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("SelectCompAInput")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$165, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x85)
	.dwattr $C$DW$165, DW_AT_decl_column(0x25)

$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$186)
	.dwattr $C$DW$166, DW_AT_name("SelectCompARef")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("SelectCompARef")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x86)
	.dwattr $C$DW$166, DW_AT_decl_column(0x25)

$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$187)
	.dwattr $C$DW$167, DW_AT_name("SelectADCCompBInput")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("SelectADCCompBInput")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x87)
	.dwattr $C$DW$167, DW_AT_decl_column(0x25)

$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$188)
	.dwattr $C$DW$168, DW_AT_name("SelectCompBRef")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("SelectCompBRef")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0x88)
	.dwattr $C$DW$168, DW_AT_decl_column(0x25)

	.dwattr $C$DW$T$189, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$189, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$189, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$189

$C$DW$T$1253	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1253, DW_AT_name("HARD_API_T")
	.dwattr $C$DW$T$1253, DW_AT_type(*$C$DW$T$189)
	.dwattr $C$DW$T$1253, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1253, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/../driverlib/rom.h")
	.dwattr $C$DW$T$1253, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$1253, DW_AT_decl_column(0x03)


$C$DW$T$190	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$190, DW_AT_byte_size(0x08)
$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$169, DW_AT_name("pCurrEntry")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("pCurrEntry")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_mailbox.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$169, DW_AT_decl_column(0x0d)

$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$170, DW_AT_name("pLastEntry")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("pLastEntry")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_mailbox.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0x40)
	.dwattr $C$DW$170, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_mailbox.h")
	.dwattr $C$DW$T$190, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$190, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$190

$C$DW$T$704	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$704, DW_AT_name("dataQueue_t")
	.dwattr $C$DW$T$704, DW_AT_type(*$C$DW$T$190)
	.dwattr $C$DW$T$704, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$704, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_mailbox.h")
	.dwattr $C$DW$T$704, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$704, DW_AT_decl_column(0x03)

$C$DW$T$705	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$705, DW_AT_type(*$C$DW$T$704)
	.dwattr $C$DW$T$705, DW_AT_address_class(0x20)


$C$DW$T$191	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$191, DW_AT_byte_size(0x01)
$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$171, DW_AT_name("triggerType")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$171, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$171, DW_AT_bit_size(0x04)
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$171, DW_AT_decl_column(0x0f)

$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$172, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$172, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$172, DW_AT_bit_size(0x01)
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$172, DW_AT_decl_column(0x0f)

$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$173, DW_AT_name("triggerNo")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$173, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$173, DW_AT_bit_size(0x02)
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x81)
	.dwattr $C$DW$173, DW_AT_decl_column(0x0f)

$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$174, DW_AT_name("pastTrig")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$174, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$174, DW_AT_bit_size(0x01)
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x82)
	.dwattr $C$DW$174, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$191, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$191, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$191, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$191


$C$DW$T$192	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$192, DW_AT_byte_size(0x01)
$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$175, DW_AT_name("rule")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$175, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$175, DW_AT_bit_size(0x04)
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x86)
	.dwattr $C$DW$175, DW_AT_decl_column(0x0f)

$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$176, DW_AT_name("nSkip")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$176, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$176, DW_AT_bit_size(0x04)
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x87)
	.dwattr $C$DW$176, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$192, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$192, DW_AT_decl_line(0x85)
	.dwattr $C$DW$T$192, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$192


$C$DW$T$193	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$193, DW_AT_byte_size(0x01)
$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$177, DW_AT_name("triggerType")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$177, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$177, DW_AT_bit_size(0x04)
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x99)
	.dwattr $C$DW$177, DW_AT_decl_column(0x0f)

$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$178, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$178, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$178, DW_AT_bit_size(0x01)
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$178, DW_AT_decl_column(0x0f)

$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$179, DW_AT_name("triggerNo")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$179, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$179, DW_AT_bit_size(0x02)
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$179, DW_AT_decl_column(0x0f)

$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$180, DW_AT_name("pastTrig")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$180, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$180, DW_AT_bit_size(0x01)
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$180, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$193, DW_AT_decl_line(0x98)
	.dwattr $C$DW$T$193, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$193


$C$DW$T$194	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$194, DW_AT_byte_size(0x01)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$181, DW_AT_name("rule")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$181, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$181, DW_AT_bit_size(0x04)
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$181, DW_AT_decl_column(0x0f)

$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$182, DW_AT_name("nSkip")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$182, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$182, DW_AT_bit_size(0x04)
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$182, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$194, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$194, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$194, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$194


$C$DW$T$195	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$195, DW_AT_byte_size(0x01)
$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$183, DW_AT_name("triggerType")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$183, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$183, DW_AT_bit_size(0x04)
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$183, DW_AT_decl_column(0x0f)

$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$184, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$184, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$184, DW_AT_bit_size(0x01)
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$184, DW_AT_decl_column(0x0f)

$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$185, DW_AT_name("triggerNo")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$185, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$185, DW_AT_bit_size(0x02)
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$185, DW_AT_decl_column(0x0f)

$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$186, DW_AT_name("pastTrig")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$186, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$186, DW_AT_bit_size(0x01)
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$186, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$195, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$195, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$T$195, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$195


$C$DW$T$196	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$196, DW_AT_byte_size(0x01)
$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$187, DW_AT_name("rule")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$187, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$187, DW_AT_bit_size(0x04)
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$187, DW_AT_decl_column(0x0f)

$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$188, DW_AT_name("nSkip")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$188, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$188, DW_AT_bit_size(0x04)
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$188, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$196, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$196, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$T$196, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$196


$C$DW$T$197	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$197, DW_AT_byte_size(0x02)
$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$189, DW_AT_name("frontEndMode")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("frontEndMode")
	.dwattr $C$DW$189, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$189, DW_AT_bit_size(0x03)
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$189, DW_AT_decl_column(0x10)

$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$190, DW_AT_name("biasMode")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("biasMode")
	.dwattr $C$DW$190, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$190, DW_AT_bit_size(0x01)
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0xce)
	.dwattr $C$DW$190, DW_AT_decl_column(0x10)

$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$191, DW_AT_name("analogCfgMode")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("analogCfgMode")
	.dwattr $C$DW$191, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$191, DW_AT_bit_size(0x06)
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$191, DW_AT_decl_column(0x10)

$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$192, DW_AT_name("bNoFsPowerUp")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("bNoFsPowerUp")
	.dwattr $C$DW$192, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$192, DW_AT_bit_size(0x01)
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$192, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$197, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$197, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$197, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$197


$C$DW$T$198	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$198, DW_AT_byte_size(0x01)
$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$193, DW_AT_name("triggerType")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$193, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$193, DW_AT_bit_size(0x04)
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$193, DW_AT_decl_column(0x0f)

$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$194, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$194, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$194, DW_AT_bit_size(0x01)
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$194, DW_AT_decl_column(0x0f)

$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$195, DW_AT_name("triggerNo")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$195, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$195, DW_AT_bit_size(0x02)
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$195, DW_AT_decl_column(0x0f)

$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$196, DW_AT_name("pastTrig")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$196, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$196, DW_AT_bit_size(0x01)
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$196, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$198, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$198, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$T$198, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$198


$C$DW$T$199	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$199, DW_AT_byte_size(0x01)
$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$197, DW_AT_name("rule")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$197, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$197, DW_AT_bit_size(0x04)
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$197, DW_AT_decl_column(0x0f)

$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$198, DW_AT_name("nSkip")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$198, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$198, DW_AT_bit_size(0x04)
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$198, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$199, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$199, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$199, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$199


$C$DW$T$200	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$200, DW_AT_byte_size(0x01)
$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$199, DW_AT_name("bTxMode")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("bTxMode")
	.dwattr $C$DW$199, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$199, DW_AT_bit_size(0x01)
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0x101)
	.dwattr $C$DW$199, DW_AT_decl_column(0x0f)

$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$200, DW_AT_name("refFreq")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("refFreq")
	.dwattr $C$DW$200, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$200, DW_AT_bit_size(0x06)
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0x103)
	.dwattr $C$DW$200, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$200, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$200, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$200, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$200


$C$DW$T$201	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$201, DW_AT_byte_size(0x01)
$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$201, DW_AT_name("triggerType")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$201, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$201, DW_AT_bit_size(0x04)
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$201, DW_AT_decl_column(0x0f)

$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$202, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$202, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$202, DW_AT_bit_size(0x01)
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$202, DW_AT_decl_column(0x0f)

$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$203, DW_AT_name("triggerNo")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$203, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$203, DW_AT_bit_size(0x02)
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$203, DW_AT_decl_column(0x0f)

$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$204, DW_AT_name("pastTrig")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$204, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$204, DW_AT_bit_size(0x01)
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$204, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$201, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$201, DW_AT_decl_line(0x119)
	.dwattr $C$DW$T$201, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$201


$C$DW$T$202	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$202, DW_AT_byte_size(0x01)
$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$205, DW_AT_name("rule")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$205, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$205, DW_AT_bit_size(0x04)
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$205, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$205, DW_AT_decl_line(0x122)
	.dwattr $C$DW$205, DW_AT_decl_column(0x0f)

$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$206, DW_AT_name("nSkip")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$206, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$206, DW_AT_bit_size(0x04)
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0x123)
	.dwattr $C$DW$206, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$202, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$202, DW_AT_decl_line(0x121)
	.dwattr $C$DW$T$202, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$202


$C$DW$T$203	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$203, DW_AT_byte_size(0x01)
$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$207, DW_AT_name("triggerType")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$207, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$207, DW_AT_bit_size(0x04)
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0x135)
	.dwattr $C$DW$207, DW_AT_decl_column(0x0f)

$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$208, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$208, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$208, DW_AT_bit_size(0x01)
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0x136)
	.dwattr $C$DW$208, DW_AT_decl_column(0x0f)

$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$209, DW_AT_name("triggerNo")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$209, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$209, DW_AT_bit_size(0x02)
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0x138)
	.dwattr $C$DW$209, DW_AT_decl_column(0x0f)

$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$210, DW_AT_name("pastTrig")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$210, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$210, DW_AT_bit_size(0x01)
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$210, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$210, DW_AT_decl_line(0x139)
	.dwattr $C$DW$210, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$203, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$203, DW_AT_decl_line(0x134)
	.dwattr $C$DW$T$203, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$203


$C$DW$T$204	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$204, DW_AT_byte_size(0x01)
$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$211, DW_AT_name("rule")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$211, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$211, DW_AT_bit_size(0x04)
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$211, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$211, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$211, DW_AT_decl_column(0x0f)

$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$212, DW_AT_name("nSkip")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$212, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$212, DW_AT_bit_size(0x04)
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$212, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$212, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$212, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$204, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$204, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$T$204, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$204


$C$DW$T$205	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$205, DW_AT_byte_size(0x01)
$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$213, DW_AT_name("bEnaFifo")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("bEnaFifo")
	.dwattr $C$DW$213, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$213, DW_AT_bit_size(0x01)
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$213, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$213, DW_AT_decl_line(0x141)
	.dwattr $C$DW$213, DW_AT_decl_column(0x0f)

$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$214, DW_AT_name("bFsOff")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("bFsOff")
	.dwattr $C$DW$214, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$214, DW_AT_bit_size(0x01)
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$214, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$214, DW_AT_decl_line(0x143)
	.dwattr $C$DW$214, DW_AT_decl_column(0x0f)

$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$215, DW_AT_name("bNoSync")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("bNoSync")
	.dwattr $C$DW$215, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$215, DW_AT_bit_size(0x01)
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$215, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$215, DW_AT_decl_line(0x145)
	.dwattr $C$DW$215, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$205, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$205, DW_AT_decl_line(0x140)
	.dwattr $C$DW$T$205, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$205


$C$DW$T$206	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$206, DW_AT_byte_size(0x01)
$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$216, DW_AT_name("triggerType")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$216, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$216, DW_AT_bit_size(0x04)
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$216, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$216, DW_AT_decl_line(0x149)
	.dwattr $C$DW$216, DW_AT_decl_column(0x0f)

$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$217, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$217, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$217, DW_AT_bit_size(0x01)
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$217, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$217, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$217, DW_AT_decl_column(0x0f)

$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$218, DW_AT_name("triggerNo")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$218, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$218, DW_AT_bit_size(0x02)
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$218, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$218, DW_AT_decl_column(0x0f)

$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$219, DW_AT_name("pastTrig")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$219, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$219, DW_AT_bit_size(0x01)
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$219, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$219, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$206, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$206, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$206, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$206


$C$DW$T$207	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$207, DW_AT_byte_size(0x01)
$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$220, DW_AT_name("triggerType")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$220, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$220, DW_AT_bit_size(0x04)
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$220, DW_AT_decl_line(0x162)
	.dwattr $C$DW$220, DW_AT_decl_column(0x0f)

$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$221, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$221, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$221, DW_AT_bit_size(0x01)
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$221, DW_AT_decl_line(0x163)
	.dwattr $C$DW$221, DW_AT_decl_column(0x0f)

$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$222, DW_AT_name("triggerNo")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$222, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$222, DW_AT_bit_size(0x02)
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$222, DW_AT_decl_line(0x165)
	.dwattr $C$DW$222, DW_AT_decl_column(0x0f)

$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$223, DW_AT_name("pastTrig")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$223, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$223, DW_AT_bit_size(0x01)
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$223, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0x166)
	.dwattr $C$DW$223, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$207, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$207, DW_AT_decl_line(0x161)
	.dwattr $C$DW$T$207, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$207


$C$DW$T$208	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$208, DW_AT_byte_size(0x01)
$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$224, DW_AT_name("rule")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$224, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$224, DW_AT_bit_size(0x04)
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$224, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$224, DW_AT_decl_column(0x0f)

$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$225, DW_AT_name("nSkip")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$225, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$225, DW_AT_bit_size(0x04)
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$225, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$225, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$208, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$208, DW_AT_decl_line(0x169)
	.dwattr $C$DW$T$208, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$208


$C$DW$T$209	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$209, DW_AT_byte_size(0x01)
$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$226, DW_AT_name("bUseCw")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("bUseCw")
	.dwattr $C$DW$226, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$226, DW_AT_bit_size(0x01)
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$226, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$226, DW_AT_decl_column(0x0f)

$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$227, DW_AT_name("bFsOff")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("bFsOff")
	.dwattr $C$DW$227, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$227, DW_AT_bit_size(0x01)
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$227, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$227, DW_AT_decl_line(0x170)
	.dwattr $C$DW$227, DW_AT_decl_column(0x0f)

$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$228, DW_AT_name("whitenMode")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("whitenMode")
	.dwattr $C$DW$228, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$228, DW_AT_bit_size(0x02)
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$228, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$228, DW_AT_decl_line(0x172)
	.dwattr $C$DW$228, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$209, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$209, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$T$209, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$209


$C$DW$T$210	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$210, DW_AT_byte_size(0x01)
$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$229, DW_AT_name("triggerType")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$229, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$229, DW_AT_bit_size(0x04)
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$229, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$229, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$229, DW_AT_decl_column(0x0f)

$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$230, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$230, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$230, DW_AT_bit_size(0x01)
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$230, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$230, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$230, DW_AT_decl_column(0x0f)

$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$231, DW_AT_name("triggerNo")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$231, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$231, DW_AT_bit_size(0x02)
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$231, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$231, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$231, DW_AT_decl_column(0x0f)

$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$232, DW_AT_name("pastTrig")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$232, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$232, DW_AT_bit_size(0x01)
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$232, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$232, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$232, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$210, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$210, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$210, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$210


$C$DW$T$211	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$211, DW_AT_byte_size(0x01)
$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$233, DW_AT_name("triggerType")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$233, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$233, DW_AT_bit_size(0x04)
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$233, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$233, DW_AT_decl_line(0x194)
	.dwattr $C$DW$233, DW_AT_decl_column(0x0f)

$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$234, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$234, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$234, DW_AT_bit_size(0x01)
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$234, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$234, DW_AT_decl_line(0x195)
	.dwattr $C$DW$234, DW_AT_decl_column(0x0f)

$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$235, DW_AT_name("triggerNo")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$235, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$235, DW_AT_bit_size(0x02)
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$235, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$235, DW_AT_decl_line(0x197)
	.dwattr $C$DW$235, DW_AT_decl_column(0x0f)

$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$236, DW_AT_name("pastTrig")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$236, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$236, DW_AT_bit_size(0x01)
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$236, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$236, DW_AT_decl_line(0x198)
	.dwattr $C$DW$236, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$211, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$211, DW_AT_decl_line(0x193)
	.dwattr $C$DW$T$211, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$211


$C$DW$T$212	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$212, DW_AT_byte_size(0x01)
$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$237, DW_AT_name("rule")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$237, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$237, DW_AT_bit_size(0x04)
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$237, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$237, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$237, DW_AT_decl_column(0x0f)

$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$238, DW_AT_name("nSkip")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$238, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$238, DW_AT_bit_size(0x04)
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$238, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$238, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$238, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$212, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$212, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$T$212, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$212


$C$DW$T$213	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$213, DW_AT_byte_size(0x01)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$239, DW_AT_name("triggerType")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$239, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$239, DW_AT_bit_size(0x04)
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$239, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$239, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$239, DW_AT_decl_column(0x0f)

$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$240, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$240, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$240, DW_AT_bit_size(0x01)
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$240, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$240, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$240, DW_AT_decl_column(0x0f)

$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$241, DW_AT_name("triggerNo")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$241, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$241, DW_AT_bit_size(0x02)
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$241, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$241, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$241, DW_AT_decl_column(0x0f)

$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$242, DW_AT_name("pastTrig")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$242, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$242, DW_AT_bit_size(0x01)
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$242, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$242, DW_AT_decl_line(0x1b6)
	.dwattr $C$DW$242, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$213, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$213


$C$DW$T$214	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$214, DW_AT_byte_size(0x01)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$243, DW_AT_name("rule")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$243, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$243, DW_AT_bit_size(0x04)
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$243, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$243, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$243, DW_AT_decl_column(0x0f)

$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$244, DW_AT_name("nSkip")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$244, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$244, DW_AT_bit_size(0x04)
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$244, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$244, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$244, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$214, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$214, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$T$214, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$214


$C$DW$T$215	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$215, DW_AT_byte_size(0x01)
$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$245, DW_AT_name("triggerType")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$245, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$245, DW_AT_bit_size(0x04)
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$245, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$245, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$245, DW_AT_decl_column(0x0f)

$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$246, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$246, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$246, DW_AT_bit_size(0x01)
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$246, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$246, DW_AT_decl_line(0x1d1)
	.dwattr $C$DW$246, DW_AT_decl_column(0x0f)

$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$247, DW_AT_name("triggerNo")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$247, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$247, DW_AT_bit_size(0x02)
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$247, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$247, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$247, DW_AT_decl_column(0x0f)

$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$248, DW_AT_name("pastTrig")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$248, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$248, DW_AT_bit_size(0x01)
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$248, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$248, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$248, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$215, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$215, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$T$215, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$215


$C$DW$T$216	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$216, DW_AT_byte_size(0x01)
$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$249, DW_AT_name("rule")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$249, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$249, DW_AT_bit_size(0x04)
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$249, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$249, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$249, DW_AT_decl_column(0x0f)

$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$250, DW_AT_name("nSkip")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$250, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$250, DW_AT_bit_size(0x04)
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$250, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$250, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$250, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$216, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$216, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$T$216, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$216


$C$DW$T$217	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$217, DW_AT_byte_size(0x01)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$251, DW_AT_name("triggerType")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$251, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$251, DW_AT_bit_size(0x04)
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$251, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$251, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$251, DW_AT_decl_column(0x0f)

$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$252, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$252, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$252, DW_AT_bit_size(0x01)
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$252, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$252, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$252, DW_AT_decl_column(0x0f)

$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$253, DW_AT_name("triggerNo")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$253, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$253, DW_AT_bit_size(0x02)
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$253, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$253, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$253, DW_AT_decl_column(0x0f)

$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$254, DW_AT_name("pastTrig")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$254, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$254, DW_AT_bit_size(0x01)
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$254, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$254, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$254, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$217, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$217, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$T$217, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$217


$C$DW$T$218	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$218, DW_AT_byte_size(0x01)
$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$255, DW_AT_name("rule")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$255, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$255, DW_AT_bit_size(0x04)
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$255, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$255, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$255, DW_AT_decl_column(0x0f)

$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$256, DW_AT_name("nSkip")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$256, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$256, DW_AT_bit_size(0x04)
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$256, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$256, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$256, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$218, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$218, DW_AT_decl_line(0x1f4)
	.dwattr $C$DW$T$218, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$218


$C$DW$T$219	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$219, DW_AT_byte_size(0x01)
$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$257, DW_AT_name("triggerType")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$257, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$257, DW_AT_bit_size(0x04)
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$257, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$257, DW_AT_decl_line(0x20a)
	.dwattr $C$DW$257, DW_AT_decl_column(0x0f)

$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$258, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$258, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$258, DW_AT_bit_size(0x01)
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$258, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$258, DW_AT_decl_line(0x20b)
	.dwattr $C$DW$258, DW_AT_decl_column(0x0f)

$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$259, DW_AT_name("triggerNo")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$259, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$259, DW_AT_bit_size(0x02)
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$259, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$259, DW_AT_decl_line(0x20d)
	.dwattr $C$DW$259, DW_AT_decl_column(0x0f)

$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$260, DW_AT_name("pastTrig")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$260, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$260, DW_AT_bit_size(0x01)
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$260, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$260, DW_AT_decl_line(0x20e)
	.dwattr $C$DW$260, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$219, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$219, DW_AT_decl_line(0x209)
	.dwattr $C$DW$T$219, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$219


$C$DW$T$220	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$220, DW_AT_byte_size(0x01)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$261, DW_AT_name("rule")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$261, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$261, DW_AT_bit_size(0x04)
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$261, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$261, DW_AT_decl_line(0x212)
	.dwattr $C$DW$261, DW_AT_decl_column(0x0f)

$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$262, DW_AT_name("nSkip")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$262, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$262, DW_AT_bit_size(0x04)
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$262, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$262, DW_AT_decl_line(0x213)
	.dwattr $C$DW$262, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$220, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$220, DW_AT_decl_line(0x211)
	.dwattr $C$DW$T$220, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$220


$C$DW$T$221	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$221, DW_AT_byte_size(0x01)
$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$263, DW_AT_name("triggerType")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$263, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$263, DW_AT_bit_size(0x04)
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
