;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
;* Date/Time created: Fri Apr  2 00:57:46 2021                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=none --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../smartrf_settings/smartrf_settings.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
	.sect	".const:patchImageProp"
	.align	4
	.elfsym	patchImageProp,SYM_SIZE(228)
patchImageProp:
	.bits		0x21000491,32
			; patchImageProp[0] @ 0
	.bits		0x21000459,32
			; patchImageProp[1] @ 32
	.bits		0x210004b1,32
			; patchImageProp[2] @ 64
	.bits		0x210004c5,32
			; patchImageProp[3] @ 96
	.bits		0x1b094904,32
			; patchImageProp[4] @ 128
	.bits		0x2988d003,32
			; patchImageProp[5] @ 160
	.bits		0x3438d102,32
			; patchImageProp[6] @ 192
	.bits		0x4c02e000,32
			; patchImageProp[7] @ 224
	.bits		0x47084902,32

	.dwattr $C$DW$113, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$113, DW_AT_decl_line(0x55e)
	.dwattr $C$DW$113, DW_AT_decl_column(0x05)

$C$DW$114	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$114, DW_AT_name("RF_GET_AVAIL_RAT_CH")
	.dwattr $C$DW$114, DW_AT_const_value(0x01)
	.dwattr $C$DW$114, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$114, DW_AT_decl_line(0x55f)
	.dwattr $C$DW$114, DW_AT_decl_column(0x05)

$C$DW$115	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$115, DW_AT_name("RF_GET_RADIO_STATE")
	.dwattr $C$DW$115, DW_AT_const_value(0x02)
	.dwattr $C$DW$115, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$115, DW_AT_decl_line(0x560)
	.dwattr $C$DW$115, DW_AT_decl_column(0x05)

$C$DW$116	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$116, DW_AT_name("RF_GET_SCHEDULE_MAP")
	.dwattr $C$DW$116, DW_AT_const_value(0x03)
	.dwattr $C$DW$116, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$116, DW_AT_decl_line(0x561)
	.dwattr $C$DW$116, DW_AT_decl_column(0x05)

$C$DW$117	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$117, DW_AT_name("RF_GET_CLIENT_LIST")
	.dwattr $C$DW$117, DW_AT_const_value(0x04)
	.dwattr $C$DW$117, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$117, DW_AT_decl_line(0x562)
	.dwattr $C$DW$117, DW_AT_decl_column(0x05)

$C$DW$118	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$118, DW_AT_name("RF_GET_CLIENT_SWITCHING_TIME")
	.dwattr $C$DW$118, DW_AT_const_value(0x05)
	.dwattr $C$DW$118, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$118, DW_AT_decl_line(0x563)
	.dwattr $C$DW$118, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$552, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$552, DW_AT_decl_line(0x55d)
	.dwattr $C$DW$T$552, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$552

$C$DW$T$553	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$553, DW_AT_name("RF_InfoType")
	.dwattr $C$DW$T$553, DW_AT_type(*$C$DW$T$552)
	.dwattr $C$DW$T$553, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$553, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$553, DW_AT_decl_line(0x564)
	.dwattr $C$DW$T$553, DW_AT_decl_column(0x03)


$C$DW$T$554	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$554, DW_AT_byte_size(0x04)
$C$DW$119	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$119, DW_AT_name("RF_AllowDelayNone")
	.dwattr $C$DW$119, DW_AT_const_value(0x00)
	.dwattr $C$DW$119, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$119, DW_AT_decl_line(0x65c)
	.dwattr $C$DW$119, DW_AT_decl_column(0x05)

$C$DW$120	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$120, DW_AT_name("RF_AllowDelayAny")
	.dwattr $C$DW$120, DW_AT_const_value(-1)
	.dwattr $C$DW$120, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$120, DW_AT_decl_line(0x65d)
	.dwattr $C$DW$120, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$554, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$554, DW_AT_decl_line(0x65b)
	.dwattr $C$DW$T$554, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$554

$C$DW$T$555	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$555, DW_AT_name("RF_AllowDelay")
	.dwattr $C$DW$T$555, DW_AT_type(*$C$DW$T$554)
	.dwattr $C$DW$T$555, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$555, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$555, DW_AT_decl_line(0x65e)
	.dwattr $C$DW$T$555, DW_AT_decl_column(0x03)


$C$DW$T$556	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$556, DW_AT_byte_size(0x01)
$C$DW$121	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$121, DW_AT_name("RF_RatChannelAny")
	.dwattr $C$DW$121, DW_AT_const_value(-1)
	.dwattr $C$DW$121, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$121, DW_AT_decl_line(0x67e)
	.dwattr $C$DW$121, DW_AT_decl_column(0x05)

$C$DW$122	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$122, DW_AT_name("RF_RatChannel0")
	.dwattr $C$DW$122, DW_AT_const_value(0x00)
	.dwattr $C$DW$122, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$122, DW_AT_decl_line(0x67f)
	.dwattr $C$DW$122, DW_AT_decl_column(0x05)

$C$DW$123	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$123, DW_AT_name("RF_RatChannel1")
	.dwattr $C$DW$123, DW_AT_const_value(0x01)
	.dwattr $C$DW$123, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$123, DW_AT_decl_line(0x680)
	.dwattr $C$DW$123, DW_AT_decl_column(0x05)

$C$DW$124	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$124, DW_AT_name("RF_RatChannel2")
	.dwattr $C$DW$124, DW_AT_const_value(0x02)
	.dwattr $C$DW$124, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$124, DW_AT_decl_line(0x681)
	.dwattr $C$DW$124, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$556, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$556, DW_AT_decl_line(0x67d)
	.dwattr $C$DW$T$556, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$556

$C$DW$T$557	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$557, DW_AT_name("RF_RatSelectChannel")
	.dwattr $C$DW$T$557, DW_AT_type(*$C$DW$T$556)
	.dwattr $C$DW$T$557, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$557, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$557, DW_AT_decl_line(0x682)
	.dwattr $C$DW$T$557, DW_AT_decl_column(0x03)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
$C$DW$125	.dwtag  DW_TAG_member
	.dwattr $C$DW$125, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$125, DW_AT_name("rfMode")
	.dwattr $C$DW$125, DW_AT_TI_symbol_name("rfMode")
	.dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$125, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$125, DW_AT_decl_line(0x437)
	.dwattr $C$DW$125, DW_AT_decl_column(0x0d)

$C$DW$126	.dwtag  DW_TAG_member
	.dwattr $C$DW$126, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$126, DW_AT_name("cpePatchFxn")
	.dwattr $C$DW$126, DW_AT_TI_symbol_name("cpePatchFxn")
	.dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$126, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$126, DW_AT_decl_line(0x438)
	.dwattr $C$DW$126, DW_AT_decl_column(0x0c)

$C$DW$127	.dwtag  DW_TAG_member
	.dwattr $C$DW$127, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$127, DW_AT_name("mcePatchFxn")
	.dwattr $C$DW$127, DW_AT_TI_symbol_name("mcePatchFxn")
	.dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$127, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$127, DW_AT_decl_line(0x439)
	.dwattr $C$DW$127, DW_AT_decl_column(0x0c)

$C$DW$128	.dwtag  DW_TAG_member
	.dwattr $C$DW$128, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$128, DW_AT_name("rfePatchFxn")
	.dwattr $C$DW$128, DW_AT_TI_symbol_name("rfePatchFxn")
	.dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$128, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$128, DW_AT_decl_line(0x43a)
	.dwattr $C$DW$128, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$25, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x436)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$25

$C$DW$T$274	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$274, DW_AT_name("RF_Mode")
	.dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$274, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/drivers/rf/RF.h")
	.dwattr $C$DW$T$274, DW_AT_decl_line(0x43b)
	.dwattr $C$DW$T$274, DW_AT_decl_column(0x03)

$C$DW$T$275	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$275, DW_AT_type(*$C$DW$T$274)
	.dwattr $C$DW$T$275, DW_AT_address_class(0x20)


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
$C$DW$129	.dwtag  DW_TAG_member
	.dwattr $C$DW$129, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$129, DW_AT_name("triggerType")
	.dwattr $C$DW$129, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$129, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$129, DW_AT_bit_size(0x04)
	.dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$129, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$129, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$129, DW_AT_decl_column(0x0f)

$C$DW$130	.dwtag  DW_TAG_member
	.dwattr $C$DW$130, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$130, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$130, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$130, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$130, DW_AT_bit_size(0x01)
	.dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$130, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$130, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$130, DW_AT_decl_column(0x0f)

$C$DW$131	.dwtag  DW_TAG_member
	.dwattr $C$DW$131, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$131, DW_AT_name("triggerNo")
	.dwattr $C$DW$131, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$131, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$131, DW_AT_bit_size(0x02)
	.dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$131, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$131, DW_AT_decl_line(0x81)
	.dwattr $C$DW$131, DW_AT_decl_column(0x0f)

$C$DW$132	.dwtag  DW_TAG_member
	.dwattr $C$DW$132, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$132, DW_AT_name("pastTrig")
	.dwattr $C$DW$132, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$132, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$132, DW_AT_bit_size(0x01)
	.dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$132, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$132, DW_AT_decl_line(0x82)
	.dwattr $C$DW$132, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$26, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$26


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
$C$DW$133	.dwtag  DW_TAG_member
	.dwattr $C$DW$133, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$133, DW_AT_name("rule")
	.dwattr $C$DW$133, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$133, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$133, DW_AT_bit_size(0x04)
	.dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$133, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$133, DW_AT_decl_line(0x86)
	.dwattr $C$DW$133, DW_AT_decl_column(0x0f)

$C$DW$134	.dwtag  DW_TAG_member
	.dwattr $C$DW$134, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$134, DW_AT_name("nSkip")
	.dwattr $C$DW$134, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$134, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$134, DW_AT_bit_size(0x04)
	.dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$134, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$134, DW_AT_decl_line(0x87)
	.dwattr $C$DW$134, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$27, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x85)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$27


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
$C$DW$135	.dwtag  DW_TAG_member
	.dwattr $C$DW$135, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$135, DW_AT_name("triggerType")
	.dwattr $C$DW$135, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$135, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$135, DW_AT_bit_size(0x04)
	.dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$135, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$135, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$135, DW_AT_decl_column(0x0f)

$C$DW$136	.dwtag  DW_TAG_member
	.dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$136, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$136, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$136, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$136, DW_AT_bit_size(0x01)
	.dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$136, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$136, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$136, DW_AT_decl_column(0x0f)

$C$DW$137	.dwtag  DW_TAG_member
	.dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$137, DW_AT_name("triggerNo")
	.dwattr $C$DW$137, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$137, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$137, DW_AT_bit_size(0x02)
	.dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$137, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$137, DW_AT_decl_line(0x1d2)
	.dwattr $C$DW$137, DW_AT_decl_column(0x0f)

$C$DW$138	.dwtag  DW_TAG_member
	.dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$138, DW_AT_name("pastTrig")
	.dwattr $C$DW$138, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$138, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$138, DW_AT_bit_size(0x01)
	.dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$138, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$138, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$138, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$28, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$28


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
$C$DW$139	.dwtag  DW_TAG_member
	.dwattr $C$DW$139, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$139, DW_AT_name("rule")
	.dwattr $C$DW$139, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$139, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$139, DW_AT_bit_size(0x04)
	.dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$139, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$139, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$139, DW_AT_decl_column(0x0f)

$C$DW$140	.dwtag  DW_TAG_member
	.dwattr $C$DW$140, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$140, DW_AT_name("nSkip")
	.dwattr $C$DW$140, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$140, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$140, DW_AT_bit_size(0x04)
	.dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$140, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$140, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$140, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$29, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$29


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
$C$DW$141	.dwtag  DW_TAG_member
	.dwattr $C$DW$141, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$141, DW_AT_name("modType")
	.dwattr $C$DW$141, DW_AT_TI_symbol_name("modType")
	.dwattr $C$DW$141, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$141, DW_AT_bit_size(0x03)
	.dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$141, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$141, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$141, DW_AT_decl_column(0x10)

$C$DW$142	.dwtag  DW_TAG_member
	.dwattr $C$DW$142, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$142, DW_AT_name("deviation")
	.dwattr $C$DW$142, DW_AT_TI_symbol_name("deviation")
	.dwattr $C$DW$142, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$142, DW_AT_bit_size(0x0d)
	.dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$142, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$142, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$142, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$32, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$32


$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
$C$DW$143	.dwtag  DW_TAG_member
	.dwattr $C$DW$143, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$143, DW_AT_name("preScale")
	.dwattr $C$DW$143, DW_AT_TI_symbol_name("preScale")
	.dwattr $C$DW$143, DW_AT_bit_offset(0x1c)
	.dwattr $C$DW$143, DW_AT_bit_size(0x04)
	.dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$143, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$143, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$143, DW_AT_decl_column(0x10)

$C$DW$144	.dwtag  DW_TAG_member
	.dwattr $C$DW$144, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$144, DW_AT_name("rateWord")
	.dwattr $C$DW$144, DW_AT_TI_symbol_name("rateWord")
	.dwattr $C$DW$144, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$144, DW_AT_bit_size(0x15)
	.dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$144, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$144, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$144, DW_AT_decl_column(0x10)

$C$DW$145	.dwtag  DW_TAG_member
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$145, DW_AT_name("decimMode")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("decimMode")
	.dwattr $C$DW$145, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$145, DW_AT_bit_size(0x03)
	.dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$145, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$145, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$145, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$35, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x1e0)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$35


$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
$C$DW$146	.dwtag  DW_TAG_member
	.dwattr $C$DW$146, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$146, DW_AT_name("nPreamBytes")
	.dwattr $C$DW$146, DW_AT_TI_symbol_name("nPreamBytes")
	.dwattr $C$DW$146, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$146, DW_AT_bit_size(0x06)
	.dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$146, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$146, DW_AT_decl_column(0x0f)

$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$147, DW_AT_name("preamMode")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("preamMode")
	.dwattr $C$DW$147, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$147, DW_AT_bit_size(0x02)
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$147, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$36, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$36


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$148, DW_AT_name("nSwBits")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("nSwBits")
	.dwattr $C$DW$148, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$148, DW_AT_bit_size(0x06)
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$148, DW_AT_decl_column(0x10)

$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$149, DW_AT_name("bBitReversal")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("bBitReversal")
	.dwattr $C$DW$149, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$149, DW_AT_bit_size(0x01)
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$149, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$149, DW_AT_decl_column(0x10)

$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$150, DW_AT_name("bMsbFirst")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("bMsbFirst")
	.dwattr $C$DW$150, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$150, DW_AT_bit_size(0x01)
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$150, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$150, DW_AT_decl_column(0x10)

$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$151, DW_AT_name("fecMode")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("fecMode")
	.dwattr $C$DW$151, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$151, DW_AT_bit_size(0x04)
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$151, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$151, DW_AT_decl_column(0x10)

$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$152, DW_AT_name("whitenMode")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("whitenMode")
	.dwattr $C$DW$152, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$152, DW_AT_bit_size(0x03)
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$152, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0x202)
	.dwattr $C$DW$152, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$37, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$37


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$153, DW_AT_name("frontEndMode")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("frontEndMode")
	.dwattr $C$DW$153, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$153, DW_AT_bit_size(0x03)
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$153, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x20c)
	.dwattr $C$DW$153, DW_AT_decl_column(0x10)

$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$154, DW_AT_name("biasMode")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("biasMode")
	.dwattr $C$DW$154, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$154, DW_AT_bit_size(0x01)
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$154, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x212)
	.dwattr $C$DW$154, DW_AT_decl_column(0x10)

$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$155, DW_AT_name("analogCfgMode")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("analogCfgMode")
	.dwattr $C$DW$155, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$155, DW_AT_bit_size(0x06)
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$155, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x214)
	.dwattr $C$DW$155, DW_AT_decl_column(0x10)

$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$156, DW_AT_name("bNoFsPowerUp")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("bNoFsPowerUp")
	.dwattr $C$DW$156, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$156, DW_AT_bit_size(0x01)
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$156, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x21b)
	.dwattr $C$DW$156, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$38, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x20b)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$38


$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$157, DW_AT_name("triggerType")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$157, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$157, DW_AT_bit_size(0x04)
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$157, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$157, DW_AT_decl_column(0x0f)

$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$158, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$158, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$158, DW_AT_bit_size(0x01)
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$158, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$158, DW_AT_decl_column(0x0f)

$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$159, DW_AT_name("triggerNo")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$159, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$159, DW_AT_bit_size(0x02)
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$159, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$159, DW_AT_decl_column(0x0f)

$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$160, DW_AT_name("pastTrig")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$160, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$160, DW_AT_bit_size(0x01)
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$160, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$160, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$39, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$39


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$161, DW_AT_name("rule")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$161, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$161, DW_AT_bit_size(0x04)
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$161, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$161, DW_AT_decl_column(0x0f)

$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$162, DW_AT_name("nSkip")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$162, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$162, DW_AT_bit_size(0x04)
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$162, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$162, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$40, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$40


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$163, DW_AT_name("bTxMode")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("bTxMode")
	.dwattr $C$DW$163, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$163, DW_AT_bit_size(0x01)
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$163, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x101)
	.dwattr $C$DW$163, DW_AT_decl_column(0x0f)

$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$164, DW_AT_name("refFreq")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("refFreq")
	.dwattr $C$DW$164, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$164, DW_AT_bit_size(0x06)
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$164, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x103)
	.dwattr $C$DW$164, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$41, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$41


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$165, DW_AT_name("triggerType")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$165, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$165, DW_AT_bit_size(0x04)
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$165, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x86)
	.dwattr $C$DW$165, DW_AT_decl_column(0x0f)

$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$166, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$166, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$166, DW_AT_bit_size(0x01)
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x87)
	.dwattr $C$DW$166, DW_AT_decl_column(0x0f)

$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$167, DW_AT_name("triggerNo")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$167, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$167, DW_AT_bit_size(0x02)
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x89)
	.dwattr $C$DW$167, DW_AT_decl_column(0x0f)

$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$168, DW_AT_name("pastTrig")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$168, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$168, DW_AT_bit_size(0x01)
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$168, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$42, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x85)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$42


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$169, DW_AT_name("rule")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$169, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$169, DW_AT_bit_size(0x04)
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$169, DW_AT_decl_column(0x0f)

$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$170, DW_AT_name("nSkip")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$170, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$170, DW_AT_bit_size(0x04)
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$170, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$43, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$43


$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$171, DW_AT_name("bFsOff")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("bFsOff")
	.dwattr $C$DW$171, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$171, DW_AT_bit_size(0x01)
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x92)
	.dwattr $C$DW$171, DW_AT_decl_column(0x0f)

$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$172, DW_AT_name("bUseCrc")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("bUseCrc")
	.dwattr $C$DW$172, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$172, DW_AT_bit_size(0x01)
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x95)
	.dwattr $C$DW$172, DW_AT_decl_column(0x0f)

$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$173, DW_AT_name("bVarLen")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("bVarLen")
	.dwattr $C$DW$173, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$173, DW_AT_bit_size(0x01)
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x97)
	.dwattr $C$DW$173, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$44, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x91)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$44


$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$174, DW_AT_name("triggerType")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$174, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$174, DW_AT_bit_size(0x04)
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0xad)
	.dwattr $C$DW$174, DW_AT_decl_column(0x0f)

$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$175, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$175, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$175, DW_AT_bit_size(0x01)
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0xae)
	.dwattr $C$DW$175, DW_AT_decl_column(0x0f)

$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$176, DW_AT_name("triggerNo")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$176, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$176, DW_AT_bit_size(0x02)
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$176, DW_AT_decl_column(0x0f)

$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$177, DW_AT_name("pastTrig")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$177, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$177, DW_AT_bit_size(0x01)
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$177, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$45, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0xac)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$45


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$178, DW_AT_name("rule")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$178, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$178, DW_AT_bit_size(0x04)
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$178, DW_AT_decl_column(0x0f)

$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$179, DW_AT_name("nSkip")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$179, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$179, DW_AT_bit_size(0x04)
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$179, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$46, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$46


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$180, DW_AT_name("bFsOff")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("bFsOff")
	.dwattr $C$DW$180, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$180, DW_AT_bit_size(0x01)
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$180, DW_AT_decl_column(0x0f)

$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$181, DW_AT_name("bRepeatOk")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("bRepeatOk")
	.dwattr $C$DW$181, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$181, DW_AT_bit_size(0x01)
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$181, DW_AT_decl_column(0x0f)

$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$182, DW_AT_name("bRepeatNok")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("bRepeatNok")
	.dwattr $C$DW$182, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$182, DW_AT_bit_size(0x01)
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$182, DW_AT_decl_column(0x0f)

$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$183, DW_AT_name("bUseCrc")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("bUseCrc")
	.dwattr $C$DW$183, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$183, DW_AT_bit_size(0x01)
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$183, DW_AT_decl_column(0x0f)

$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$184, DW_AT_name("bVarLen")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("bVarLen")
	.dwattr $C$DW$184, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$184, DW_AT_bit_size(0x01)
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$184, DW_AT_decl_column(0x0f)

$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$185, DW_AT_name("bChkAddress")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("bChkAddress")
	.dwattr $C$DW$185, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$185, DW_AT_bit_size(0x01)
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$185, DW_AT_decl_column(0x0f)

$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$186, DW_AT_name("endType")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("endType")
	.dwattr $C$DW$186, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$186, DW_AT_bit_size(0x01)
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$186, DW_AT_decl_column(0x0f)

$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$187, DW_AT_name("filterOp")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("filterOp")
	.dwattr $C$DW$187, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$187, DW_AT_bit_size(0x01)
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$187, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$47, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$47


$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$188, DW_AT_name("bAutoFlushIgnored")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("bAutoFlushIgnored")
	.dwattr $C$DW$188, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$188, DW_AT_bit_size(0x01)
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$188, DW_AT_decl_column(0x0f)

$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$189, DW_AT_name("bAutoFlushCrcErr")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("bAutoFlushCrcErr")
	.dwattr $C$DW$189, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$189, DW_AT_bit_size(0x01)
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$189, DW_AT_decl_column(0x0f)

$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$190, DW_AT_name("bIncludeHdr")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("bIncludeHdr")
	.dwattr $C$DW$190, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$190, DW_AT_bit_size(0x01)
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0xce)
	.dwattr $C$DW$190, DW_AT_decl_column(0x0f)

$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$191, DW_AT_name("bIncludeCrc")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("bIncludeCrc")
	.dwattr $C$DW$191, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$191, DW_AT_bit_size(0x01)
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$191, DW_AT_decl_column(0x0f)

$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$192, DW_AT_name("bAppendRssi")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("bAppendRssi")
	.dwattr $C$DW$192, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$192, DW_AT_bit_size(0x01)
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$192, DW_AT_decl_column(0x0f)

$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$193, DW_AT_name("bAppendTimestamp")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("bAppendTimestamp")
	.dwattr $C$DW$193, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$193, DW_AT_bit_size(0x01)
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$193, DW_AT_decl_column(0x0f)

$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$194, DW_AT_name("bAppendStatus")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("bAppendStatus")
	.dwattr $C$DW$194, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$194, DW_AT_bit_size(0x01)
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$194, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$48, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$48


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$195, DW_AT_name("triggerType")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$195, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$195, DW_AT_bit_size(0x04)
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$195, DW_AT_decl_column(0x0f)

$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$196, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$196, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$196, DW_AT_bit_size(0x01)
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$196, DW_AT_decl_column(0x0f)

$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$197, DW_AT_name("triggerNo")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$197, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$197, DW_AT_bit_size(0x02)
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0xde)
	.dwattr $C$DW$197, DW_AT_decl_column(0x0f)

$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$198, DW_AT_name("pastTrig")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$198, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$198, DW_AT_bit_size(0x01)
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$198, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$49, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_prop_cmd.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$49


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x08)
$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$199, DW_AT_name("pCurrEntry")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("pCurrEntry")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_mailbox.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$199, DW_AT_decl_column(0x0d)

$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$200, DW_AT_name("pLastEntry")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("pLastEntry")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_mailbox.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0x40)
	.dwattr $C$DW$200, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$51, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_mailbox.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$51

$C$DW$T$392	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$392, DW_AT_name("dataQueue_t")
	.dwattr $C$DW$T$392, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$392, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$392, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_mailbox.h")
	.dwattr $C$DW$T$392, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$392, DW_AT_decl_column(0x03)

$C$DW$T$393	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$393, DW_AT_type(*$C$DW$T$392)
	.dwattr $C$DW$T$393, DW_AT_address_class(0x20)


$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$201, DW_AT_name("triggerType")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$201, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$201, DW_AT_bit_size(0x04)
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0x162)
	.dwattr $C$DW$201, DW_AT_decl_column(0x0f)

$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$202, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$202, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$202, DW_AT_bit_size(0x01)
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0x163)
	.dwattr $C$DW$202, DW_AT_decl_column(0x0f)

$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$203, DW_AT_name("triggerNo")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$203, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$203, DW_AT_bit_size(0x02)
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0x165)
	.dwattr $C$DW$203, DW_AT_decl_column(0x0f)

$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$204, DW_AT_name("pastTrig")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$204, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$204, DW_AT_bit_size(0x01)
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0x166)
	.dwattr $C$DW$204, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$52, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x161)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$52


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$205, DW_AT_name("rule")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$205, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$205, DW_AT_bit_size(0x04)
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$205, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$205, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$205, DW_AT_decl_column(0x0f)

$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$206, DW_AT_name("nSkip")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$206, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$206, DW_AT_bit_size(0x04)
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$206, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$53, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x169)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$53


$C$DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$207, DW_AT_name("bUseCw")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("bUseCw")
	.dwattr $C$DW$207, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$207, DW_AT_bit_size(0x01)
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$207, DW_AT_decl_column(0x0f)

$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$208, DW_AT_name("bFsOff")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("bFsOff")
	.dwattr $C$DW$208, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$208, DW_AT_bit_size(0x01)
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0x170)
	.dwattr $C$DW$208, DW_AT_decl_column(0x0f)

$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$209, DW_AT_name("whitenMode")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("whitenMode")
	.dwattr $C$DW$209, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$209, DW_AT_bit_size(0x02)
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0x172)
	.dwattr $C$DW$209, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$54, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$54


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$210, DW_AT_name("triggerType")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$210, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$210, DW_AT_bit_size(0x04)
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$210, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$210, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$210, DW_AT_decl_column(0x0f)

$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$211, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$211, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$211, DW_AT_bit_size(0x01)
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$211, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$211, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$211, DW_AT_decl_column(0x0f)

$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$212, DW_AT_name("triggerNo")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$212, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$212, DW_AT_bit_size(0x02)
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$212, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$212, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$212, DW_AT_decl_column(0x0f)

$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$213, DW_AT_name("pastTrig")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$213, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$213, DW_AT_bit_size(0x01)
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$213, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$213, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$213, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$55, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$55


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x10)
$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$214, DW_AT_name("__max_align1")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$214, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$214, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$214, DW_AT_decl_column(0x0c)

$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$215, DW_AT_name("__max_align2")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$215, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$215, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$215, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$56, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$56

$C$DW$T$558	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$558, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$558, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$558, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$558, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm_20.2.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$558, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$558, DW_AT_decl_column(0x03)


$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$216, DW_AT_name("triggerType")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$216, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$216, DW_AT_bit_size(0x04)
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$216, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$216, DW_AT_decl_line(0x99)
	.dwattr $C$DW$216, DW_AT_decl_column(0x0f)

$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$217, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$217, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$217, DW_AT_bit_size(0x01)
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$217, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$217, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$217, DW_AT_decl_column(0x0f)

$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$218, DW_AT_name("triggerNo")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$218, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$218, DW_AT_bit_size(0x02)
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$218, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$218, DW_AT_decl_column(0x0f)

$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$219, DW_AT_name("pastTrig")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$219, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$219, DW_AT_bit_size(0x01)
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$219, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$219, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$57, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x98)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$57


$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$220, DW_AT_name("rule")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$220, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$220, DW_AT_bit_size(0x04)
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$220, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$220, DW_AT_decl_column(0x0f)

$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$221, DW_AT_name("nSkip")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$221, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$221, DW_AT_bit_size(0x04)
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$221, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$221, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$58, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$58


$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x01)
$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$222, DW_AT_name("triggerType")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$222, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$222, DW_AT_bit_size(0x04)
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$222, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$222, DW_AT_decl_column(0x0f)

$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$223, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$223, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$223, DW_AT_bit_size(0x01)
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$223, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$223, DW_AT_decl_column(0x0f)

$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$224, DW_AT_name("triggerNo")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$224, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$224, DW_AT_bit_size(0x02)
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$224, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$224, DW_AT_decl_column(0x0f)

$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$225, DW_AT_name("pastTrig")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$225, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$225, DW_AT_bit_size(0x01)
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$225, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$225, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$59, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$59


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$226, DW_AT_name("rule")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$226, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$226, DW_AT_bit_size(0x04)
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$226, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$226, DW_AT_decl_column(0x0f)

$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$227, DW_AT_name("nSkip")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$227, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$227, DW_AT_bit_size(0x04)
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$227, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$227, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$227, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$60, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$60


$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x02)
$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$228, DW_AT_name("frontEndMode")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("frontEndMode")
	.dwattr $C$DW$228, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$228, DW_AT_bit_size(0x03)
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$228, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$228, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$228, DW_AT_decl_column(0x10)

$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$229, DW_AT_name("biasMode")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("biasMode")
	.dwattr $C$DW$229, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$229, DW_AT_bit_size(0x01)
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$229, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$229, DW_AT_decl_line(0xce)
	.dwattr $C$DW$229, DW_AT_decl_column(0x10)

$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$230, DW_AT_name("analogCfgMode")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("analogCfgMode")
	.dwattr $C$DW$230, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$230, DW_AT_bit_size(0x06)
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$230, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$230, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$230, DW_AT_decl_column(0x10)

$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$231, DW_AT_name("bNoFsPowerUp")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("bNoFsPowerUp")
	.dwattr $C$DW$231, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$231, DW_AT_bit_size(0x01)
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$231, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$231, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$231, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$61, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$61


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x01)
$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$232, DW_AT_name("triggerType")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$232, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$232, DW_AT_bit_size(0x04)
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$232, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$232, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$232, DW_AT_decl_column(0x0f)

$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$233, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$233, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$233, DW_AT_bit_size(0x01)
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$233, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$233, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$233, DW_AT_decl_column(0x0f)

$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$234, DW_AT_name("triggerNo")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$234, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$234, DW_AT_bit_size(0x02)
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$234, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$234, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$234, DW_AT_decl_column(0x0f)

$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$235, DW_AT_name("pastTrig")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$235, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$235, DW_AT_bit_size(0x01)
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$235, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$235, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$235, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$62, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x119)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$62


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$236, DW_AT_name("rule")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$236, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$236, DW_AT_bit_size(0x04)
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$236, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$236, DW_AT_decl_line(0x122)
	.dwattr $C$DW$236, DW_AT_decl_column(0x0f)

$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$237, DW_AT_name("nSkip")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$237, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$237, DW_AT_bit_size(0x04)
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$237, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$237, DW_AT_decl_line(0x123)
	.dwattr $C$DW$237, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$63, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x121)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$63


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$238, DW_AT_name("triggerType")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$238, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$238, DW_AT_bit_size(0x04)
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$238, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$238, DW_AT_decl_line(0x135)
	.dwattr $C$DW$238, DW_AT_decl_column(0x0f)

$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$239, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$239, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$239, DW_AT_bit_size(0x01)
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$239, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$239, DW_AT_decl_line(0x136)
	.dwattr $C$DW$239, DW_AT_decl_column(0x0f)

$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$240, DW_AT_name("triggerNo")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$240, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$240, DW_AT_bit_size(0x02)
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$240, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$240, DW_AT_decl_line(0x138)
	.dwattr $C$DW$240, DW_AT_decl_column(0x0f)

$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$241, DW_AT_name("pastTrig")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$241, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$241, DW_AT_bit_size(0x01)
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$241, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$241, DW_AT_decl_line(0x139)
	.dwattr $C$DW$241, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$64, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x134)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$64


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$242, DW_AT_name("rule")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("rule")
	.dwattr $C$DW$242, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$242, DW_AT_bit_size(0x04)
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$242, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$242, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$242, DW_AT_decl_column(0x0f)

$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$243, DW_AT_name("nSkip")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("nSkip")
	.dwattr $C$DW$243, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$243, DW_AT_bit_size(0x04)
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$243, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$243, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$243, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$65, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$65


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$244, DW_AT_name("bEnaFifo")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("bEnaFifo")
	.dwattr $C$DW$244, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$244, DW_AT_bit_size(0x01)
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$244, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$244, DW_AT_decl_line(0x141)
	.dwattr $C$DW$244, DW_AT_decl_column(0x0f)

$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$245, DW_AT_name("bFsOff")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("bFsOff")
	.dwattr $C$DW$245, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$245, DW_AT_bit_size(0x01)
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$245, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$245, DW_AT_decl_line(0x143)
	.dwattr $C$DW$245, DW_AT_decl_column(0x0f)

$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$246, DW_AT_name("bNoSync")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("bNoSync")
	.dwattr $C$DW$246, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$246, DW_AT_bit_size(0x01)
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$246, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$246, DW_AT_decl_line(0x145)
	.dwattr $C$DW$246, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$66, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x140)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$66


$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$247, DW_AT_name("triggerType")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$247, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$247, DW_AT_bit_size(0x04)
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$247, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$247, DW_AT_decl_line(0x149)
	.dwattr $C$DW$247, DW_AT_decl_column(0x0f)

$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$248, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$248, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$248, DW_AT_bit_size(0x01)
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$248, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$248, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$248, DW_AT_decl_column(0x0f)

$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$249, DW_AT_name("triggerNo")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$249, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$249, DW_AT_bit_size(0x02)
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$249, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$249, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$249, DW_AT_decl_column(0x0f)

$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$250, DW_AT_name("pastTrig")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$250, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$250, DW_AT_bit_size(0x01)
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$250, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$250, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$250, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$67, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$67


$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x01)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$251, DW_AT_name("triggerType")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("triggerType")
	.dwattr $C$DW$251, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$251, DW_AT_bit_size(0x04)
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$251, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$251, DW_AT_decl_line(0x194)
	.dwattr $C$DW$251, DW_AT_decl_column(0x0f)

$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$252, DW_AT_name("bEnaCmd")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("bEnaCmd")
	.dwattr $C$DW$252, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$252, DW_AT_bit_size(0x01)
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$252, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$252, DW_AT_decl_line(0x195)
	.dwattr $C$DW$252, DW_AT_decl_column(0x0f)

$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$253, DW_AT_name("triggerNo")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("triggerNo")
	.dwattr $C$DW$253, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$253, DW_AT_bit_size(0x02)
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$253, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$253, DW_AT_decl_line(0x197)
	.dwattr $C$DW$253, DW_AT_decl_column(0x0f)

$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$254, DW_AT_name("pastTrig")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("pastTrig")
	.dwattr $C$DW$254, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$254, DW_AT_bit_size(0x01)
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$254, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$254, DW_AT_decl_line(0x198)
	.dwattr $C$DW$254, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$68, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devices/cc26x0r2/driverlib/rf_common_cmd.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x193)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$68


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x01)
