TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
       3                    ;* Date/Time created: Fri Apr  2 00:57:46 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../smartrf_settings/smartrf_settings_predefined.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
      13 00000000                   .sect   ".const:patchImageProp"
      14                            .align  4

    4359                            .dwattr $C$DW$121, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4360                            .dwattr $C$DW$121, DW_AT_decl_line(0x65c)
    4361                            .dwattr $C$DW$121, DW_AT_decl_column(0x05)
    4362                    
    4363                    $C$DW$122       .dwtag  DW_TAG_enumerator
    4364                            .dwattr $C$DW$122, DW_AT_name("RF_AllowDelayAny")
    4365                            .dwattr $C$DW$122, DW_AT_const_value(-1)
    4366                            .dwattr $C$DW$122, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4367                            .dwattr $C$DW$122, DW_AT_decl_line(0x65d)
    4368                            .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    4369                    
    4370                            .dwattr $C$DW$T$554, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4371                            .dwattr $C$DW$T$554, DW_AT_decl_line(0x65b)
    4372                            .dwattr $C$DW$T$554, DW_AT_decl_column(0x0e)
    4373                            .dwendtag $C$DW$T$554
    4374                    
    4375                    $C$DW$T$555     .dwtag  DW_TAG_typedef
    4376                            .dwattr $C$DW$T$555, DW_AT_name("RF_AllowDelay")
    4377                            .dwattr $C$DW$T$555, DW_AT_type(*$C$DW$T$554)
    4378                            .dwattr $C$DW$T$555, DW_AT_language(DW_LANG_C)
    4379                            .dwattr $C$DW$T$555, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4380                            .dwattr $C$DW$T$555, DW_AT_decl_line(0x65e)
    4381                            .dwattr $C$DW$T$555, DW_AT_decl_column(0x03)
    4382                    
    4383                    
    4384                    $C$DW$T$556     .dwtag  DW_TAG_enumeration_type
    4385                            .dwattr $C$DW$T$556, DW_AT_byte_size(0x01)
    4386                    $C$DW$123       .dwtag  DW_TAG_enumerator
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   81

    4387                            .dwattr $C$DW$123, DW_AT_name("RF_RatChannelAny")
    4388                            .dwattr $C$DW$123, DW_AT_const_value(-1)
    4389                            .dwattr $C$DW$123, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4390                            .dwattr $C$DW$123, DW_AT_decl_line(0x67e)
    4391                            .dwattr $C$DW$123, DW_AT_decl_column(0x05)
    4392                    
    4393                    $C$DW$124       .dwtag  DW_TAG_enumerator
    4394                            .dwattr $C$DW$124, DW_AT_name("RF_RatChannel0")
    4395                            .dwattr $C$DW$124, DW_AT_const_value(0x00)
    4396                            .dwattr $C$DW$124, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4397                            .dwattr $C$DW$124, DW_AT_decl_line(0x67f)
    4398                            .dwattr $C$DW$124, DW_AT_decl_column(0x05)
    4399                    
    4400                    $C$DW$125       .dwtag  DW_TAG_enumerator
    4401                            .dwattr $C$DW$125, DW_AT_name("RF_RatChannel1")
    4402                            .dwattr $C$DW$125, DW_AT_const_value(0x01)
    4403                            .dwattr $C$DW$125, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4404                            .dwattr $C$DW$125, DW_AT_decl_line(0x680)
    4405                            .dwattr $C$DW$125, DW_AT_decl_column(0x05)
    4406                    
    4407                    $C$DW$126       .dwtag  DW_TAG_enumerator
    4408                            .dwattr $C$DW$126, DW_AT_name("RF_RatChannel2")
    4409                            .dwattr $C$DW$126, DW_AT_const_value(0x02)
    4410                            .dwattr $C$DW$126, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4411                            .dwattr $C$DW$126, DW_AT_decl_line(0x681)
    4412                            .dwattr $C$DW$126, DW_AT_decl_column(0x05)
    4413                    
    4414                            .dwattr $C$DW$T$556, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4415                            .dwattr $C$DW$T$556, DW_AT_decl_line(0x67d)
    4416                            .dwattr $C$DW$T$556, DW_AT_decl_column(0x0e)
    4417                            .dwendtag $C$DW$T$556
    4418                    
    4419                    $C$DW$T$557     .dwtag  DW_TAG_typedef
    4420                            .dwattr $C$DW$T$557, DW_AT_name("RF_RatSelectChannel")
    4421                            .dwattr $C$DW$T$557, DW_AT_type(*$C$DW$T$556)
    4422                            .dwattr $C$DW$T$557, DW_AT_language(DW_LANG_C)
    4423                            .dwattr $C$DW$T$557, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4424                            .dwattr $C$DW$T$557, DW_AT_decl_line(0x682)
    4425                            .dwattr $C$DW$T$557, DW_AT_decl_column(0x03)
    4426                    
    4427                    
    4428                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4429                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4430                    $C$DW$127       .dwtag  DW_TAG_member
    4431                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$22)
    4432                            .dwattr $C$DW$127, DW_AT_name("rfMode")
    4433                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("rfMode")
    4434                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4435                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    4436                            .dwattr $C$DW$127, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4437                            .dwattr $C$DW$127, DW_AT_decl_line(0x437)
    4438                            .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    4439                    
    4440                    $C$DW$128       .dwtag  DW_TAG_member
    4441                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$24)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   82

    4442                            .dwattr $C$DW$128, DW_AT_name("cpePatchFxn")
    4443                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("cpePatchFxn")
    4444                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4445                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    4446                            .dwattr $C$DW$128, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4447                            .dwattr $C$DW$128, DW_AT_decl_line(0x438)
    4448                            .dwattr $C$DW$128, DW_AT_decl_column(0x0c)
    4449                    
    4450                    $C$DW$129       .dwtag  DW_TAG_member
    4451                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$24)
    4452                            .dwattr $C$DW$129, DW_AT_name("mcePatchFxn")
    4453                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("mcePatchFxn")
    4454                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4455                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    4456                            .dwattr $C$DW$129, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4457                            .dwattr $C$DW$129, DW_AT_decl_line(0x439)
    4458                            .dwattr $C$DW$129, DW_AT_decl_column(0x0c)
    4459                    
    4460                    $C$DW$130       .dwtag  DW_TAG_member
    4461                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$24)
    4462                            .dwattr $C$DW$130, DW_AT_name("rfePatchFxn")
    4463                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("rfePatchFxn")
    4464                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4465                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    4466                            .dwattr $C$DW$130, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4467                            .dwattr $C$DW$130, DW_AT_decl_line(0x43a)
    4468                            .dwattr $C$DW$130, DW_AT_decl_column(0x0c)
    4469                    
    4470                            .dwattr $C$DW$T$25, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4471                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x436)
    4472                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4473                            .dwendtag $C$DW$T$25
    4474                    
    4475                    $C$DW$T$274     .dwtag  DW_TAG_typedef
    4476                            .dwattr $C$DW$T$274, DW_AT_name("RF_Mode")
    4477                            .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$25)
    4478                            .dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
    4479                            .dwattr $C$DW$T$274, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4480                            .dwattr $C$DW$T$274, DW_AT_decl_line(0x43b)
    4481                            .dwattr $C$DW$T$274, DW_AT_decl_column(0x03)
    4482                    
    4483                    $C$DW$T$275     .dwtag  DW_TAG_pointer_type
    4484                            .dwattr $C$DW$T$275, DW_AT_type(*$C$DW$T$274)
    4485                            .dwattr $C$DW$T$275, DW_AT_address_class(0x20)
    4486                    
    4487                    
    4488                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4489                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    4490                    $C$DW$131       .dwtag  DW_TAG_member
    4491                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$27)
    4492                            .dwattr $C$DW$131, DW_AT_name("rawValue")
    4493                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("rawValue")
    4494                            .dwattr $C$DW$131, DW_AT_bit_offset(0x0a)
    4495                            .dwattr $C$DW$131, DW_AT_bit_size(0x16)
    4496                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   83

    4497                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    4498                            .dwattr $C$DW$131, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4499                            .dwattr $C$DW$131, DW_AT_decl_line(0x3ec)
    4500                            .dwattr $C$DW$131, DW_AT_decl_column(0x0e)
    4501                    
    4502                    $C$DW$132       .dwtag  DW_TAG_member
    4503                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
    4504                            .dwattr $C$DW$132, DW_AT_name("__dummy")
    4505                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("__dummy")
    4506                            .dwattr $C$DW$132, DW_AT_bit_offset(0x01)
    4507                            .dwattr $C$DW$132, DW_AT_bit_size(0x09)
    4508                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4509                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    4510                            .dwattr $C$DW$132, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4511                            .dwattr $C$DW$132, DW_AT_decl_line(0x3f0)
    4512                            .dwattr $C$DW$132, DW_AT_decl_column(0x0e)
    4513                    
    4514                    $C$DW$133       .dwtag  DW_TAG_member
    4515                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
    4516                            .dwattr $C$DW$133, DW_AT_name("paType")
    4517                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("paType")
    4518                            .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    4519                            .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    4520                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4521                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    4522                            .dwattr $C$DW$133, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4523                            .dwattr $C$DW$133, DW_AT_decl_line(0x3f1)
    4524                            .dwattr $C$DW$133, DW_AT_decl_column(0x0e)
    4525                    
    4526                            .dwattr $C$DW$T$28, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4527                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3eb)
    4528                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4529                            .dwendtag $C$DW$T$28
    4530                    
    4531                    $C$DW$T$31      .dwtag  DW_TAG_typedef
    4532                            .dwattr $C$DW$T$31, DW_AT_name("RF_TxPowerTable_Value")
    4533                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4534                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4535                            .dwattr $C$DW$T$31, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4536                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x3f5)
    4537                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    4538                    
    4539                    
    4540                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4541                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x05)
    4542                    $C$DW$134       .dwtag  DW_TAG_member
    4543                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$30)
    4544                            .dwattr $C$DW$134, DW_AT_name("power")
    4545                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("power")
    4546                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4547                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    4548                            .dwattr $C$DW$134, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4549                            .dwattr $C$DW$134, DW_AT_decl_line(0x40b)
    4550                            .dwattr $C$DW$134, DW_AT_decl_column(0x0c)
    4551                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   84

    4552                    $C$DW$135       .dwtag  DW_TAG_member
    4553                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$31)
    4554                            .dwattr $C$DW$135, DW_AT_name("value")
    4555                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("value")
    4556                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4557                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    4558                            .dwattr $C$DW$135, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4559                            .dwattr $C$DW$135, DW_AT_decl_line(0x40e)
    4560                            .dwattr $C$DW$135, DW_AT_decl_column(0x1b)
    4561                    
    4562                            .dwattr $C$DW$T$32, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4563                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x40a)
    4564                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    4565                            .dwendtag $C$DW$T$32
    4566                    
    4567                    $C$DW$T$558     .dwtag  DW_TAG_typedef
    4568                            .dwattr $C$DW$T$558, DW_AT_name("RF_TxPowerTable_Entry")
    4569                            .dwattr $C$DW$T$558, DW_AT_type(*$C$DW$T$32)
    4570                            .dwattr $C$DW$T$558, DW_AT_language(DW_LANG_C)
    4571                            .dwattr $C$DW$T$558, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4572                            .dwattr $C$DW$T$558, DW_AT_decl_line(0x40f)
    4573                            .dwattr $C$DW$T$558, DW_AT_decl_column(0x1b)
    4574                    
    4575                    
    4576                    $C$DW$T$559     .dwtag  DW_TAG_array_type
    4577                            .dwattr $C$DW$T$559, DW_AT_type(*$C$DW$T$558)
    4578                            .dwattr $C$DW$T$559, DW_AT_language(DW_LANG_C)
    4579                            .dwattr $C$DW$T$559, DW_AT_byte_size(0x46)
    4580                    $C$DW$136       .dwtag  DW_TAG_subrange_type
    4581                            .dwattr $C$DW$136, DW_AT_upper_bound(0x0d)
    4582                    
    4583                            .dwendtag $C$DW$T$559
    4584                    
    4585                    
    4586                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4587                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    4588                    $C$DW$137       .dwtag  DW_TAG_member
    4589                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
    4590                            .dwattr $C$DW$137, DW_AT_name("triggerType")
    4591                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("triggerType")
    4592                            .dwattr $C$DW$137, DW_AT_bit_offset(0x04)
    4593                            .dwattr $C$DW$137, DW_AT_bit_size(0x04)
    4594                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4595                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    4596                            .dwattr $C$DW$137, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4597                            .dwattr $C$DW$137, DW_AT_decl_line(0x7e)
    4598                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    4599                    
    4600                    $C$DW$138       .dwtag  DW_TAG_member
    4601                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
    4602                            .dwattr $C$DW$138, DW_AT_name("bEnaCmd")
    4603                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("bEnaCmd")
    4604                            .dwattr $C$DW$138, DW_AT_bit_offset(0x03)
    4605                            .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    4606                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   85

    4607                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    4608                            .dwattr $C$DW$138, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4609                            .dwattr $C$DW$138, DW_AT_decl_line(0x7f)
    4610                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    4611                    
    4612                    $C$DW$139       .dwtag  DW_TAG_member
    4613                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$22)
    4614                            .dwattr $C$DW$139, DW_AT_name("triggerNo")
    4615                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("triggerNo")
    4616                            .dwattr $C$DW$139, DW_AT_bit_offset(0x01)
    4617                            .dwattr $C$DW$139, DW_AT_bit_size(0x02)
    4618                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4619                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    4620                            .dwattr $C$DW$139, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4621                            .dwattr $C$DW$139, DW_AT_decl_line(0x81)
    4622                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    4623                    
    4624                    $C$DW$140       .dwtag  DW_TAG_member
    4625                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$22)
    4626                            .dwattr $C$DW$140, DW_AT_name("pastTrig")
    4627                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("pastTrig")
    4628                            .dwattr $C$DW$140, DW_AT_bit_offset(0x00)
    4629                            .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    4630                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4631                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    4632                            .dwattr $C$DW$140, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4633                            .dwattr $C$DW$140, DW_AT_decl_line(0x82)
    4634                            .dwattr $C$DW$140, DW_AT_decl_column(0x0f)
    4635                    
    4636                            .dwattr $C$DW$T$33, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4637                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x7d)
    4638                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    4639                            .dwendtag $C$DW$T$33
    4640                    
    4641                    
    4642                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4643                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    4644                    $C$DW$141       .dwtag  DW_TAG_member
    4645                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$22)
    4646                            .dwattr $C$DW$141, DW_AT_name("rule")
    4647                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("rule")
    4648                            .dwattr $C$DW$141, DW_AT_bit_offset(0x04)
    4649                            .dwattr $C$DW$141, DW_AT_bit_size(0x04)
    4650                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4651                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    4652                            .dwattr $C$DW$141, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4653                            .dwattr $C$DW$141, DW_AT_decl_line(0x86)
    4654                            .dwattr $C$DW$141, DW_AT_decl_column(0x0f)
    4655                    
    4656                    $C$DW$142       .dwtag  DW_TAG_member
    4657                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$22)
    4658                            .dwattr $C$DW$142, DW_AT_name("nSkip")
    4659                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("nSkip")
    4660                            .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    4661                            .dwattr $C$DW$142, DW_AT_bit_size(0x04)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   86

    4662                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4663                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    4664                            .dwattr $C$DW$142, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4665                            .dwattr $C$DW$142, DW_AT_decl_line(0x87)
    4666                            .dwattr $C$DW$142, DW_AT_decl_column(0x0f)
    4667                    
    4668                            .dwattr $C$DW$T$34, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4669                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x85)
    4670                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    4671                            .dwendtag $C$DW$T$34
    4672                    
    4673                    
    4674                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4675                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    4676                    $C$DW$143       .dwtag  DW_TAG_member
    4677                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$22)
    4678                            .dwattr $C$DW$143, DW_AT_name("triggerType")
    4679                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("triggerType")
    4680                            .dwattr $C$DW$143, DW_AT_bit_offset(0x04)
    4681                            .dwattr $C$DW$143, DW_AT_bit_size(0x04)
    4682                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4683                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    4684                            .dwattr $C$DW$143, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4685                            .dwattr $C$DW$143, DW_AT_decl_line(0x1cf)
    4686                            .dwattr $C$DW$143, DW_AT_decl_column(0x0f)
    4687                    
    4688                    $C$DW$144       .dwtag  DW_TAG_member
    4689                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$22)
    4690                            .dwattr $C$DW$144, DW_AT_name("bEnaCmd")
    4691                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("bEnaCmd")
    4692                            .dwattr $C$DW$144, DW_AT_bit_offset(0x03)
    4693                            .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    4694                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4695                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    4696                            .dwattr $C$DW$144, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4697                            .dwattr $C$DW$144, DW_AT_decl_line(0x1d0)
    4698                            .dwattr $C$DW$144, DW_AT_decl_column(0x0f)
    4699                    
    4700                    $C$DW$145       .dwtag  DW_TAG_member
    4701                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    4702                            .dwattr $C$DW$145, DW_AT_name("triggerNo")
    4703                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("triggerNo")
    4704                            .dwattr $C$DW$145, DW_AT_bit_offset(0x01)
    4705                            .dwattr $C$DW$145, DW_AT_bit_size(0x02)
    4706                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4707                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    4708                            .dwattr $C$DW$145, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4709                            .dwattr $C$DW$145, DW_AT_decl_line(0x1d2)
    4710                            .dwattr $C$DW$145, DW_AT_decl_column(0x0f)
    4711                    
    4712                    $C$DW$146       .dwtag  DW_TAG_member
    4713                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$22)
    4714                            .dwattr $C$DW$146, DW_AT_name("pastTrig")
    4715                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("pastTrig")
    4716                            .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   87

    4717                            .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    4718                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4719                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    4720                            .dwattr $C$DW$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4721                            .dwattr $C$DW$146, DW_AT_decl_line(0x1d3)
    4722                            .dwattr $C$DW$146, DW_AT_decl_column(0x0f)
    4723                    
    4724                            .dwattr $C$DW$T$35, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4725                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1ce)
    4726                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    4727                            .dwendtag $C$DW$T$35
    4728                    
    4729                    
    4730                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4731                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4732                    $C$DW$147       .dwtag  DW_TAG_member
    4733                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
    4734                            .dwattr $C$DW$147, DW_AT_name("rule")
    4735                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("rule")
    4736                            .dwattr $C$DW$147, DW_AT_bit_offset(0x04)
    4737                            .dwattr $C$DW$147, DW_AT_bit_size(0x04)
    4738                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4739                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    4740                            .dwattr $C$DW$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4741                            .dwattr $C$DW$147, DW_AT_decl_line(0x1d7)
    4742                            .dwattr $C$DW$147, DW_AT_decl_column(0x0f)
    4743                    
    4744                    $C$DW$148       .dwtag  DW_TAG_member
    4745                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$22)
    4746                            .dwattr $C$DW$148, DW_AT_name("nSkip")
    4747                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("nSkip")
    4748                            .dwattr $C$DW$148, DW_AT_bit_offset(0x00)
    4749                            .dwattr $C$DW$148, DW_AT_bit_size(0x04)
    4750                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4751                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    4752                            .dwattr $C$DW$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4753                            .dwattr $C$DW$148, DW_AT_decl_line(0x1d8)
    4754                            .dwattr $C$DW$148, DW_AT_decl_column(0x0f)
    4755                    
    4756                            .dwattr $C$DW$T$36, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4757                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x1d6)
    4758                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    4759                            .dwendtag $C$DW$T$36
    4760                    
    4761                    
    4762                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4763                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    4764                    $C$DW$149       .dwtag  DW_TAG_member
    4765                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$38)
    4766                            .dwattr $C$DW$149, DW_AT_name("modType")
    4767                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("modType")
    4768                            .dwattr $C$DW$149, DW_AT_bit_offset(0x0d)
    4769                            .dwattr $C$DW$149, DW_AT_bit_size(0x03)
    4770                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4771                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   88

    4772                            .dwattr $C$DW$149, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4773                            .dwattr $C$DW$149, DW_AT_decl_line(0x1db)
    4774                            .dwattr $C$DW$149, DW_AT_decl_column(0x10)
    4775                    
    4776                    $C$DW$150       .dwtag  DW_TAG_member
    4777                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$38)
    4778                            .dwattr $C$DW$150, DW_AT_name("deviation")
    4779                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("deviation")
    4780                            .dwattr $C$DW$150, DW_AT_bit_offset(0x00)
    4781                            .dwattr $C$DW$150, DW_AT_bit_size(0x0d)
    4782                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4783                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    4784                            .dwattr $C$DW$150, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4785                            .dwattr $C$DW$150, DW_AT_decl_line(0x1de)
    4786                            .dwattr $C$DW$150, DW_AT_decl_column(0x10)
    4787                    
    4788                            .dwattr $C$DW$T$39, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4789                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1da)
    4790                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    4791                            .dwendtag $C$DW$T$39
    4792                    
    4793                    
    4794                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4795                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    4796                    $C$DW$151       .dwtag  DW_TAG_member
    4797                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    4798                            .dwattr $C$DW$151, DW_AT_name("preScale")
    4799                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("preScale")
    4800                            .dwattr $C$DW$151, DW_AT_bit_offset(0x1c)
    4801                            .dwattr $C$DW$151, DW_AT_bit_size(0x04)
    4802                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4803                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    4804                            .dwattr $C$DW$151, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4805                            .dwattr $C$DW$151, DW_AT_decl_line(0x1e1)
    4806                            .dwattr $C$DW$151, DW_AT_decl_column(0x10)
    4807                    
    4808                    $C$DW$152       .dwtag  DW_TAG_member
    4809                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    4810                            .dwattr $C$DW$152, DW_AT_name("rateWord")
    4811                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("rateWord")
    4812                            .dwattr $C$DW$152, DW_AT_bit_offset(0x03)
    4813                            .dwattr $C$DW$152, DW_AT_bit_size(0x15)
    4814                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4815                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    4816                            .dwattr $C$DW$152, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4817                            .dwattr $C$DW$152, DW_AT_decl_line(0x1e3)
    4818                            .dwattr $C$DW$152, DW_AT_decl_column(0x10)
    4819                    
    4820                    $C$DW$153       .dwtag  DW_TAG_member
    4821                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    4822                            .dwattr $C$DW$153, DW_AT_name("decimMode")
    4823                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("decimMode")
    4824                            .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    4825                            .dwattr $C$DW$153, DW_AT_bit_size(0x03)
    4826                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   89

    4827                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    4828                            .dwattr $C$DW$153, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4829                            .dwattr $C$DW$153, DW_AT_decl_line(0x1e4)
    4830                            .dwattr $C$DW$153, DW_AT_decl_column(0x10)
    4831                    
    4832                            .dwattr $C$DW$T$40, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4833                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1e0)
    4834                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    4835                            .dwendtag $C$DW$T$40
    4836                    
    4837                    
    4838                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4839                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    4840                    $C$DW$154       .dwtag  DW_TAG_member
    4841                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$22)
    4842                            .dwattr $C$DW$154, DW_AT_name("nPreamBytes")
    4843                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("nPreamBytes")
    4844                            .dwattr $C$DW$154, DW_AT_bit_offset(0x02)
    4845                            .dwattr $C$DW$154, DW_AT_bit_size(0x06)
    4846                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4847                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    4848                            .dwattr $C$DW$154, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4849                            .dwattr $C$DW$154, DW_AT_decl_line(0x1ec)
    4850                            .dwattr $C$DW$154, DW_AT_decl_column(0x0f)
    4851                    
    4852                    $C$DW$155       .dwtag  DW_TAG_member
    4853                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$22)
    4854                            .dwattr $C$DW$155, DW_AT_name("preamMode")
    4855                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("preamMode")
    4856                            .dwattr $C$DW$155, DW_AT_bit_offset(0x00)
    4857                            .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    4858                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4859                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    4860                            .dwattr $C$DW$155, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4861                            .dwattr $C$DW$155, DW_AT_decl_line(0x1f2)
    4862                            .dwattr $C$DW$155, DW_AT_decl_column(0x0f)
    4863                    
    4864                            .dwattr $C$DW$T$41, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4865                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x1eb)
    4866                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    4867                            .dwendtag $C$DW$T$41
    4868                    
    4869                    
    4870                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    4871                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    4872                    $C$DW$156       .dwtag  DW_TAG_member
    4873                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$38)
    4874                            .dwattr $C$DW$156, DW_AT_name("nSwBits")
    4875                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("nSwBits")
    4876                            .dwattr $C$DW$156, DW_AT_bit_offset(0x0a)
    4877                            .dwattr $C$DW$156, DW_AT_bit_size(0x06)
    4878                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4879                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    4880                            .dwattr $C$DW$156, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4881                            .dwattr $C$DW$156, DW_AT_decl_line(0x1f8)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   90

    4882                            .dwattr $C$DW$156, DW_AT_decl_column(0x10)
    4883                    
    4884                    $C$DW$157       .dwtag  DW_TAG_member
    4885                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$38)
    4886                            .dwattr $C$DW$157, DW_AT_name("bBitReversal")
    4887                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("bBitReversal")
    4888                            .dwattr $C$DW$157, DW_AT_bit_offset(0x09)
    4889                            .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    4890                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4891                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    4892                            .dwattr $C$DW$157, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4893                            .dwattr $C$DW$157, DW_AT_decl_line(0x1f9)
    4894                            .dwattr $C$DW$157, DW_AT_decl_column(0x10)
    4895                    
    4896                    $C$DW$158       .dwtag  DW_TAG_member
    4897                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$38)
    4898                            .dwattr $C$DW$158, DW_AT_name("bMsbFirst")
    4899                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("bMsbFirst")
    4900                            .dwattr $C$DW$158, DW_AT_bit_offset(0x08)
    4901                            .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    4902                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4903                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    4904                            .dwattr $C$DW$158, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4905                            .dwattr $C$DW$158, DW_AT_decl_line(0x1fb)
    4906                            .dwattr $C$DW$158, DW_AT_decl_column(0x10)
    4907                    
    4908                    $C$DW$159       .dwtag  DW_TAG_member
    4909                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$38)
    4910                            .dwattr $C$DW$159, DW_AT_name("fecMode")
    4911                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("fecMode")
    4912                            .dwattr $C$DW$159, DW_AT_bit_offset(0x04)
    4913                            .dwattr $C$DW$159, DW_AT_bit_size(0x04)
    4914                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4915                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    4916                            .dwattr $C$DW$159, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4917                            .dwattr $C$DW$159, DW_AT_decl_line(0x1fd)
    4918                            .dwattr $C$DW$159, DW_AT_decl_column(0x10)
    4919                    
    4920                    $C$DW$160       .dwtag  DW_TAG_member
    4921                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$38)
    4922                            .dwattr $C$DW$160, DW_AT_name("whitenMode")
    4923                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("whitenMode")
    4924                            .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    4925                            .dwattr $C$DW$160, DW_AT_bit_size(0x03)
    4926                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4927                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    4928                            .dwattr $C$DW$160, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4929                            .dwattr $C$DW$160, DW_AT_decl_line(0x202)
    4930                            .dwattr $C$DW$160, DW_AT_decl_column(0x10)
    4931                    
    4932                            .dwattr $C$DW$T$42, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4933                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x1f7)
    4934                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    4935                            .dwendtag $C$DW$T$42
    4936                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   91

    4937                    
    4938                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    4939                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    4940                    $C$DW$161       .dwtag  DW_TAG_member
    4941                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$38)
    4942                            .dwattr $C$DW$161, DW_AT_name("frontEndMode")
    4943                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("frontEndMode")
    4944                            .dwattr $C$DW$161, DW_AT_bit_offset(0x0d)
    4945                            .dwattr $C$DW$161, DW_AT_bit_size(0x03)
    4946                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4947                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    4948                            .dwattr $C$DW$161, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4949                            .dwattr $C$DW$161, DW_AT_decl_line(0x20c)
    4950                            .dwattr $C$DW$161, DW_AT_decl_column(0x10)
    4951                    
    4952                    $C$DW$162       .dwtag  DW_TAG_member
    4953                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$38)
    4954                            .dwattr $C$DW$162, DW_AT_name("biasMode")
    4955                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("biasMode")
    4956                            .dwattr $C$DW$162, DW_AT_bit_offset(0x0c)
    4957                            .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    4958                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4959                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    4960                            .dwattr $C$DW$162, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4961                            .dwattr $C$DW$162, DW_AT_decl_line(0x212)
    4962                            .dwattr $C$DW$162, DW_AT_decl_column(0x10)
    4963                    
    4964                    $C$DW$163       .dwtag  DW_TAG_member
    4965                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$38)
    4966                            .dwattr $C$DW$163, DW_AT_name("analogCfgMode")
    4967                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("analogCfgMode")
    4968                            .dwattr $C$DW$163, DW_AT_bit_offset(0x06)
    4969                            .dwattr $C$DW$163, DW_AT_bit_size(0x06)
    4970                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4971                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    4972                            .dwattr $C$DW$163, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4973                            .dwattr $C$DW$163, DW_AT_decl_line(0x214)
    4974                            .dwattr $C$DW$163, DW_AT_decl_column(0x10)
    4975                    
    4976                    $C$DW$164       .dwtag  DW_TAG_member
    4977                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$38)
    4978                            .dwattr $C$DW$164, DW_AT_name("bNoFsPowerUp")
    4979                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("bNoFsPowerUp")
    4980                            .dwattr $C$DW$164, DW_AT_bit_offset(0x05)
    4981                            .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    4982                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4983                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    4984                            .dwattr $C$DW$164, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4985                            .dwattr $C$DW$164, DW_AT_decl_line(0x21b)
    4986                            .dwattr $C$DW$164, DW_AT_decl_column(0x10)
    4987                    
    4988                            .dwattr $C$DW$T$43, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4989                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x20b)
    4990                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    4991                            .dwendtag $C$DW$T$43
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   92

    4992                    
    4993                    
    4994                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4995                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    4996                    $C$DW$165       .dwtag  DW_TAG_member
    4997                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    4998                            .dwattr $C$DW$165, DW_AT_name("triggerType")
    4999                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("triggerType")
    5000                            .dwattr $C$DW$165, DW_AT_bit_offset(0x04)
    5001                            .dwattr $C$DW$165, DW_AT_bit_size(0x04)
    5002                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5003                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    5004                            .dwattr $C$DW$165, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5005                            .dwattr $C$DW$165, DW_AT_decl_line(0xf3)
    5006                            .dwattr $C$DW$165, DW_AT_decl_column(0x0f)
    5007                    
    5008                    $C$DW$166       .dwtag  DW_TAG_member
    5009                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    5010                            .dwattr $C$DW$166, DW_AT_name("bEnaCmd")
    5011                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("bEnaCmd")
    5012                            .dwattr $C$DW$166, DW_AT_bit_offset(0x03)
    5013                            .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    5014                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5015                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    5016                            .dwattr $C$DW$166, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5017                            .dwattr $C$DW$166, DW_AT_decl_line(0xf4)
    5018                            .dwattr $C$DW$166, DW_AT_decl_column(0x0f)
    5019                    
    5020                    $C$DW$167       .dwtag  DW_TAG_member
    5021                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
    5022                            .dwattr $C$DW$167, DW_AT_name("triggerNo")
    5023                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("triggerNo")
    5024                            .dwattr $C$DW$167, DW_AT_bit_offset(0x01)
    5025                            .dwattr $C$DW$167, DW_AT_bit_size(0x02)
    5026                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5027                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    5028                            .dwattr $C$DW$167, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5029                            .dwattr $C$DW$167, DW_AT_decl_line(0xf6)
    5030                            .dwattr $C$DW$167, DW_AT_decl_column(0x0f)
    5031                    
    5032                    $C$DW$168       .dwtag  DW_TAG_member
    5033                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    5034                            .dwattr $C$DW$168, DW_AT_name("pastTrig")
    5035                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("pastTrig")
    5036                            .dwattr $C$DW$168, DW_AT_bit_offset(0x00)
    5037                            .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    5038                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5039                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    5040                            .dwattr $C$DW$168, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5041                            .dwattr $C$DW$168, DW_AT_decl_line(0xf7)
    5042                            .dwattr $C$DW$168, DW_AT_decl_column(0x0f)
    5043                    
    5044                            .dwattr $C$DW$T$44, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5045                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xf2)
    5046                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   93

    5047                            .dwendtag $C$DW$T$44
    5048                    
    5049                    
    5050                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    5051                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    5052                    $C$DW$169       .dwtag  DW_TAG_member
    5053                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    5054                            .dwattr $C$DW$169, DW_AT_name("rule")
    5055                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("rule")
    5056                            .dwattr $C$DW$169, DW_AT_bit_offset(0x04)
    5057                            .dwattr $C$DW$169, DW_AT_bit_size(0x04)
    5058                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5059                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    5060                            .dwattr $C$DW$169, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5061                            .dwattr $C$DW$169, DW_AT_decl_line(0xfb)
    5062                            .dwattr $C$DW$169, DW_AT_decl_column(0x0f)
    5063                    
    5064                    $C$DW$170       .dwtag  DW_TAG_member
    5065                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    5066                            .dwattr $C$DW$170, DW_AT_name("nSkip")
    5067                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("nSkip")
    5068                            .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
    5069                            .dwattr $C$DW$170, DW_AT_bit_size(0x04)
    5070                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5071                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    5072                            .dwattr $C$DW$170, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5073                            .dwattr $C$DW$170, DW_AT_decl_line(0xfc)
    5074                            .dwattr $C$DW$170, DW_AT_decl_column(0x0f)
    5075                    
    5076                            .dwattr $C$DW$T$45, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5077                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xfa)
    5078                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    5079                            .dwendtag $C$DW$T$45
    5080                    
    5081                    
    5082                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    5083                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    5084                    $C$DW$171       .dwtag  DW_TAG_member
    5085                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    5086                            .dwattr $C$DW$171, DW_AT_name("bTxMode")
    5087                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("bTxMode")
    5088                            .dwattr $C$DW$171, DW_AT_bit_offset(0x07)
    5089                            .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    5090                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5091                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    5092                            .dwattr $C$DW$171, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5093                            .dwattr $C$DW$171, DW_AT_decl_line(0x101)
    5094                            .dwattr $C$DW$171, DW_AT_decl_column(0x0f)
    5095                    
    5096                    $C$DW$172       .dwtag  DW_TAG_member
    5097                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    5098                            .dwattr $C$DW$172, DW_AT_name("refFreq")
    5099                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("refFreq")
    5100                            .dwattr $C$DW$172, DW_AT_bit_offset(0x01)
    5101                            .dwattr $C$DW$172, DW_AT_bit_size(0x06)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   94

    5102                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5103                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    5104                            .dwattr $C$DW$172, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5105                            .dwattr $C$DW$172, DW_AT_decl_line(0x103)
    5106                            .dwattr $C$DW$172, DW_AT_decl_column(0x0f)
    5107                    
    5108                            .dwattr $C$DW$T$46, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5109                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x100)
    5110                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    5111                            .dwendtag $C$DW$T$46
    5112                    
    5113                    
    5114                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    5115                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    5116                    $C$DW$173       .dwtag  DW_TAG_member
    5117                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    5118                            .dwattr $C$DW$173, DW_AT_name("triggerType")
    5119                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("triggerType")
    5120                            .dwattr $C$DW$173, DW_AT_bit_offset(0x04)
    5121                            .dwattr $C$DW$173, DW_AT_bit_size(0x04)
    5122                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5123                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    5124                            .dwattr $C$DW$173, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5125                            .dwattr $C$DW$173, DW_AT_decl_line(0x86)
    5126                            .dwattr $C$DW$173, DW_AT_decl_column(0x0f)
    5127                    
    5128                    $C$DW$174       .dwtag  DW_TAG_member
    5129                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    5130                            .dwattr $C$DW$174, DW_AT_name("bEnaCmd")
    5131                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("bEnaCmd")
    5132                            .dwattr $C$DW$174, DW_AT_bit_offset(0x03)
    5133                            .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    5134                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5135                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    5136                            .dwattr $C$DW$174, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5137                            .dwattr $C$DW$174, DW_AT_decl_line(0x87)
    5138                            .dwattr $C$DW$174, DW_AT_decl_column(0x0f)
    5139                    
    5140                    $C$DW$175       .dwtag  DW_TAG_member
    5141                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    5142                            .dwattr $C$DW$175, DW_AT_name("triggerNo")
    5143                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("triggerNo")
    5144                            .dwattr $C$DW$175, DW_AT_bit_offset(0x01)
    5145                            .dwattr $C$DW$175, DW_AT_bit_size(0x02)
    5146                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5147                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    5148                            .dwattr $C$DW$175, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5149                            .dwattr $C$DW$175, DW_AT_decl_line(0x89)
    5150                            .dwattr $C$DW$175, DW_AT_decl_column(0x0f)
    5151                    
    5152                    $C$DW$176       .dwtag  DW_TAG_member
    5153                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    5154                            .dwattr $C$DW$176, DW_AT_name("pastTrig")
    5155                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("pastTrig")
    5156                            .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   95

    5157                            .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    5158                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5159                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    5160                            .dwattr $C$DW$176, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5161                            .dwattr $C$DW$176, DW_AT_decl_line(0x8a)
    5162                            .dwattr $C$DW$176, DW_AT_decl_column(0x0f)
    5163                    
    5164                            .dwattr $C$DW$T$47, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5165                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x85)
    5166                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    5167                            .dwendtag $C$DW$T$47
    5168                    
    5169                    
    5170                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    5171                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    5172                    $C$DW$177       .dwtag  DW_TAG_member
    5173                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    5174                            .dwattr $C$DW$177, DW_AT_name("rule")
    5175                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("rule")
    5176                            .dwattr $C$DW$177, DW_AT_bit_offset(0x04)
    5177                            .dwattr $C$DW$177, DW_AT_bit_size(0x04)
    5178                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5179                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    5180                            .dwattr $C$DW$177, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5181                            .dwattr $C$DW$177, DW_AT_decl_line(0x8e)
    5182                            .dwattr $C$DW$177, DW_AT_decl_column(0x0f)
    5183                    
    5184                    $C$DW$178       .dwtag  DW_TAG_member
    5185                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    5186                            .dwattr $C$DW$178, DW_AT_name("nSkip")
    5187                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("nSkip")
    5188                            .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    5189                            .dwattr $C$DW$178, DW_AT_bit_size(0x04)
    5190                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5191                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    5192                            .dwattr $C$DW$178, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5193                            .dwattr $C$DW$178, DW_AT_decl_line(0x8f)
    5194                            .dwattr $C$DW$178, DW_AT_decl_column(0x0f)
    5195                    
    5196                            .dwattr $C$DW$T$48, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5197                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x8d)
    5198                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    5199                            .dwendtag $C$DW$T$48
    5200                    
    5201                    
    5202                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    5203                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    5204                    $C$DW$179       .dwtag  DW_TAG_member
    5205                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$22)
    5206                            .dwattr $C$DW$179, DW_AT_name("bFsOff")
    5207                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("bFsOff")
    5208                            .dwattr $C$DW$179, DW_AT_bit_offset(0x07)
    5209                            .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    5210                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5211                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   96

    5212                            .dwattr $C$DW$179, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5213                            .dwattr $C$DW$179, DW_AT_decl_line(0x92)
    5214                            .dwattr $C$DW$179, DW_AT_decl_column(0x0f)
    5215                    
    5216                    $C$DW$180       .dwtag  DW_TAG_member
    5217                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    5218                            .dwattr $C$DW$180, DW_AT_name("bUseCrc")
    5219                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("bUseCrc")
    5220                            .dwattr $C$DW$180, DW_AT_bit_offset(0x04)
    5221                            .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    5222                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5223                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    5224                            .dwattr $C$DW$180, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5225                            .dwattr $C$DW$180, DW_AT_decl_line(0x95)
    5226                            .dwattr $C$DW$180, DW_AT_decl_column(0x0f)
    5227                    
    5228                    $C$DW$181       .dwtag  DW_TAG_member
    5229                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$22)
    5230                            .dwattr $C$DW$181, DW_AT_name("bVarLen")
    5231                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("bVarLen")
    5232                            .dwattr $C$DW$181, DW_AT_bit_offset(0x03)
    5233                            .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    5234                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5235                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    5236                            .dwattr $C$DW$181, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5237                            .dwattr $C$DW$181, DW_AT_decl_line(0x97)
    5238                            .dwattr $C$DW$181, DW_AT_decl_column(0x0f)
    5239                    
    5240                            .dwattr $C$DW$T$49, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5241                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x91)
    5242                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x0b)
    5243                            .dwendtag $C$DW$T$49
    5244                    
    5245                    
    5246                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    5247                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    5248                    $C$DW$182       .dwtag  DW_TAG_member
    5249                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    5250                            .dwattr $C$DW$182, DW_AT_name("triggerType")
    5251                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("triggerType")
    5252                            .dwattr $C$DW$182, DW_AT_bit_offset(0x04)
    5253                            .dwattr $C$DW$182, DW_AT_bit_size(0x04)
    5254                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5255                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    5256                            .dwattr $C$DW$182, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5257                            .dwattr $C$DW$182, DW_AT_decl_line(0x135)
    5258                            .dwattr $C$DW$182, DW_AT_decl_column(0x0f)
    5259                    
    5260                    $C$DW$183       .dwtag  DW_TAG_member
    5261                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    5262                            .dwattr $C$DW$183, DW_AT_name("bEnaCmd")
    5263                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("bEnaCmd")
    5264                            .dwattr $C$DW$183, DW_AT_bit_offset(0x03)
    5265                            .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    5266                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   97

    5267                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    5268                            .dwattr $C$DW$183, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5269                            .dwattr $C$DW$183, DW_AT_decl_line(0x136)
    5270                            .dwattr $C$DW$183, DW_AT_decl_column(0x0f)
    5271                    
    5272                    $C$DW$184       .dwtag  DW_TAG_member
    5273                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    5274                            .dwattr $C$DW$184, DW_AT_name("triggerNo")
    5275                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("triggerNo")
    5276                            .dwattr $C$DW$184, DW_AT_bit_offset(0x01)
    5277                            .dwattr $C$DW$184, DW_AT_bit_size(0x02)
    5278                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5279                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    5280                            .dwattr $C$DW$184, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5281                            .dwattr $C$DW$184, DW_AT_decl_line(0x138)
    5282                            .dwattr $C$DW$184, DW_AT_decl_column(0x0f)
    5283                    
    5284                    $C$DW$185       .dwtag  DW_TAG_member
    5285                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    5286                            .dwattr $C$DW$185, DW_AT_name("pastTrig")
    5287                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("pastTrig")
    5288                            .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    5289                            .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    5290                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5291                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    5292                            .dwattr $C$DW$185, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5293                            .dwattr $C$DW$185, DW_AT_decl_line(0x139)
    5294                            .dwattr $C$DW$185, DW_AT_decl_column(0x0f)
    5295                    
    5296                            .dwattr $C$DW$T$50, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5297                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x134)
    5298                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x0b)
    5299                            .dwendtag $C$DW$T$50
    5300                    
    5301                    
    5302                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    5303                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    5304                    $C$DW$186       .dwtag  DW_TAG_member
    5305                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
    5306                            .dwattr $C$DW$186, DW_AT_name("rule")
    5307                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("rule")
    5308                            .dwattr $C$DW$186, DW_AT_bit_offset(0x04)
    5309                            .dwattr $C$DW$186, DW_AT_bit_size(0x04)
    5310                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5311                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    5312                            .dwattr $C$DW$186, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5313                            .dwattr $C$DW$186, DW_AT_decl_line(0x13d)
    5314                            .dwattr $C$DW$186, DW_AT_decl_column(0x0f)
    5315                    
    5316                    $C$DW$187       .dwtag  DW_TAG_member
    5317                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    5318                            .dwattr $C$DW$187, DW_AT_name("nSkip")
    5319                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("nSkip")
    5320                            .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    5321                            .dwattr $C$DW$187, DW_AT_bit_size(0x04)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   98

    5322                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5323                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    5324                            .dwattr $C$DW$187, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5325                            .dwattr $C$DW$187, DW_AT_decl_line(0x13e)
    5326                            .dwattr $C$DW$187, DW_AT_decl_column(0x0f)
    5327                    
    5328                            .dwattr $C$DW$T$51, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5329                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x13c)
    5330                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x0b)
    5331                            .dwendtag $C$DW$T$51
    5332                    
    5333                    
    5334                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    5335                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    5336                    $C$DW$188       .dwtag  DW_TAG_member
    5337                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    5338                            .dwattr $C$DW$188, DW_AT_name("bFsOff")
    5339                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("bFsOff")
    5340                            .dwattr $C$DW$188, DW_AT_bit_offset(0x07)
    5341                            .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    5342                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5343                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    5344                            .dwattr $C$DW$188, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5345                            .dwattr $C$DW$188, DW_AT_decl_line(0x141)
    5346                            .dwattr $C$DW$188, DW_AT_decl_column(0x0f)
    5347                    
    5348                    $C$DW$189       .dwtag  DW_TAG_member
    5349                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    5350                            .dwattr $C$DW$189, DW_AT_name("bRepeatOk")
    5351                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("bRepeatOk")
    5352                            .dwattr $C$DW$189, DW_AT_bit_offset(0x06)
    5353                            .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    5354                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5355                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    5356                            .dwattr $C$DW$189, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5357                            .dwattr $C$DW$189, DW_AT_decl_line(0x143)
    5358                            .dwattr $C$DW$189, DW_AT_decl_column(0x0f)
    5359                    
    5360                    $C$DW$190       .dwtag  DW_TAG_member
    5361                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    5362                            .dwattr $C$DW$190, DW_AT_name("bRepeatNok")
    5363                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("bRepeatNok")
    5364                            .dwattr $C$DW$190, DW_AT_bit_offset(0x05)
    5365                            .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    5366                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5367                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    5368                            .dwattr $C$DW$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5369                            .dwattr $C$DW$190, DW_AT_decl_line(0x145)
    5370                            .dwattr $C$DW$190, DW_AT_decl_column(0x0f)
    5371                    
    5372                    $C$DW$191       .dwtag  DW_TAG_member
    5373                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
    5374                            .dwattr $C$DW$191, DW_AT_name("bUseCrc")
    5375                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("bUseCrc")
    5376                            .dwattr $C$DW$191, DW_AT_bit_offset(0x04)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE   99

    5377                            .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    5378                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5379                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    5380                            .dwattr $C$DW$191, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5381                            .dwattr $C$DW$191, DW_AT_decl_line(0x147)
    5382                            .dwattr $C$DW$191, DW_AT_decl_column(0x0f)
    5383                    
    5384                    $C$DW$192       .dwtag  DW_TAG_member
    5385                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    5386                            .dwattr $C$DW$192, DW_AT_name("bCrcIncSw")
    5387                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("bCrcIncSw")
    5388                            .dwattr $C$DW$192, DW_AT_bit_offset(0x03)
    5389                            .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    5390                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5391                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    5392                            .dwattr $C$DW$192, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5393                            .dwattr $C$DW$192, DW_AT_decl_line(0x149)
    5394                            .dwattr $C$DW$192, DW_AT_decl_column(0x0f)
    5395                    
    5396                    $C$DW$193       .dwtag  DW_TAG_member
    5397                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    5398                            .dwattr $C$DW$193, DW_AT_name("bCrcIncHdr")
    5399                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("bCrcIncHdr")
    5400                            .dwattr $C$DW$193, DW_AT_bit_offset(0x02)
    5401                            .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    5402                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5403                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    5404                            .dwattr $C$DW$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5405                            .dwattr $C$DW$193, DW_AT_decl_line(0x14b)
    5406                            .dwattr $C$DW$193, DW_AT_decl_column(0x0f)
    5407                    
    5408                    $C$DW$194       .dwtag  DW_TAG_member
    5409                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
    5410                            .dwattr $C$DW$194, DW_AT_name("endType")
    5411                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("endType")
    5412                            .dwattr $C$DW$194, DW_AT_bit_offset(0x01)
    5413                            .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    5414                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5415                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    5416                            .dwattr $C$DW$194, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5417                            .dwattr $C$DW$194, DW_AT_decl_line(0x14d)
    5418                            .dwattr $C$DW$194, DW_AT_decl_column(0x0f)
    5419                    
    5420                    $C$DW$195       .dwtag  DW_TAG_member
    5421                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    5422                            .dwattr $C$DW$195, DW_AT_name("filterOp")
    5423                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("filterOp")
    5424                            .dwattr $C$DW$195, DW_AT_bit_offset(0x00)
    5425                            .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    5426                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5427                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    5428                            .dwattr $C$DW$195, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5429                            .dwattr $C$DW$195, DW_AT_decl_line(0x14f)
    5430                            .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    5431                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE  100

    5432                            .dwattr $C$DW$T$52, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5433                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x140)
    5434                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x0b)
    5435                            .dwendtag $C$DW$T$52
    5436                    
    5437                    
    5438                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    5439                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    5440                    $C$DW$196       .dwtag  DW_TAG_member
    5441                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    5442                            .dwattr $C$DW$196, DW_AT_name("bAutoFlushIgnored")
    5443                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("bAutoFlushIgnored")
    5444                            .dwattr $C$DW$196, DW_AT_bit_offset(0x07)
    5445                            .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    5446                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5447                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    5448                            .dwattr $C$DW$196, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5449                            .dwattr $C$DW$196, DW_AT_decl_line(0x153)
    5450                            .dwattr $C$DW$196, DW_AT_decl_column(0x0f)
    5451                    
    5452                    $C$DW$197       .dwtag  DW_TAG_member
    5453                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
    5454                            .dwattr $C$DW$197, DW_AT_name("bAutoFlushCrcErr")
    5455                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("bAutoFlushCrcErr")
    5456                            .dwattr $C$DW$197, DW_AT_bit_offset(0x06)
    5457                            .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    5458                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5459                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    5460                            .dwattr $C$DW$197, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5461                            .dwattr $C$DW$197, DW_AT_decl_line(0x154)
    5462                            .dwattr $C$DW$197, DW_AT_decl_column(0x0f)
    5463                    
    5464                    $C$DW$198       .dwtag  DW_TAG_member
    5465                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    5466                            .dwattr $C$DW$198, DW_AT_name("bIncludeHdr")
    5467                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("bIncludeHdr")
    5468                            .dwattr $C$DW$198, DW_AT_bit_offset(0x04)
    5469                            .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    5470                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5471                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    5472                            .dwattr $C$DW$198, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5473                            .dwattr $C$DW$198, DW_AT_decl_line(0x156)
    5474                            .dwattr $C$DW$198, DW_AT_decl_column(0x0f)
    5475                    
    5476                    $C$DW$199       .dwtag  DW_TAG_member
    5477                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$22)
    5478                            .dwattr $C$DW$199, DW_AT_name("bIncludeCrc")
    5479                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("bIncludeCrc")
    5480                            .dwattr $C$DW$199, DW_AT_bit_offset(0x03)
    5481                            .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    5482                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5483                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    5484                            .dwattr $C$DW$199, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5485                            .dwattr $C$DW$199, DW_AT_decl_line(0x157)
    5486                            .dwattr $C$DW$199, DW_AT_decl_column(0x0f)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE  101

    5487                    
    5488                    $C$DW$200       .dwtag  DW_TAG_member
    5489                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$22)
    5490                            .dwattr $C$DW$200, DW_AT_name("bAppendRssi")
    5491                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("bAppendRssi")
    5492                            .dwattr $C$DW$200, DW_AT_bit_offset(0x02)
    5493                            .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    5494                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5495                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    5496                            .dwattr $C$DW$200, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5497                            .dwattr $C$DW$200, DW_AT_decl_line(0x158)
    5498                            .dwattr $C$DW$200, DW_AT_decl_column(0x0f)
    5499                    
    5500                    $C$DW$201       .dwtag  DW_TAG_member
    5501                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    5502                            .dwattr $C$DW$201, DW_AT_name("bAppendTimestamp")
    5503                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("bAppendTimestamp")
    5504                            .dwattr $C$DW$201, DW_AT_bit_offset(0x01)
    5505                            .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    5506                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5507                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    5508                            .dwattr $C$DW$201, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5509                            .dwattr $C$DW$201, DW_AT_decl_line(0x159)
    5510                            .dwattr $C$DW$201, DW_AT_decl_column(0x0f)
    5511                    
    5512                    $C$DW$202       .dwtag  DW_TAG_member
    5513                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    5514                            .dwattr $C$DW$202, DW_AT_name("bAppendStatus")
    5515                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("bAppendStatus")
    5516                            .dwattr $C$DW$202, DW_AT_bit_offset(0x00)
    5517                            .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    5518                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5519                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    5520                            .dwattr $C$DW$202, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5521                            .dwattr $C$DW$202, DW_AT_decl_line(0x15a)
    5522                            .dwattr $C$DW$202, DW_AT_decl_column(0x0f)
    5523                    
    5524                            .dwattr $C$DW$T$53, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5525                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x152)
    5526                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x0b)
    5527                            .dwendtag $C$DW$T$53
    5528                    
    5529                    
    5530                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    5531                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    5532                    $C$DW$203       .dwtag  DW_TAG_member
    5533                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$38)
    5534                            .dwattr $C$DW$203, DW_AT_name("numHdrBits")
    5535                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("numHdrBits")
    5536                            .dwattr $C$DW$203, DW_AT_bit_offset(0x0a)
    5537                            .dwattr $C$DW$203, DW_AT_bit_size(0x06)
    5538                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5539                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    5540                            .dwattr $C$DW$203, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5541                            .dwattr $C$DW$203, DW_AT_decl_line(0x161)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings_predefined.asm                                      PAGE  102

    5542                            .dwattr $C$DW$203, DW_AT_decl_column(0x10)
    5543                    
    5544                    $C$DW$204       .dwtag  DW_TAG_member
    5545                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$38)
