TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
       3                    ;* Date/Time created: Fri Apr  2 00:57:46 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../smartrf_settings/smartrf_settings.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
      13 00000000                   .sect   ".const:patchImageProp"
      14                            .align  4

    4150                            .dwattr $C$DW$119, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4151                            .dwattr $C$DW$119, DW_AT_decl_line(0x65c)
    4152                            .dwattr $C$DW$119, DW_AT_decl_column(0x05)
    4153                    
    4154                    $C$DW$120       .dwtag  DW_TAG_enumerator
    4155                            .dwattr $C$DW$120, DW_AT_name("RF_AllowDelayAny")
    4156                            .dwattr $C$DW$120, DW_AT_const_value(-1)
    4157                            .dwattr $C$DW$120, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4158                            .dwattr $C$DW$120, DW_AT_decl_line(0x65d)
    4159                            .dwattr $C$DW$120, DW_AT_decl_column(0x05)
    4160                    
    4161                            .dwattr $C$DW$T$554, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4162                            .dwattr $C$DW$T$554, DW_AT_decl_line(0x65b)
    4163                            .dwattr $C$DW$T$554, DW_AT_decl_column(0x0e)
    4164                            .dwendtag $C$DW$T$554
    4165                    
    4166                    $C$DW$T$555     .dwtag  DW_TAG_typedef
    4167                            .dwattr $C$DW$T$555, DW_AT_name("RF_AllowDelay")
    4168                            .dwattr $C$DW$T$555, DW_AT_type(*$C$DW$T$554)
    4169                            .dwattr $C$DW$T$555, DW_AT_language(DW_LANG_C)
    4170                            .dwattr $C$DW$T$555, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4171                            .dwattr $C$DW$T$555, DW_AT_decl_line(0x65e)
    4172                            .dwattr $C$DW$T$555, DW_AT_decl_column(0x03)
    4173                    
    4174                    
    4175                    $C$DW$T$556     .dwtag  DW_TAG_enumeration_type
    4176                            .dwattr $C$DW$T$556, DW_AT_byte_size(0x01)
    4177                    $C$DW$121       .dwtag  DW_TAG_enumerator
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   77

    4178                            .dwattr $C$DW$121, DW_AT_name("RF_RatChannelAny")
    4179                            .dwattr $C$DW$121, DW_AT_const_value(-1)
    4180                            .dwattr $C$DW$121, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4181                            .dwattr $C$DW$121, DW_AT_decl_line(0x67e)
    4182                            .dwattr $C$DW$121, DW_AT_decl_column(0x05)
    4183                    
    4184                    $C$DW$122       .dwtag  DW_TAG_enumerator
    4185                            .dwattr $C$DW$122, DW_AT_name("RF_RatChannel0")
    4186                            .dwattr $C$DW$122, DW_AT_const_value(0x00)
    4187                            .dwattr $C$DW$122, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4188                            .dwattr $C$DW$122, DW_AT_decl_line(0x67f)
    4189                            .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    4190                    
    4191                    $C$DW$123       .dwtag  DW_TAG_enumerator
    4192                            .dwattr $C$DW$123, DW_AT_name("RF_RatChannel1")
    4193                            .dwattr $C$DW$123, DW_AT_const_value(0x01)
    4194                            .dwattr $C$DW$123, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4195                            .dwattr $C$DW$123, DW_AT_decl_line(0x680)
    4196                            .dwattr $C$DW$123, DW_AT_decl_column(0x05)
    4197                    
    4198                    $C$DW$124       .dwtag  DW_TAG_enumerator
    4199                            .dwattr $C$DW$124, DW_AT_name("RF_RatChannel2")
    4200                            .dwattr $C$DW$124, DW_AT_const_value(0x02)
    4201                            .dwattr $C$DW$124, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4202                            .dwattr $C$DW$124, DW_AT_decl_line(0x681)
    4203                            .dwattr $C$DW$124, DW_AT_decl_column(0x05)
    4204                    
    4205                            .dwattr $C$DW$T$556, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4206                            .dwattr $C$DW$T$556, DW_AT_decl_line(0x67d)
    4207                            .dwattr $C$DW$T$556, DW_AT_decl_column(0x0e)
    4208                            .dwendtag $C$DW$T$556
    4209                    
    4210                    $C$DW$T$557     .dwtag  DW_TAG_typedef
    4211                            .dwattr $C$DW$T$557, DW_AT_name("RF_RatSelectChannel")
    4212                            .dwattr $C$DW$T$557, DW_AT_type(*$C$DW$T$556)
    4213                            .dwattr $C$DW$T$557, DW_AT_language(DW_LANG_C)
    4214                            .dwattr $C$DW$T$557, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4215                            .dwattr $C$DW$T$557, DW_AT_decl_line(0x682)
    4216                            .dwattr $C$DW$T$557, DW_AT_decl_column(0x03)
    4217                    
    4218                    
    4219                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4220                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4221                    $C$DW$125       .dwtag  DW_TAG_member
    4222                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$22)
    4223                            .dwattr $C$DW$125, DW_AT_name("rfMode")
    4224                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("rfMode")
    4225                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4226                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    4227                            .dwattr $C$DW$125, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4228                            .dwattr $C$DW$125, DW_AT_decl_line(0x437)
    4229                            .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    4230                    
    4231                    $C$DW$126       .dwtag  DW_TAG_member
    4232                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$24)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   78

    4233                            .dwattr $C$DW$126, DW_AT_name("cpePatchFxn")
    4234                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("cpePatchFxn")
    4235                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4236                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    4237                            .dwattr $C$DW$126, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4238                            .dwattr $C$DW$126, DW_AT_decl_line(0x438)
    4239                            .dwattr $C$DW$126, DW_AT_decl_column(0x0c)
    4240                    
    4241                    $C$DW$127       .dwtag  DW_TAG_member
    4242                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$24)
    4243                            .dwattr $C$DW$127, DW_AT_name("mcePatchFxn")
    4244                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("mcePatchFxn")
    4245                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4246                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    4247                            .dwattr $C$DW$127, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4248                            .dwattr $C$DW$127, DW_AT_decl_line(0x439)
    4249                            .dwattr $C$DW$127, DW_AT_decl_column(0x0c)
    4250                    
    4251                    $C$DW$128       .dwtag  DW_TAG_member
    4252                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$24)
    4253                            .dwattr $C$DW$128, DW_AT_name("rfePatchFxn")
    4254                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("rfePatchFxn")
    4255                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4256                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    4257                            .dwattr $C$DW$128, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    4258                            .dwattr $C$DW$128, DW_AT_decl_line(0x43a)
    4259                            .dwattr $C$DW$128, DW_AT_decl_column(0x0c)
    4260                    
    4261                            .dwattr $C$DW$T$25, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    4262                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x436)
    4263                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4264                            .dwendtag $C$DW$T$25
    4265                    
    4266                    $C$DW$T$274     .dwtag  DW_TAG_typedef
    4267                            .dwattr $C$DW$T$274, DW_AT_name("RF_Mode")
    4268                            .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$25)
    4269                            .dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
    4270                            .dwattr $C$DW$T$274, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    4271                            .dwattr $C$DW$T$274, DW_AT_decl_line(0x43b)
    4272                            .dwattr $C$DW$T$274, DW_AT_decl_column(0x03)
    4273                    
    4274                    $C$DW$T$275     .dwtag  DW_TAG_pointer_type
    4275                            .dwattr $C$DW$T$275, DW_AT_type(*$C$DW$T$274)
    4276                            .dwattr $C$DW$T$275, DW_AT_address_class(0x20)
    4277                    
    4278                    
    4279                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4280                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4281                    $C$DW$129       .dwtag  DW_TAG_member
    4282                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$22)
    4283                            .dwattr $C$DW$129, DW_AT_name("triggerType")
    4284                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("triggerType")
    4285                            .dwattr $C$DW$129, DW_AT_bit_offset(0x04)
    4286                            .dwattr $C$DW$129, DW_AT_bit_size(0x04)
    4287                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   79

    4288                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    4289                            .dwattr $C$DW$129, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4290                            .dwattr $C$DW$129, DW_AT_decl_line(0x7e)
    4291                            .dwattr $C$DW$129, DW_AT_decl_column(0x0f)
    4292                    
    4293                    $C$DW$130       .dwtag  DW_TAG_member
    4294                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$22)
    4295                            .dwattr $C$DW$130, DW_AT_name("bEnaCmd")
    4296                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("bEnaCmd")
    4297                            .dwattr $C$DW$130, DW_AT_bit_offset(0x03)
    4298                            .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    4299                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4300                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    4301                            .dwattr $C$DW$130, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4302                            .dwattr $C$DW$130, DW_AT_decl_line(0x7f)
    4303                            .dwattr $C$DW$130, DW_AT_decl_column(0x0f)
    4304                    
    4305                    $C$DW$131       .dwtag  DW_TAG_member
    4306                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$22)
    4307                            .dwattr $C$DW$131, DW_AT_name("triggerNo")
    4308                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("triggerNo")
    4309                            .dwattr $C$DW$131, DW_AT_bit_offset(0x01)
    4310                            .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    4311                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4312                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    4313                            .dwattr $C$DW$131, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4314                            .dwattr $C$DW$131, DW_AT_decl_line(0x81)
    4315                            .dwattr $C$DW$131, DW_AT_decl_column(0x0f)
    4316                    
    4317                    $C$DW$132       .dwtag  DW_TAG_member
    4318                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$22)
    4319                            .dwattr $C$DW$132, DW_AT_name("pastTrig")
    4320                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("pastTrig")
    4321                            .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    4322                            .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    4323                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4324                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    4325                            .dwattr $C$DW$132, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4326                            .dwattr $C$DW$132, DW_AT_decl_line(0x82)
    4327                            .dwattr $C$DW$132, DW_AT_decl_column(0x0f)
    4328                    
    4329                            .dwattr $C$DW$T$26, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4330                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7d)
    4331                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    4332                            .dwendtag $C$DW$T$26
    4333                    
    4334                    
    4335                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4336                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    4337                    $C$DW$133       .dwtag  DW_TAG_member
    4338                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$22)
    4339                            .dwattr $C$DW$133, DW_AT_name("rule")
    4340                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("rule")
    4341                            .dwattr $C$DW$133, DW_AT_bit_offset(0x04)
    4342                            .dwattr $C$DW$133, DW_AT_bit_size(0x04)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   80

    4343                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4344                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    4345                            .dwattr $C$DW$133, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4346                            .dwattr $C$DW$133, DW_AT_decl_line(0x86)
    4347                            .dwattr $C$DW$133, DW_AT_decl_column(0x0f)
    4348                    
    4349                    $C$DW$134       .dwtag  DW_TAG_member
    4350                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$22)
    4351                            .dwattr $C$DW$134, DW_AT_name("nSkip")
    4352                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("nSkip")
    4353                            .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    4354                            .dwattr $C$DW$134, DW_AT_bit_size(0x04)
    4355                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4356                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    4357                            .dwattr $C$DW$134, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4358                            .dwattr $C$DW$134, DW_AT_decl_line(0x87)
    4359                            .dwattr $C$DW$134, DW_AT_decl_column(0x0f)
    4360                    
    4361                            .dwattr $C$DW$T$27, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4362                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x85)
    4363                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    4364                            .dwendtag $C$DW$T$27
    4365                    
    4366                    
    4367                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4368                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    4369                    $C$DW$135       .dwtag  DW_TAG_member
    4370                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$22)
    4371                            .dwattr $C$DW$135, DW_AT_name("triggerType")
    4372                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("triggerType")
    4373                            .dwattr $C$DW$135, DW_AT_bit_offset(0x04)
    4374                            .dwattr $C$DW$135, DW_AT_bit_size(0x04)
    4375                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4376                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    4377                            .dwattr $C$DW$135, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4378                            .dwattr $C$DW$135, DW_AT_decl_line(0x1cf)
    4379                            .dwattr $C$DW$135, DW_AT_decl_column(0x0f)
    4380                    
    4381                    $C$DW$136       .dwtag  DW_TAG_member
    4382                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    4383                            .dwattr $C$DW$136, DW_AT_name("bEnaCmd")
    4384                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("bEnaCmd")
    4385                            .dwattr $C$DW$136, DW_AT_bit_offset(0x03)
    4386                            .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    4387                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4388                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    4389                            .dwattr $C$DW$136, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4390                            .dwattr $C$DW$136, DW_AT_decl_line(0x1d0)
    4391                            .dwattr $C$DW$136, DW_AT_decl_column(0x0f)
    4392                    
    4393                    $C$DW$137       .dwtag  DW_TAG_member
    4394                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
    4395                            .dwattr $C$DW$137, DW_AT_name("triggerNo")
    4396                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("triggerNo")
    4397                            .dwattr $C$DW$137, DW_AT_bit_offset(0x01)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   81

    4398                            .dwattr $C$DW$137, DW_AT_bit_size(0x02)
    4399                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4400                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    4401                            .dwattr $C$DW$137, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4402                            .dwattr $C$DW$137, DW_AT_decl_line(0x1d2)
    4403                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    4404                    
    4405                    $C$DW$138       .dwtag  DW_TAG_member
    4406                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
    4407                            .dwattr $C$DW$138, DW_AT_name("pastTrig")
    4408                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("pastTrig")
    4409                            .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    4410                            .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    4411                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4412                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    4413                            .dwattr $C$DW$138, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4414                            .dwattr $C$DW$138, DW_AT_decl_line(0x1d3)
    4415                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    4416                    
    4417                            .dwattr $C$DW$T$28, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4418                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x1ce)
    4419                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    4420                            .dwendtag $C$DW$T$28
    4421                    
    4422                    
    4423                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4424                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    4425                    $C$DW$139       .dwtag  DW_TAG_member
    4426                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$22)
    4427                            .dwattr $C$DW$139, DW_AT_name("rule")
    4428                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("rule")
    4429                            .dwattr $C$DW$139, DW_AT_bit_offset(0x04)
    4430                            .dwattr $C$DW$139, DW_AT_bit_size(0x04)
    4431                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4432                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    4433                            .dwattr $C$DW$139, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4434                            .dwattr $C$DW$139, DW_AT_decl_line(0x1d7)
    4435                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    4436                    
    4437                    $C$DW$140       .dwtag  DW_TAG_member
    4438                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$22)
    4439                            .dwattr $C$DW$140, DW_AT_name("nSkip")
    4440                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("nSkip")
    4441                            .dwattr $C$DW$140, DW_AT_bit_offset(0x00)
    4442                            .dwattr $C$DW$140, DW_AT_bit_size(0x04)
    4443                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4444                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    4445                            .dwattr $C$DW$140, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4446                            .dwattr $C$DW$140, DW_AT_decl_line(0x1d8)
    4447                            .dwattr $C$DW$140, DW_AT_decl_column(0x0f)
    4448                    
    4449                            .dwattr $C$DW$T$29, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4450                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x1d6)
    4451                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    4452                            .dwendtag $C$DW$T$29
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   82

    4453                    
    4454                    
    4455                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4456                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    4457                    $C$DW$141       .dwtag  DW_TAG_member
    4458                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$31)
    4459                            .dwattr $C$DW$141, DW_AT_name("modType")
    4460                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("modType")
    4461                            .dwattr $C$DW$141, DW_AT_bit_offset(0x0d)
    4462                            .dwattr $C$DW$141, DW_AT_bit_size(0x03)
    4463                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4464                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    4465                            .dwattr $C$DW$141, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4466                            .dwattr $C$DW$141, DW_AT_decl_line(0x1db)
    4467                            .dwattr $C$DW$141, DW_AT_decl_column(0x10)
    4468                    
    4469                    $C$DW$142       .dwtag  DW_TAG_member
    4470                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$31)
    4471                            .dwattr $C$DW$142, DW_AT_name("deviation")
    4472                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("deviation")
    4473                            .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    4474                            .dwattr $C$DW$142, DW_AT_bit_size(0x0d)
    4475                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4476                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    4477                            .dwattr $C$DW$142, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4478                            .dwattr $C$DW$142, DW_AT_decl_line(0x1de)
    4479                            .dwattr $C$DW$142, DW_AT_decl_column(0x10)
    4480                    
    4481                            .dwattr $C$DW$T$32, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4482                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x1da)
    4483                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    4484                            .dwendtag $C$DW$T$32
    4485                    
    4486                    
    4487                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4488                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    4489                    $C$DW$143       .dwtag  DW_TAG_member
    4490                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$34)
    4491                            .dwattr $C$DW$143, DW_AT_name("preScale")
    4492                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("preScale")
    4493                            .dwattr $C$DW$143, DW_AT_bit_offset(0x1c)
    4494                            .dwattr $C$DW$143, DW_AT_bit_size(0x04)
    4495                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4496                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    4497                            .dwattr $C$DW$143, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4498                            .dwattr $C$DW$143, DW_AT_decl_line(0x1e1)
    4499                            .dwattr $C$DW$143, DW_AT_decl_column(0x10)
    4500                    
    4501                    $C$DW$144       .dwtag  DW_TAG_member
    4502                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$34)
    4503                            .dwattr $C$DW$144, DW_AT_name("rateWord")
    4504                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("rateWord")
    4505                            .dwattr $C$DW$144, DW_AT_bit_offset(0x03)
    4506                            .dwattr $C$DW$144, DW_AT_bit_size(0x15)
    4507                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   83

    4508                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    4509                            .dwattr $C$DW$144, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4510                            .dwattr $C$DW$144, DW_AT_decl_line(0x1e3)
    4511                            .dwattr $C$DW$144, DW_AT_decl_column(0x10)
    4512                    
    4513                    $C$DW$145       .dwtag  DW_TAG_member
    4514                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$34)
    4515                            .dwattr $C$DW$145, DW_AT_name("decimMode")
    4516                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("decimMode")
    4517                            .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    4518                            .dwattr $C$DW$145, DW_AT_bit_size(0x03)
    4519                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4520                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    4521                            .dwattr $C$DW$145, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4522                            .dwattr $C$DW$145, DW_AT_decl_line(0x1e4)
    4523                            .dwattr $C$DW$145, DW_AT_decl_column(0x10)
    4524                    
    4525                            .dwattr $C$DW$T$35, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4526                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1e0)
    4527                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    4528                            .dwendtag $C$DW$T$35
    4529                    
    4530                    
    4531                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4532                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4533                    $C$DW$146       .dwtag  DW_TAG_member
    4534                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$22)
    4535                            .dwattr $C$DW$146, DW_AT_name("nPreamBytes")
    4536                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("nPreamBytes")
    4537                            .dwattr $C$DW$146, DW_AT_bit_offset(0x02)
    4538                            .dwattr $C$DW$146, DW_AT_bit_size(0x06)
    4539                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4540                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    4541                            .dwattr $C$DW$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4542                            .dwattr $C$DW$146, DW_AT_decl_line(0x1ec)
    4543                            .dwattr $C$DW$146, DW_AT_decl_column(0x0f)
    4544                    
    4545                    $C$DW$147       .dwtag  DW_TAG_member
    4546                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
    4547                            .dwattr $C$DW$147, DW_AT_name("preamMode")
    4548                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("preamMode")
    4549                            .dwattr $C$DW$147, DW_AT_bit_offset(0x00)
    4550                            .dwattr $C$DW$147, DW_AT_bit_size(0x02)
    4551                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4552                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    4553                            .dwattr $C$DW$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4554                            .dwattr $C$DW$147, DW_AT_decl_line(0x1f2)
    4555                            .dwattr $C$DW$147, DW_AT_decl_column(0x0f)
    4556                    
    4557                            .dwattr $C$DW$T$36, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4558                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x1eb)
    4559                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    4560                            .dwendtag $C$DW$T$36
    4561                    
    4562                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   84

    4563                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4564                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    4565                    $C$DW$148       .dwtag  DW_TAG_member
    4566                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$31)
    4567                            .dwattr $C$DW$148, DW_AT_name("nSwBits")
    4568                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("nSwBits")
    4569                            .dwattr $C$DW$148, DW_AT_bit_offset(0x0a)
    4570                            .dwattr $C$DW$148, DW_AT_bit_size(0x06)
    4571                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4572                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    4573                            .dwattr $C$DW$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4574                            .dwattr $C$DW$148, DW_AT_decl_line(0x1f8)
    4575                            .dwattr $C$DW$148, DW_AT_decl_column(0x10)
    4576                    
    4577                    $C$DW$149       .dwtag  DW_TAG_member
    4578                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
    4579                            .dwattr $C$DW$149, DW_AT_name("bBitReversal")
    4580                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("bBitReversal")
    4581                            .dwattr $C$DW$149, DW_AT_bit_offset(0x09)
    4582                            .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    4583                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4584                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    4585                            .dwattr $C$DW$149, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4586                            .dwattr $C$DW$149, DW_AT_decl_line(0x1f9)
    4587                            .dwattr $C$DW$149, DW_AT_decl_column(0x10)
    4588                    
    4589                    $C$DW$150       .dwtag  DW_TAG_member
    4590                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$31)
    4591                            .dwattr $C$DW$150, DW_AT_name("bMsbFirst")
    4592                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("bMsbFirst")
    4593                            .dwattr $C$DW$150, DW_AT_bit_offset(0x08)
    4594                            .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    4595                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4596                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    4597                            .dwattr $C$DW$150, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4598                            .dwattr $C$DW$150, DW_AT_decl_line(0x1fb)
    4599                            .dwattr $C$DW$150, DW_AT_decl_column(0x10)
    4600                    
    4601                    $C$DW$151       .dwtag  DW_TAG_member
    4602                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$31)
    4603                            .dwattr $C$DW$151, DW_AT_name("fecMode")
    4604                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("fecMode")
    4605                            .dwattr $C$DW$151, DW_AT_bit_offset(0x04)
    4606                            .dwattr $C$DW$151, DW_AT_bit_size(0x04)
    4607                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4608                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    4609                            .dwattr $C$DW$151, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4610                            .dwattr $C$DW$151, DW_AT_decl_line(0x1fd)
    4611                            .dwattr $C$DW$151, DW_AT_decl_column(0x10)
    4612                    
    4613                    $C$DW$152       .dwtag  DW_TAG_member
    4614                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
    4615                            .dwattr $C$DW$152, DW_AT_name("whitenMode")
    4616                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("whitenMode")
    4617                            .dwattr $C$DW$152, DW_AT_bit_offset(0x00)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   85

    4618                            .dwattr $C$DW$152, DW_AT_bit_size(0x03)
    4619                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4620                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    4621                            .dwattr $C$DW$152, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4622                            .dwattr $C$DW$152, DW_AT_decl_line(0x202)
    4623                            .dwattr $C$DW$152, DW_AT_decl_column(0x10)
    4624                    
    4625                            .dwattr $C$DW$T$37, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4626                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x1f7)
    4627                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    4628                            .dwendtag $C$DW$T$37
    4629                    
    4630                    
    4631                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4632                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    4633                    $C$DW$153       .dwtag  DW_TAG_member
    4634                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    4635                            .dwattr $C$DW$153, DW_AT_name("frontEndMode")
    4636                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("frontEndMode")
    4637                            .dwattr $C$DW$153, DW_AT_bit_offset(0x0d)
    4638                            .dwattr $C$DW$153, DW_AT_bit_size(0x03)
    4639                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4640                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    4641                            .dwattr $C$DW$153, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4642                            .dwattr $C$DW$153, DW_AT_decl_line(0x20c)
    4643                            .dwattr $C$DW$153, DW_AT_decl_column(0x10)
    4644                    
    4645                    $C$DW$154       .dwtag  DW_TAG_member
    4646                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
    4647                            .dwattr $C$DW$154, DW_AT_name("biasMode")
    4648                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("biasMode")
    4649                            .dwattr $C$DW$154, DW_AT_bit_offset(0x0c)
    4650                            .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    4651                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4652                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    4653                            .dwattr $C$DW$154, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4654                            .dwattr $C$DW$154, DW_AT_decl_line(0x212)
    4655                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    4656                    
    4657                    $C$DW$155       .dwtag  DW_TAG_member
    4658                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$31)
    4659                            .dwattr $C$DW$155, DW_AT_name("analogCfgMode")
    4660                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("analogCfgMode")
    4661                            .dwattr $C$DW$155, DW_AT_bit_offset(0x06)
    4662                            .dwattr $C$DW$155, DW_AT_bit_size(0x06)
    4663                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4664                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    4665                            .dwattr $C$DW$155, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4666                            .dwattr $C$DW$155, DW_AT_decl_line(0x214)
    4667                            .dwattr $C$DW$155, DW_AT_decl_column(0x10)
    4668                    
    4669                    $C$DW$156       .dwtag  DW_TAG_member
    4670                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
    4671                            .dwattr $C$DW$156, DW_AT_name("bNoFsPowerUp")
    4672                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("bNoFsPowerUp")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   86

    4673                            .dwattr $C$DW$156, DW_AT_bit_offset(0x05)
    4674                            .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    4675                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4676                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    4677                            .dwattr $C$DW$156, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4678                            .dwattr $C$DW$156, DW_AT_decl_line(0x21b)
    4679                            .dwattr $C$DW$156, DW_AT_decl_column(0x10)
    4680                    
    4681                            .dwattr $C$DW$T$38, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4682                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x20b)
    4683                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    4684                            .dwendtag $C$DW$T$38
    4685                    
    4686                    
    4687                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4688                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    4689                    $C$DW$157       .dwtag  DW_TAG_member
    4690                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
    4691                            .dwattr $C$DW$157, DW_AT_name("triggerType")
    4692                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("triggerType")
    4693                            .dwattr $C$DW$157, DW_AT_bit_offset(0x04)
    4694                            .dwattr $C$DW$157, DW_AT_bit_size(0x04)
    4695                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4696                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    4697                            .dwattr $C$DW$157, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4698                            .dwattr $C$DW$157, DW_AT_decl_line(0xf3)
    4699                            .dwattr $C$DW$157, DW_AT_decl_column(0x0f)
    4700                    
    4701                    $C$DW$158       .dwtag  DW_TAG_member
    4702                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$22)
    4703                            .dwattr $C$DW$158, DW_AT_name("bEnaCmd")
    4704                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("bEnaCmd")
    4705                            .dwattr $C$DW$158, DW_AT_bit_offset(0x03)
    4706                            .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    4707                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4708                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    4709                            .dwattr $C$DW$158, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4710                            .dwattr $C$DW$158, DW_AT_decl_line(0xf4)
    4711                            .dwattr $C$DW$158, DW_AT_decl_column(0x0f)
    4712                    
    4713                    $C$DW$159       .dwtag  DW_TAG_member
    4714                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$22)
    4715                            .dwattr $C$DW$159, DW_AT_name("triggerNo")
    4716                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("triggerNo")
    4717                            .dwattr $C$DW$159, DW_AT_bit_offset(0x01)
    4718                            .dwattr $C$DW$159, DW_AT_bit_size(0x02)
    4719                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4720                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    4721                            .dwattr $C$DW$159, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4722                            .dwattr $C$DW$159, DW_AT_decl_line(0xf6)
    4723                            .dwattr $C$DW$159, DW_AT_decl_column(0x0f)
    4724                    
    4725                    $C$DW$160       .dwtag  DW_TAG_member
    4726                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$22)
    4727                            .dwattr $C$DW$160, DW_AT_name("pastTrig")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   87

    4728                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("pastTrig")
    4729                            .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    4730                            .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    4731                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4732                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    4733                            .dwattr $C$DW$160, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4734                            .dwattr $C$DW$160, DW_AT_decl_line(0xf7)
    4735                            .dwattr $C$DW$160, DW_AT_decl_column(0x0f)
    4736                    
    4737                            .dwattr $C$DW$T$39, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4738                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xf2)
    4739                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    4740                            .dwendtag $C$DW$T$39
    4741                    
    4742                    
    4743                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4744                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    4745                    $C$DW$161       .dwtag  DW_TAG_member
    4746                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$22)
    4747                            .dwattr $C$DW$161, DW_AT_name("rule")
    4748                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("rule")
    4749                            .dwattr $C$DW$161, DW_AT_bit_offset(0x04)
    4750                            .dwattr $C$DW$161, DW_AT_bit_size(0x04)
    4751                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4752                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    4753                            .dwattr $C$DW$161, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4754                            .dwattr $C$DW$161, DW_AT_decl_line(0xfb)
    4755                            .dwattr $C$DW$161, DW_AT_decl_column(0x0f)
    4756                    
    4757                    $C$DW$162       .dwtag  DW_TAG_member
    4758                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
    4759                            .dwattr $C$DW$162, DW_AT_name("nSkip")
    4760                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("nSkip")
    4761                            .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    4762                            .dwattr $C$DW$162, DW_AT_bit_size(0x04)
    4763                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4764                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    4765                            .dwattr $C$DW$162, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4766                            .dwattr $C$DW$162, DW_AT_decl_line(0xfc)
    4767                            .dwattr $C$DW$162, DW_AT_decl_column(0x0f)
    4768                    
    4769                            .dwattr $C$DW$T$40, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4770                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xfa)
    4771                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    4772                            .dwendtag $C$DW$T$40
    4773                    
    4774                    
    4775                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4776                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    4777                    $C$DW$163       .dwtag  DW_TAG_member
    4778                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
    4779                            .dwattr $C$DW$163, DW_AT_name("bTxMode")
    4780                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("bTxMode")
    4781                            .dwattr $C$DW$163, DW_AT_bit_offset(0x07)
    4782                            .dwattr $C$DW$163, DW_AT_bit_size(0x01)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   88

    4783                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4784                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    4785                            .dwattr $C$DW$163, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4786                            .dwattr $C$DW$163, DW_AT_decl_line(0x101)
    4787                            .dwattr $C$DW$163, DW_AT_decl_column(0x0f)
    4788                    
    4789                    $C$DW$164       .dwtag  DW_TAG_member
    4790                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$22)
    4791                            .dwattr $C$DW$164, DW_AT_name("refFreq")
    4792                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("refFreq")
    4793                            .dwattr $C$DW$164, DW_AT_bit_offset(0x01)
    4794                            .dwattr $C$DW$164, DW_AT_bit_size(0x06)
    4795                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4796                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    4797                            .dwattr $C$DW$164, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4798                            .dwattr $C$DW$164, DW_AT_decl_line(0x103)
    4799                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    4800                    
    4801                            .dwattr $C$DW$T$41, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4802                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x100)
    4803                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    4804                            .dwendtag $C$DW$T$41
    4805                    
    4806                    
    4807                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    4808                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    4809                    $C$DW$165       .dwtag  DW_TAG_member
    4810                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    4811                            .dwattr $C$DW$165, DW_AT_name("triggerType")
    4812                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("triggerType")
    4813                            .dwattr $C$DW$165, DW_AT_bit_offset(0x04)
    4814                            .dwattr $C$DW$165, DW_AT_bit_size(0x04)
    4815                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4816                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    4817                            .dwattr $C$DW$165, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4818                            .dwattr $C$DW$165, DW_AT_decl_line(0x86)
    4819                            .dwattr $C$DW$165, DW_AT_decl_column(0x0f)
    4820                    
    4821                    $C$DW$166       .dwtag  DW_TAG_member
    4822                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    4823                            .dwattr $C$DW$166, DW_AT_name("bEnaCmd")
    4824                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("bEnaCmd")
    4825                            .dwattr $C$DW$166, DW_AT_bit_offset(0x03)
    4826                            .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    4827                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4828                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    4829                            .dwattr $C$DW$166, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4830                            .dwattr $C$DW$166, DW_AT_decl_line(0x87)
    4831                            .dwattr $C$DW$166, DW_AT_decl_column(0x0f)
    4832                    
    4833                    $C$DW$167       .dwtag  DW_TAG_member
    4834                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
    4835                            .dwattr $C$DW$167, DW_AT_name("triggerNo")
    4836                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("triggerNo")
    4837                            .dwattr $C$DW$167, DW_AT_bit_offset(0x01)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   89

    4838                            .dwattr $C$DW$167, DW_AT_bit_size(0x02)
    4839                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4840                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    4841                            .dwattr $C$DW$167, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4842                            .dwattr $C$DW$167, DW_AT_decl_line(0x89)
    4843                            .dwattr $C$DW$167, DW_AT_decl_column(0x0f)
    4844                    
    4845                    $C$DW$168       .dwtag  DW_TAG_member
    4846                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    4847                            .dwattr $C$DW$168, DW_AT_name("pastTrig")
    4848                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("pastTrig")
    4849                            .dwattr $C$DW$168, DW_AT_bit_offset(0x00)
    4850                            .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    4851                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4852                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    4853                            .dwattr $C$DW$168, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4854                            .dwattr $C$DW$168, DW_AT_decl_line(0x8a)
    4855                            .dwattr $C$DW$168, DW_AT_decl_column(0x0f)
    4856                    
    4857                            .dwattr $C$DW$T$42, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4858                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x85)
    4859                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    4860                            .dwendtag $C$DW$T$42
    4861                    
    4862                    
    4863                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    4864                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    4865                    $C$DW$169       .dwtag  DW_TAG_member
    4866                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    4867                            .dwattr $C$DW$169, DW_AT_name("rule")
    4868                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("rule")
    4869                            .dwattr $C$DW$169, DW_AT_bit_offset(0x04)
    4870                            .dwattr $C$DW$169, DW_AT_bit_size(0x04)
    4871                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4872                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    4873                            .dwattr $C$DW$169, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4874                            .dwattr $C$DW$169, DW_AT_decl_line(0x8e)
    4875                            .dwattr $C$DW$169, DW_AT_decl_column(0x0f)
    4876                    
    4877                    $C$DW$170       .dwtag  DW_TAG_member
    4878                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    4879                            .dwattr $C$DW$170, DW_AT_name("nSkip")
    4880                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("nSkip")
    4881                            .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
    4882                            .dwattr $C$DW$170, DW_AT_bit_size(0x04)
    4883                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4884                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    4885                            .dwattr $C$DW$170, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4886                            .dwattr $C$DW$170, DW_AT_decl_line(0x8f)
    4887                            .dwattr $C$DW$170, DW_AT_decl_column(0x0f)
    4888                    
    4889                            .dwattr $C$DW$T$43, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4890                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x8d)
    4891                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    4892                            .dwendtag $C$DW$T$43
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   90

    4893                    
    4894                    
    4895                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4896                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    4897                    $C$DW$171       .dwtag  DW_TAG_member
    4898                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    4899                            .dwattr $C$DW$171, DW_AT_name("bFsOff")
    4900                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("bFsOff")
    4901                            .dwattr $C$DW$171, DW_AT_bit_offset(0x07)
    4902                            .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    4903                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4904                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    4905                            .dwattr $C$DW$171, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4906                            .dwattr $C$DW$171, DW_AT_decl_line(0x92)
    4907                            .dwattr $C$DW$171, DW_AT_decl_column(0x0f)
    4908                    
    4909                    $C$DW$172       .dwtag  DW_TAG_member
    4910                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    4911                            .dwattr $C$DW$172, DW_AT_name("bUseCrc")
    4912                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("bUseCrc")
    4913                            .dwattr $C$DW$172, DW_AT_bit_offset(0x04)
    4914                            .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    4915                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4916                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    4917                            .dwattr $C$DW$172, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4918                            .dwattr $C$DW$172, DW_AT_decl_line(0x95)
    4919                            .dwattr $C$DW$172, DW_AT_decl_column(0x0f)
    4920                    
    4921                    $C$DW$173       .dwtag  DW_TAG_member
    4922                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    4923                            .dwattr $C$DW$173, DW_AT_name("bVarLen")
    4924                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("bVarLen")
    4925                            .dwattr $C$DW$173, DW_AT_bit_offset(0x03)
    4926                            .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    4927                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4928                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    4929                            .dwattr $C$DW$173, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4930                            .dwattr $C$DW$173, DW_AT_decl_line(0x97)
    4931                            .dwattr $C$DW$173, DW_AT_decl_column(0x0f)
    4932                    
    4933                            .dwattr $C$DW$T$44, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4934                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x91)
    4935                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    4936                            .dwendtag $C$DW$T$44
    4937                    
    4938                    
    4939                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4940                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    4941                    $C$DW$174       .dwtag  DW_TAG_member
    4942                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    4943                            .dwattr $C$DW$174, DW_AT_name("triggerType")
    4944                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("triggerType")
    4945                            .dwattr $C$DW$174, DW_AT_bit_offset(0x04)
    4946                            .dwattr $C$DW$174, DW_AT_bit_size(0x04)
    4947                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   91

    4948                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    4949                            .dwattr $C$DW$174, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4950                            .dwattr $C$DW$174, DW_AT_decl_line(0xad)
    4951                            .dwattr $C$DW$174, DW_AT_decl_column(0x0f)
    4952                    
    4953                    $C$DW$175       .dwtag  DW_TAG_member
    4954                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    4955                            .dwattr $C$DW$175, DW_AT_name("bEnaCmd")
    4956                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("bEnaCmd")
    4957                            .dwattr $C$DW$175, DW_AT_bit_offset(0x03)
    4958                            .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    4959                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4960                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    4961                            .dwattr $C$DW$175, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4962                            .dwattr $C$DW$175, DW_AT_decl_line(0xae)
    4963                            .dwattr $C$DW$175, DW_AT_decl_column(0x0f)
    4964                    
    4965                    $C$DW$176       .dwtag  DW_TAG_member
    4966                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    4967                            .dwattr $C$DW$176, DW_AT_name("triggerNo")
    4968                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("triggerNo")
    4969                            .dwattr $C$DW$176, DW_AT_bit_offset(0x01)
    4970                            .dwattr $C$DW$176, DW_AT_bit_size(0x02)
    4971                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4972                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    4973                            .dwattr $C$DW$176, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4974                            .dwattr $C$DW$176, DW_AT_decl_line(0xb0)
    4975                            .dwattr $C$DW$176, DW_AT_decl_column(0x0f)
    4976                    
    4977                    $C$DW$177       .dwtag  DW_TAG_member
    4978                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    4979                            .dwattr $C$DW$177, DW_AT_name("pastTrig")
    4980                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("pastTrig")
    4981                            .dwattr $C$DW$177, DW_AT_bit_offset(0x00)
    4982                            .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    4983                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4984                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    4985                            .dwattr $C$DW$177, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    4986                            .dwattr $C$DW$177, DW_AT_decl_line(0xb1)
    4987                            .dwattr $C$DW$177, DW_AT_decl_column(0x0f)
    4988                    
    4989                            .dwattr $C$DW$T$45, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    4990                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xac)
    4991                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    4992                            .dwendtag $C$DW$T$45
    4993                    
    4994                    
    4995                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4996                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    4997                    $C$DW$178       .dwtag  DW_TAG_member
    4998                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    4999                            .dwattr $C$DW$178, DW_AT_name("rule")
    5000                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("rule")
    5001                            .dwattr $C$DW$178, DW_AT_bit_offset(0x04)
    5002                            .dwattr $C$DW$178, DW_AT_bit_size(0x04)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   92

    5003                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5004                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    5005                            .dwattr $C$DW$178, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5006                            .dwattr $C$DW$178, DW_AT_decl_line(0xb5)
    5007                            .dwattr $C$DW$178, DW_AT_decl_column(0x0f)
    5008                    
    5009                    $C$DW$179       .dwtag  DW_TAG_member
    5010                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$22)
    5011                            .dwattr $C$DW$179, DW_AT_name("nSkip")
    5012                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("nSkip")
    5013                            .dwattr $C$DW$179, DW_AT_bit_offset(0x00)
    5014                            .dwattr $C$DW$179, DW_AT_bit_size(0x04)
    5015                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5016                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    5017                            .dwattr $C$DW$179, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5018                            .dwattr $C$DW$179, DW_AT_decl_line(0xb6)
    5019                            .dwattr $C$DW$179, DW_AT_decl_column(0x0f)
    5020                    
    5021                            .dwattr $C$DW$T$46, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5022                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xb4)
    5023                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    5024                            .dwendtag $C$DW$T$46
    5025                    
    5026                    
    5027                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    5028                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    5029                    $C$DW$180       .dwtag  DW_TAG_member
    5030                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    5031                            .dwattr $C$DW$180, DW_AT_name("bFsOff")
    5032                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("bFsOff")
    5033                            .dwattr $C$DW$180, DW_AT_bit_offset(0x07)
    5034                            .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    5035                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5036                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    5037                            .dwattr $C$DW$180, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5038                            .dwattr $C$DW$180, DW_AT_decl_line(0xb9)
    5039                            .dwattr $C$DW$180, DW_AT_decl_column(0x0f)
    5040                    
    5041                    $C$DW$181       .dwtag  DW_TAG_member
    5042                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$22)
    5043                            .dwattr $C$DW$181, DW_AT_name("bRepeatOk")
    5044                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("bRepeatOk")
    5045                            .dwattr $C$DW$181, DW_AT_bit_offset(0x06)
    5046                            .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    5047                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5048                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    5049                            .dwattr $C$DW$181, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5050                            .dwattr $C$DW$181, DW_AT_decl_line(0xbb)
    5051                            .dwattr $C$DW$181, DW_AT_decl_column(0x0f)
    5052                    
    5053                    $C$DW$182       .dwtag  DW_TAG_member
    5054                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    5055                            .dwattr $C$DW$182, DW_AT_name("bRepeatNok")
    5056                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("bRepeatNok")
    5057                            .dwattr $C$DW$182, DW_AT_bit_offset(0x05)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   93

    5058                            .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    5059                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5060                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    5061                            .dwattr $C$DW$182, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5062                            .dwattr $C$DW$182, DW_AT_decl_line(0xbd)
    5063                            .dwattr $C$DW$182, DW_AT_decl_column(0x0f)
    5064                    
    5065                    $C$DW$183       .dwtag  DW_TAG_member
    5066                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    5067                            .dwattr $C$DW$183, DW_AT_name("bUseCrc")
    5068                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("bUseCrc")
    5069                            .dwattr $C$DW$183, DW_AT_bit_offset(0x04)
    5070                            .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    5071                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5072                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    5073                            .dwattr $C$DW$183, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5074                            .dwattr $C$DW$183, DW_AT_decl_line(0xbf)
    5075                            .dwattr $C$DW$183, DW_AT_decl_column(0x0f)
    5076                    
    5077                    $C$DW$184       .dwtag  DW_TAG_member
    5078                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    5079                            .dwattr $C$DW$184, DW_AT_name("bVarLen")
    5080                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("bVarLen")
    5081                            .dwattr $C$DW$184, DW_AT_bit_offset(0x03)
    5082                            .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    5083                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5084                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    5085                            .dwattr $C$DW$184, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5086                            .dwattr $C$DW$184, DW_AT_decl_line(0xc1)
    5087                            .dwattr $C$DW$184, DW_AT_decl_column(0x0f)
    5088                    
    5089                    $C$DW$185       .dwtag  DW_TAG_member
    5090                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    5091                            .dwattr $C$DW$185, DW_AT_name("bChkAddress")
    5092                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("bChkAddress")
    5093                            .dwattr $C$DW$185, DW_AT_bit_offset(0x02)
    5094                            .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    5095                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5096                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    5097                            .dwattr $C$DW$185, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5098                            .dwattr $C$DW$185, DW_AT_decl_line(0xc3)
    5099                            .dwattr $C$DW$185, DW_AT_decl_column(0x0f)
    5100                    
    5101                    $C$DW$186       .dwtag  DW_TAG_member
    5102                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
    5103                            .dwattr $C$DW$186, DW_AT_name("endType")
    5104                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("endType")
    5105                            .dwattr $C$DW$186, DW_AT_bit_offset(0x01)
    5106                            .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    5107                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5108                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    5109                            .dwattr $C$DW$186, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5110                            .dwattr $C$DW$186, DW_AT_decl_line(0xc5)
    5111                            .dwattr $C$DW$186, DW_AT_decl_column(0x0f)
    5112                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   94

    5113                    $C$DW$187       .dwtag  DW_TAG_member
    5114                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    5115                            .dwattr $C$DW$187, DW_AT_name("filterOp")
    5116                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("filterOp")
    5117                            .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    5118                            .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    5119                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5120                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    5121                            .dwattr $C$DW$187, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5122                            .dwattr $C$DW$187, DW_AT_decl_line(0xc7)
    5123                            .dwattr $C$DW$187, DW_AT_decl_column(0x0f)
    5124                    
    5125                            .dwattr $C$DW$T$47, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5126                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xb8)
    5127                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    5128                            .dwendtag $C$DW$T$47
    5129                    
    5130                    
    5131                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    5132                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    5133                    $C$DW$188       .dwtag  DW_TAG_member
    5134                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    5135                            .dwattr $C$DW$188, DW_AT_name("bAutoFlushIgnored")
    5136                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("bAutoFlushIgnored")
    5137                            .dwattr $C$DW$188, DW_AT_bit_offset(0x07)
    5138                            .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    5139                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5140                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    5141                            .dwattr $C$DW$188, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5142                            .dwattr $C$DW$188, DW_AT_decl_line(0xcb)
    5143                            .dwattr $C$DW$188, DW_AT_decl_column(0x0f)
    5144                    
    5145                    $C$DW$189       .dwtag  DW_TAG_member
    5146                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    5147                            .dwattr $C$DW$189, DW_AT_name("bAutoFlushCrcErr")
    5148                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("bAutoFlushCrcErr")
    5149                            .dwattr $C$DW$189, DW_AT_bit_offset(0x06)
    5150                            .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    5151                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5152                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    5153                            .dwattr $C$DW$189, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5154                            .dwattr $C$DW$189, DW_AT_decl_line(0xcc)
    5155                            .dwattr $C$DW$189, DW_AT_decl_column(0x0f)
    5156                    
    5157                    $C$DW$190       .dwtag  DW_TAG_member
    5158                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    5159                            .dwattr $C$DW$190, DW_AT_name("bIncludeHdr")
    5160                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("bIncludeHdr")
    5161                            .dwattr $C$DW$190, DW_AT_bit_offset(0x04)
    5162                            .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    5163                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5164                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    5165                            .dwattr $C$DW$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5166                            .dwattr $C$DW$190, DW_AT_decl_line(0xce)
    5167                            .dwattr $C$DW$190, DW_AT_decl_column(0x0f)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   95

    5168                    
    5169                    $C$DW$191       .dwtag  DW_TAG_member
    5170                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
    5171                            .dwattr $C$DW$191, DW_AT_name("bIncludeCrc")
    5172                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("bIncludeCrc")
    5173                            .dwattr $C$DW$191, DW_AT_bit_offset(0x03)
    5174                            .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    5175                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5176                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    5177                            .dwattr $C$DW$191, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5178                            .dwattr $C$DW$191, DW_AT_decl_line(0xcf)
    5179                            .dwattr $C$DW$191, DW_AT_decl_column(0x0f)
    5180                    
    5181                    $C$DW$192       .dwtag  DW_TAG_member
    5182                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    5183                            .dwattr $C$DW$192, DW_AT_name("bAppendRssi")
    5184                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("bAppendRssi")
    5185                            .dwattr $C$DW$192, DW_AT_bit_offset(0x02)
    5186                            .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    5187                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5188                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    5189                            .dwattr $C$DW$192, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5190                            .dwattr $C$DW$192, DW_AT_decl_line(0xd0)
    5191                            .dwattr $C$DW$192, DW_AT_decl_column(0x0f)
    5192                    
    5193                    $C$DW$193       .dwtag  DW_TAG_member
    5194                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    5195                            .dwattr $C$DW$193, DW_AT_name("bAppendTimestamp")
    5196                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("bAppendTimestamp")
    5197                            .dwattr $C$DW$193, DW_AT_bit_offset(0x01)
    5198                            .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    5199                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5200                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    5201                            .dwattr $C$DW$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5202                            .dwattr $C$DW$193, DW_AT_decl_line(0xd1)
    5203                            .dwattr $C$DW$193, DW_AT_decl_column(0x0f)
    5204                    
    5205                    $C$DW$194       .dwtag  DW_TAG_member
    5206                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
    5207                            .dwattr $C$DW$194, DW_AT_name("bAppendStatus")
    5208                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("bAppendStatus")
    5209                            .dwattr $C$DW$194, DW_AT_bit_offset(0x00)
    5210                            .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    5211                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5212                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    5213                            .dwattr $C$DW$194, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5214                            .dwattr $C$DW$194, DW_AT_decl_line(0xd2)
    5215                            .dwattr $C$DW$194, DW_AT_decl_column(0x0f)
    5216                    
    5217                            .dwattr $C$DW$T$48, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5218                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xca)
    5219                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    5220                            .dwendtag $C$DW$T$48
    5221                    
    5222                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   96

    5223                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    5224                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    5225                    $C$DW$195       .dwtag  DW_TAG_member
    5226                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    5227                            .dwattr $C$DW$195, DW_AT_name("triggerType")
    5228                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("triggerType")
    5229                            .dwattr $C$DW$195, DW_AT_bit_offset(0x04)
    5230                            .dwattr $C$DW$195, DW_AT_bit_size(0x04)
    5231                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5232                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    5233                            .dwattr $C$DW$195, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5234                            .dwattr $C$DW$195, DW_AT_decl_line(0xdb)
    5235                            .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    5236                    
    5237                    $C$DW$196       .dwtag  DW_TAG_member
    5238                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    5239                            .dwattr $C$DW$196, DW_AT_name("bEnaCmd")
    5240                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("bEnaCmd")
    5241                            .dwattr $C$DW$196, DW_AT_bit_offset(0x03)
    5242                            .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    5243                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5244                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    5245                            .dwattr $C$DW$196, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5246                            .dwattr $C$DW$196, DW_AT_decl_line(0xdc)
    5247                            .dwattr $C$DW$196, DW_AT_decl_column(0x0f)
    5248                    
    5249                    $C$DW$197       .dwtag  DW_TAG_member
    5250                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
    5251                            .dwattr $C$DW$197, DW_AT_name("triggerNo")
    5252                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("triggerNo")
    5253                            .dwattr $C$DW$197, DW_AT_bit_offset(0x01)
    5254                            .dwattr $C$DW$197, DW_AT_bit_size(0x02)
    5255                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5256                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    5257                            .dwattr $C$DW$197, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5258                            .dwattr $C$DW$197, DW_AT_decl_line(0xde)
    5259                            .dwattr $C$DW$197, DW_AT_decl_column(0x0f)
    5260                    
    5261                    $C$DW$198       .dwtag  DW_TAG_member
    5262                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    5263                            .dwattr $C$DW$198, DW_AT_name("pastTrig")
    5264                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("pastTrig")
    5265                            .dwattr $C$DW$198, DW_AT_bit_offset(0x00)
    5266                            .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    5267                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5268                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    5269                            .dwattr $C$DW$198, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5270                            .dwattr $C$DW$198, DW_AT_decl_line(0xdf)
    5271                            .dwattr $C$DW$198, DW_AT_decl_column(0x0f)
    5272                    
    5273                            .dwattr $C$DW$T$49, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5274                            .dwattr $C$DW$T$49, DW_AT_decl_line(0xda)
    5275                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x0b)
    5276                            .dwendtag $C$DW$T$49
    5277                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   97

    5278                    
    5279                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    5280                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x08)
    5281                    $C$DW$199       .dwtag  DW_TAG_member
    5282                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$50)
    5283                            .dwattr $C$DW$199, DW_AT_name("pCurrEntry")
    5284                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("pCurrEntry")
    5285                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5286                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    5287                            .dwattr $C$DW$199, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5288                            .dwattr $C$DW$199, DW_AT_decl_line(0x3f)
    5289                            .dwattr $C$DW$199, DW_AT_decl_column(0x0d)
    5290                    
    5291                    $C$DW$200       .dwtag  DW_TAG_member
    5292                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$50)
    5293                            .dwattr $C$DW$200, DW_AT_name("pLastEntry")
    5294                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("pLastEntry")
    5295                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5296                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    5297                            .dwattr $C$DW$200, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5298                            .dwattr $C$DW$200, DW_AT_decl_line(0x40)
    5299                            .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    5300                    
    5301                            .dwattr $C$DW$T$51, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    5302                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x3e)
    5303                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    5304                            .dwendtag $C$DW$T$51
    5305                    
    5306                    $C$DW$T$392     .dwtag  DW_TAG_typedef
    5307                            .dwattr $C$DW$T$392, DW_AT_name("dataQueue_t")
    5308                            .dwattr $C$DW$T$392, DW_AT_type(*$C$DW$T$51)
    5309                            .dwattr $C$DW$T$392, DW_AT_language(DW_LANG_C)
    5310                            .dwattr $C$DW$T$392, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
    5311                            .dwattr $C$DW$T$392, DW_AT_decl_line(0x41)
    5312                            .dwattr $C$DW$T$392, DW_AT_decl_column(0x03)
    5313                    
    5314                    $C$DW$T$393     .dwtag  DW_TAG_pointer_type
    5315                            .dwattr $C$DW$T$393, DW_AT_type(*$C$DW$T$392)
    5316                            .dwattr $C$DW$T$393, DW_AT_address_class(0x20)
    5317                    
    5318                    
    5319                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    5320                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    5321                    $C$DW$201       .dwtag  DW_TAG_member
    5322                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    5323                            .dwattr $C$DW$201, DW_AT_name("triggerType")
    5324                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("triggerType")
    5325                            .dwattr $C$DW$201, DW_AT_bit_offset(0x04)
    5326                            .dwattr $C$DW$201, DW_AT_bit_size(0x04)
    5327                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5328                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    5329                            .dwattr $C$DW$201, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    5330                            .dwattr $C$DW$201, DW_AT_decl_line(0x162)
    5331                            .dwattr $C$DW$201, DW_AT_decl_column(0x0f)
    5332                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
smartrf_settings.asm                                                 PAGE   98

    5333                    $C$DW$202       .dwtag  DW_TAG_member
    5334                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    5335                            .dwattr $C$DW$202, DW_AT_name("bEnaCmd")
