TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
       3                    ;* Date/Time created: Fri Apr  2 00:57:46 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../easylink/easylink_config.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
      13                    $C$DW$1 .dwtag  DW_TAG_variable
      14                            .dwattr $C$DW$1, DW_AT_name("RF_prop")

    1175                            .dwattr $C$DW$T$627, DW_AT_type(*$C$DW$T$626)
    1176                            .dwattr $C$DW$T$627, DW_AT_language(DW_LANG_C)
    1177                            .dwattr $C$DW$T$627, DW_AT_decl_file("../easylink/EasyLink.h")
    1178                            .dwattr $C$DW$T$627, DW_AT_decl_line(0xc8)
    1179                            .dwattr $C$DW$T$627, DW_AT_decl_column(0x03)
    1180                    
    1181                    
    1182                    $C$DW$T$628     .dwtag  DW_TAG_enumeration_type
    1183                            .dwattr $C$DW$T$628, DW_AT_byte_size(0x01)
    1184                    $C$DW$108       .dwtag  DW_TAG_enumerator
    1185                            .dwattr $C$DW$108, DW_AT_name("EasyLink_Ctrl_AddSize")
    1186                            .dwattr $C$DW$108, DW_AT_const_value(0x00)
    1187                            .dwattr $C$DW$108, DW_AT_decl_file("../easylink/EasyLink.h")
    1188                            .dwattr $C$DW$108, DW_AT_decl_line(0xe6)
    1189                            .dwattr $C$DW$108, DW_AT_decl_column(0x05)
    1190                    
    1191                    $C$DW$109       .dwtag  DW_TAG_enumerator
    1192                            .dwattr $C$DW$109, DW_AT_name("EasyLink_Ctrl_Idle_TimeOut")
    1193                            .dwattr $C$DW$109, DW_AT_const_value(0x01)
    1194                            .dwattr $C$DW$109, DW_AT_decl_file("../easylink/EasyLink.h")
    1195                            .dwattr $C$DW$109, DW_AT_decl_line(0xe9)
    1196                            .dwattr $C$DW$109, DW_AT_decl_column(0x05)
    1197                    
    1198                    $C$DW$110       .dwtag  DW_TAG_enumerator
    1199                            .dwattr $C$DW$110, DW_AT_name("EasyLink_Ctrl_MultiClient_Mode")
    1200                            .dwattr $C$DW$110, DW_AT_const_value(0x02)
    1201                            .dwattr $C$DW$110, DW_AT_decl_file("../easylink/EasyLink.h")
    1202                            .dwattr $C$DW$110, DW_AT_decl_line(0xed)
    1203                            .dwattr $C$DW$110, DW_AT_decl_column(0x05)
    1204                    
    1205                    $C$DW$111       .dwtag  DW_TAG_enumerator
    1206                            .dwattr $C$DW$111, DW_AT_name("EasyLink_Ctrl_AsyncRx_TimeOut")
    1207                            .dwattr $C$DW$111, DW_AT_const_value(0x03)
    1208                            .dwattr $C$DW$111, DW_AT_decl_file("../easylink/EasyLink.h")
    1209                            .dwattr $C$DW$111, DW_AT_decl_line(0xf2)
    1210                            .dwattr $C$DW$111, DW_AT_decl_column(0x05)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   23

    1211                    
    1212                    $C$DW$112       .dwtag  DW_TAG_enumerator
    1213                            .dwattr $C$DW$112, DW_AT_name("EasyLink_Ctrl_Test_Tone")
    1214                            .dwattr $C$DW$112, DW_AT_const_value(0x04)
    1215                            .dwattr $C$DW$112, DW_AT_decl_file("../easylink/EasyLink.h")
    1216                            .dwattr $C$DW$112, DW_AT_decl_line(0xf6)
    1217                            .dwattr $C$DW$112, DW_AT_decl_column(0x05)
    1218                    
    1219                    $C$DW$113       .dwtag  DW_TAG_enumerator
    1220                            .dwattr $C$DW$113, DW_AT_name("EasyLink_Ctrl_Test_Signal")
    1221                            .dwattr $C$DW$113, DW_AT_const_value(0x05)
    1222                            .dwattr $C$DW$113, DW_AT_decl_file("../easylink/EasyLink.h")
    1223                            .dwattr $C$DW$113, DW_AT_decl_line(0xf7)
    1224                            .dwattr $C$DW$113, DW_AT_decl_column(0x05)
    1225                    
    1226                    $C$DW$114       .dwtag  DW_TAG_enumerator
    1227                            .dwattr $C$DW$114, DW_AT_name("EasyLink_Ctrl_Rx_Test_Tone")
    1228                            .dwattr $C$DW$114, DW_AT_const_value(0x06)
    1229                            .dwattr $C$DW$114, DW_AT_decl_file("../easylink/EasyLink.h")
    1230                            .dwattr $C$DW$114, DW_AT_decl_line(0xf8)
    1231                            .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    1232                    
    1233                            .dwattr $C$DW$T$628, DW_AT_decl_file("../easylink/EasyLink.h")
    1234                            .dwattr $C$DW$T$628, DW_AT_decl_line(0xe5)
    1235                            .dwattr $C$DW$T$628, DW_AT_decl_column(0x01)
    1236                            .dwendtag $C$DW$T$628
    1237                    
    1238                    $C$DW$T$629     .dwtag  DW_TAG_typedef
    1239                            .dwattr $C$DW$T$629, DW_AT_name("EasyLink_CtrlOption")
    1240                            .dwattr $C$DW$T$629, DW_AT_type(*$C$DW$T$628)
    1241                            .dwattr $C$DW$T$629, DW_AT_language(DW_LANG_C)
    1242                            .dwattr $C$DW$T$629, DW_AT_decl_file("../easylink/EasyLink.h")
    1243                            .dwattr $C$DW$T$629, DW_AT_decl_line(0xf9)
    1244                            .dwattr $C$DW$T$629, DW_AT_decl_column(0x03)
    1245                    
    1246                    
    1247                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1248                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    1249                    $C$DW$115       .dwtag  DW_TAG_member
    1250                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
    1251                            .dwattr $C$DW$115, DW_AT_name("rfMode")
    1252                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("rfMode")
    1253                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1255                            .dwattr $C$DW$115, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    1256                            .dwattr $C$DW$115, DW_AT_decl_line(0x437)
    1257                            .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1258                    
    1259                    $C$DW$116       .dwtag  DW_TAG_member
    1260                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$24)
    1261                            .dwattr $C$DW$116, DW_AT_name("cpePatchFxn")
    1262                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("cpePatchFxn")
    1263                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1264                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1265                            .dwattr $C$DW$116, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   24

    1266                            .dwattr $C$DW$116, DW_AT_decl_line(0x438)
    1267                            .dwattr $C$DW$116, DW_AT_decl_column(0x0c)
    1268                    
    1269                    $C$DW$117       .dwtag  DW_TAG_member
    1270                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$24)
    1271                            .dwattr $C$DW$117, DW_AT_name("mcePatchFxn")
    1272                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("mcePatchFxn")
    1273                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1274                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1275                            .dwattr $C$DW$117, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    1276                            .dwattr $C$DW$117, DW_AT_decl_line(0x439)
    1277                            .dwattr $C$DW$117, DW_AT_decl_column(0x0c)
    1278                    
    1279                    $C$DW$118       .dwtag  DW_TAG_member
    1280                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$24)
    1281                            .dwattr $C$DW$118, DW_AT_name("rfePatchFxn")
    1282                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("rfePatchFxn")
    1283                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1284                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1285                            .dwattr $C$DW$118, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    1286                            .dwattr $C$DW$118, DW_AT_decl_line(0x43a)
    1287                            .dwattr $C$DW$118, DW_AT_decl_column(0x0c)
    1288                    
    1289                            .dwattr $C$DW$T$25, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    1290                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x436)
    1291                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1292                            .dwendtag $C$DW$T$25
    1293                    
    1294                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    1295                            .dwattr $C$DW$T$66, DW_AT_name("RF_Mode")
    1296                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$25)
    1297                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1298                            .dwattr $C$DW$T$66, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    1299                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x43b)
    1300                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    1301                    
    1302                    $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    1303                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    1304                            .dwattr $C$DW$T$67, DW_AT_address_class(0x20)
    1305                    
    1306                    
    1307                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1308                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1309                    $C$DW$119       .dwtag  DW_TAG_member
    1310                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$22)
    1311                            .dwattr $C$DW$119, DW_AT_name("triggerType")
    1312                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("triggerType")
    1313                            .dwattr $C$DW$119, DW_AT_bit_offset(0x04)
    1314                            .dwattr $C$DW$119, DW_AT_bit_size(0x04)
    1315                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1316                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1317                            .dwattr $C$DW$119, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1318                            .dwattr $C$DW$119, DW_AT_decl_line(0x7e)
    1319                            .dwattr $C$DW$119, DW_AT_decl_column(0x0f)
    1320                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   25

    1321                    $C$DW$120       .dwtag  DW_TAG_member
    1322                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$22)
    1323                            .dwattr $C$DW$120, DW_AT_name("bEnaCmd")
    1324                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("bEnaCmd")
    1325                            .dwattr $C$DW$120, DW_AT_bit_offset(0x03)
    1326                            .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1327                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1329                            .dwattr $C$DW$120, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1330                            .dwattr $C$DW$120, DW_AT_decl_line(0x7f)
    1331                            .dwattr $C$DW$120, DW_AT_decl_column(0x0f)
    1332                    
    1333                    $C$DW$121       .dwtag  DW_TAG_member
    1334                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$22)
    1335                            .dwattr $C$DW$121, DW_AT_name("triggerNo")
    1336                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("triggerNo")
    1337                            .dwattr $C$DW$121, DW_AT_bit_offset(0x01)
    1338                            .dwattr $C$DW$121, DW_AT_bit_size(0x02)
    1339                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1341                            .dwattr $C$DW$121, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1342                            .dwattr $C$DW$121, DW_AT_decl_line(0x81)
    1343                            .dwattr $C$DW$121, DW_AT_decl_column(0x0f)
    1344                    
    1345                    $C$DW$122       .dwtag  DW_TAG_member
    1346                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$22)
    1347                            .dwattr $C$DW$122, DW_AT_name("pastTrig")
    1348                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("pastTrig")
    1349                            .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    1350                            .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1351                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1353                            .dwattr $C$DW$122, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1354                            .dwattr $C$DW$122, DW_AT_decl_line(0x82)
    1355                            .dwattr $C$DW$122, DW_AT_decl_column(0x0f)
    1356                    
    1357                            .dwattr $C$DW$T$26, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1358                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7d)
    1359                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    1360                            .dwendtag $C$DW$T$26
    1361                    
    1362                    
    1363                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1364                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1365                    $C$DW$123       .dwtag  DW_TAG_member
    1366                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$22)
    1367                            .dwattr $C$DW$123, DW_AT_name("rule")
    1368                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("rule")
    1369                            .dwattr $C$DW$123, DW_AT_bit_offset(0x04)
    1370                            .dwattr $C$DW$123, DW_AT_bit_size(0x04)
    1371                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1372                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1373                            .dwattr $C$DW$123, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1374                            .dwattr $C$DW$123, DW_AT_decl_line(0x86)
    1375                            .dwattr $C$DW$123, DW_AT_decl_column(0x0f)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   26

    1376                    
    1377                    $C$DW$124       .dwtag  DW_TAG_member
    1378                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$22)
    1379                            .dwattr $C$DW$124, DW_AT_name("nSkip")
    1380                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("nSkip")
    1381                            .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    1382                            .dwattr $C$DW$124, DW_AT_bit_size(0x04)
    1383                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1385                            .dwattr $C$DW$124, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1386                            .dwattr $C$DW$124, DW_AT_decl_line(0x87)
    1387                            .dwattr $C$DW$124, DW_AT_decl_column(0x0f)
    1388                    
    1389                            .dwattr $C$DW$T$27, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1390                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x85)
    1391                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    1392                            .dwendtag $C$DW$T$27
    1393                    
    1394                    
    1395                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1396                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1397                    $C$DW$125       .dwtag  DW_TAG_member
    1398                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$22)
    1399                            .dwattr $C$DW$125, DW_AT_name("triggerType")
    1400                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("triggerType")
    1401                            .dwattr $C$DW$125, DW_AT_bit_offset(0x04)
    1402                            .dwattr $C$DW$125, DW_AT_bit_size(0x04)
    1403                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1405                            .dwattr $C$DW$125, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1406                            .dwattr $C$DW$125, DW_AT_decl_line(0x1cf)
    1407                            .dwattr $C$DW$125, DW_AT_decl_column(0x0f)
    1408                    
    1409                    $C$DW$126       .dwtag  DW_TAG_member
    1410                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$22)
    1411                            .dwattr $C$DW$126, DW_AT_name("bEnaCmd")
    1412                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("bEnaCmd")
    1413                            .dwattr $C$DW$126, DW_AT_bit_offset(0x03)
    1414                            .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1415                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1417                            .dwattr $C$DW$126, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1418                            .dwattr $C$DW$126, DW_AT_decl_line(0x1d0)
    1419                            .dwattr $C$DW$126, DW_AT_decl_column(0x0f)
    1420                    
    1421                    $C$DW$127       .dwtag  DW_TAG_member
    1422                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$22)
    1423                            .dwattr $C$DW$127, DW_AT_name("triggerNo")
    1424                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("triggerNo")
    1425                            .dwattr $C$DW$127, DW_AT_bit_offset(0x01)
    1426                            .dwattr $C$DW$127, DW_AT_bit_size(0x02)
    1427                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1429                            .dwattr $C$DW$127, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1430                            .dwattr $C$DW$127, DW_AT_decl_line(0x1d2)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   27

    1431                            .dwattr $C$DW$127, DW_AT_decl_column(0x0f)
    1432                    
    1433                    $C$DW$128       .dwtag  DW_TAG_member
    1434                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$22)
    1435                            .dwattr $C$DW$128, DW_AT_name("pastTrig")
    1436                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("pastTrig")
    1437                            .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    1438                            .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1439                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1441                            .dwattr $C$DW$128, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1442                            .dwattr $C$DW$128, DW_AT_decl_line(0x1d3)
    1443                            .dwattr $C$DW$128, DW_AT_decl_column(0x0f)
    1444                    
    1445                            .dwattr $C$DW$T$28, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1446                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x1ce)
    1447                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    1448                            .dwendtag $C$DW$T$28
    1449                    
    1450                    
    1451                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1452                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1453                    $C$DW$129       .dwtag  DW_TAG_member
    1454                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$22)
    1455                            .dwattr $C$DW$129, DW_AT_name("rule")
    1456                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("rule")
    1457                            .dwattr $C$DW$129, DW_AT_bit_offset(0x04)
    1458                            .dwattr $C$DW$129, DW_AT_bit_size(0x04)
    1459                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1461                            .dwattr $C$DW$129, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1462                            .dwattr $C$DW$129, DW_AT_decl_line(0x1d7)
    1463                            .dwattr $C$DW$129, DW_AT_decl_column(0x0f)
    1464                    
    1465                    $C$DW$130       .dwtag  DW_TAG_member
    1466                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$22)
    1467                            .dwattr $C$DW$130, DW_AT_name("nSkip")
    1468                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("nSkip")
    1469                            .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    1470                            .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    1471                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1473                            .dwattr $C$DW$130, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1474                            .dwattr $C$DW$130, DW_AT_decl_line(0x1d8)
    1475                            .dwattr $C$DW$130, DW_AT_decl_column(0x0f)
    1476                    
    1477                            .dwattr $C$DW$T$29, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1478                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x1d6)
    1479                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    1480                            .dwendtag $C$DW$T$29
    1481                    
    1482                    
    1483                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1484                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1485                    $C$DW$131       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   28

    1486                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$31)
    1487                            .dwattr $C$DW$131, DW_AT_name("modType")
    1488                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("modType")
    1489                            .dwattr $C$DW$131, DW_AT_bit_offset(0x0d)
    1490                            .dwattr $C$DW$131, DW_AT_bit_size(0x03)
    1491                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1493                            .dwattr $C$DW$131, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1494                            .dwattr $C$DW$131, DW_AT_decl_line(0x1db)
    1495                            .dwattr $C$DW$131, DW_AT_decl_column(0x10)
    1496                    
    1497                    $C$DW$132       .dwtag  DW_TAG_member
    1498                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$31)
    1499                            .dwattr $C$DW$132, DW_AT_name("deviation")
    1500                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("deviation")
    1501                            .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    1502                            .dwattr $C$DW$132, DW_AT_bit_size(0x0d)
    1503                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1505                            .dwattr $C$DW$132, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1506                            .dwattr $C$DW$132, DW_AT_decl_line(0x1de)
    1507                            .dwattr $C$DW$132, DW_AT_decl_column(0x10)
    1508                    
    1509                            .dwattr $C$DW$T$32, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1510                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x1da)
    1511                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    1512                            .dwendtag $C$DW$T$32
    1513                    
    1514                    
    1515                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1516                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1517                    $C$DW$133       .dwtag  DW_TAG_member
    1518                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$34)
    1519                            .dwattr $C$DW$133, DW_AT_name("preScale")
    1520                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("preScale")
    1521                            .dwattr $C$DW$133, DW_AT_bit_offset(0x1c)
    1522                            .dwattr $C$DW$133, DW_AT_bit_size(0x04)
    1523                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1525                            .dwattr $C$DW$133, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1526                            .dwattr $C$DW$133, DW_AT_decl_line(0x1e1)
    1527                            .dwattr $C$DW$133, DW_AT_decl_column(0x10)
    1528                    
    1529                    $C$DW$134       .dwtag  DW_TAG_member
    1530                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$34)
    1531                            .dwattr $C$DW$134, DW_AT_name("rateWord")
    1532                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("rateWord")
    1533                            .dwattr $C$DW$134, DW_AT_bit_offset(0x03)
    1534                            .dwattr $C$DW$134, DW_AT_bit_size(0x15)
    1535                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1537                            .dwattr $C$DW$134, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1538                            .dwattr $C$DW$134, DW_AT_decl_line(0x1e3)
    1539                            .dwattr $C$DW$134, DW_AT_decl_column(0x10)
    1540                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   29

    1541                    $C$DW$135       .dwtag  DW_TAG_member
    1542                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$34)
    1543                            .dwattr $C$DW$135, DW_AT_name("decimMode")
    1544                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("decimMode")
    1545                            .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1546                            .dwattr $C$DW$135, DW_AT_bit_size(0x03)
    1547                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1549                            .dwattr $C$DW$135, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1550                            .dwattr $C$DW$135, DW_AT_decl_line(0x1e4)
    1551                            .dwattr $C$DW$135, DW_AT_decl_column(0x10)
    1552                    
    1553                            .dwattr $C$DW$T$35, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1554                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1e0)
    1555                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    1556                            .dwendtag $C$DW$T$35
    1557                    
    1558                    
    1559                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1560                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1561                    $C$DW$136       .dwtag  DW_TAG_member
    1562                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    1563                            .dwattr $C$DW$136, DW_AT_name("nPreamBytes")
    1564                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("nPreamBytes")
    1565                            .dwattr $C$DW$136, DW_AT_bit_offset(0x02)
    1566                            .dwattr $C$DW$136, DW_AT_bit_size(0x06)
    1567                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1569                            .dwattr $C$DW$136, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1570                            .dwattr $C$DW$136, DW_AT_decl_line(0x1ec)
    1571                            .dwattr $C$DW$136, DW_AT_decl_column(0x0f)
    1572                    
    1573                    $C$DW$137       .dwtag  DW_TAG_member
    1574                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
    1575                            .dwattr $C$DW$137, DW_AT_name("preamMode")
    1576                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("preamMode")
    1577                            .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    1578                            .dwattr $C$DW$137, DW_AT_bit_size(0x02)
    1579                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1581                            .dwattr $C$DW$137, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1582                            .dwattr $C$DW$137, DW_AT_decl_line(0x1f2)
    1583                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    1584                    
    1585                            .dwattr $C$DW$T$36, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1586                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x1eb)
    1587                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    1588                            .dwendtag $C$DW$T$36
    1589                    
    1590                    
    1591                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1592                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1593                    $C$DW$138       .dwtag  DW_TAG_member
    1594                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$31)
    1595                            .dwattr $C$DW$138, DW_AT_name("nSwBits")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   30

    1596                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("nSwBits")
    1597                            .dwattr $C$DW$138, DW_AT_bit_offset(0x0a)
    1598                            .dwattr $C$DW$138, DW_AT_bit_size(0x06)
    1599                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1601                            .dwattr $C$DW$138, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1602                            .dwattr $C$DW$138, DW_AT_decl_line(0x1f8)
    1603                            .dwattr $C$DW$138, DW_AT_decl_column(0x10)
    1604                    
    1605                    $C$DW$139       .dwtag  DW_TAG_member
    1606                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$31)
    1607                            .dwattr $C$DW$139, DW_AT_name("bBitReversal")
    1608                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("bBitReversal")
    1609                            .dwattr $C$DW$139, DW_AT_bit_offset(0x09)
    1610                            .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1611                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$139, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1614                            .dwattr $C$DW$139, DW_AT_decl_line(0x1f9)
    1615                            .dwattr $C$DW$139, DW_AT_decl_column(0x10)
    1616                    
    1617                    $C$DW$140       .dwtag  DW_TAG_member
    1618                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$31)
    1619                            .dwattr $C$DW$140, DW_AT_name("bMsbFirst")
    1620                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("bMsbFirst")
    1621                            .dwattr $C$DW$140, DW_AT_bit_offset(0x08)
    1622                            .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1623                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1625                            .dwattr $C$DW$140, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1626                            .dwattr $C$DW$140, DW_AT_decl_line(0x1fb)
    1627                            .dwattr $C$DW$140, DW_AT_decl_column(0x10)
    1628                    
    1629                    $C$DW$141       .dwtag  DW_TAG_member
    1630                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$31)
    1631                            .dwattr $C$DW$141, DW_AT_name("fecMode")
    1632                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("fecMode")
    1633                            .dwattr $C$DW$141, DW_AT_bit_offset(0x04)
    1634                            .dwattr $C$DW$141, DW_AT_bit_size(0x04)
    1635                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1637                            .dwattr $C$DW$141, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1638                            .dwattr $C$DW$141, DW_AT_decl_line(0x1fd)
    1639                            .dwattr $C$DW$141, DW_AT_decl_column(0x10)
    1640                    
    1641                    $C$DW$142       .dwtag  DW_TAG_member
    1642                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$31)
    1643                            .dwattr $C$DW$142, DW_AT_name("whitenMode")
    1644                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("whitenMode")
    1645                            .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    1646                            .dwattr $C$DW$142, DW_AT_bit_size(0x03)
    1647                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1649                            .dwattr $C$DW$142, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1650                            .dwattr $C$DW$142, DW_AT_decl_line(0x202)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   31

    1651                            .dwattr $C$DW$142, DW_AT_decl_column(0x10)
    1652                    
    1653                            .dwattr $C$DW$T$37, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1654                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x1f7)
    1655                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    1656                            .dwendtag $C$DW$T$37
    1657                    
    1658                    
    1659                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1660                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1661                    $C$DW$143       .dwtag  DW_TAG_member
    1662                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$31)
    1663                            .dwattr $C$DW$143, DW_AT_name("frontEndMode")
    1664                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("frontEndMode")
    1665                            .dwattr $C$DW$143, DW_AT_bit_offset(0x0d)
    1666                            .dwattr $C$DW$143, DW_AT_bit_size(0x03)
    1667                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1668                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1669                            .dwattr $C$DW$143, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1670                            .dwattr $C$DW$143, DW_AT_decl_line(0x20c)
    1671                            .dwattr $C$DW$143, DW_AT_decl_column(0x10)
    1672                    
    1673                    $C$DW$144       .dwtag  DW_TAG_member
    1674                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
    1675                            .dwattr $C$DW$144, DW_AT_name("biasMode")
    1676                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("biasMode")
    1677                            .dwattr $C$DW$144, DW_AT_bit_offset(0x0c)
    1678                            .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1679                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1681                            .dwattr $C$DW$144, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1682                            .dwattr $C$DW$144, DW_AT_decl_line(0x212)
    1683                            .dwattr $C$DW$144, DW_AT_decl_column(0x10)
    1684                    
    1685                    $C$DW$145       .dwtag  DW_TAG_member
    1686                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$31)
    1687                            .dwattr $C$DW$145, DW_AT_name("analogCfgMode")
    1688                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("analogCfgMode")
    1689                            .dwattr $C$DW$145, DW_AT_bit_offset(0x06)
    1690                            .dwattr $C$DW$145, DW_AT_bit_size(0x06)
    1691                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1693                            .dwattr $C$DW$145, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1694                            .dwattr $C$DW$145, DW_AT_decl_line(0x214)
    1695                            .dwattr $C$DW$145, DW_AT_decl_column(0x10)
    1696                    
    1697                    $C$DW$146       .dwtag  DW_TAG_member
    1698                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$31)
    1699                            .dwattr $C$DW$146, DW_AT_name("bNoFsPowerUp")
    1700                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("bNoFsPowerUp")
    1701                            .dwattr $C$DW$146, DW_AT_bit_offset(0x05)
    1702                            .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1703                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1705                            .dwattr $C$DW$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   32

    1706                            .dwattr $C$DW$146, DW_AT_decl_line(0x21b)
    1707                            .dwattr $C$DW$146, DW_AT_decl_column(0x10)
    1708                    
    1709                            .dwattr $C$DW$T$38, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1710                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x20b)
    1711                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    1712                            .dwendtag $C$DW$T$38
    1713                    
    1714                    
    1715                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1716                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1717                    $C$DW$147       .dwtag  DW_TAG_member
    1718                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
    1719                            .dwattr $C$DW$147, DW_AT_name("triggerType")
    1720                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("triggerType")
    1721                            .dwattr $C$DW$147, DW_AT_bit_offset(0x04)
    1722                            .dwattr $C$DW$147, DW_AT_bit_size(0x04)
    1723                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1724                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1725                            .dwattr $C$DW$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1726                            .dwattr $C$DW$147, DW_AT_decl_line(0xf3)
    1727                            .dwattr $C$DW$147, DW_AT_decl_column(0x0f)
    1728                    
    1729                    $C$DW$148       .dwtag  DW_TAG_member
    1730                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$22)
    1731                            .dwattr $C$DW$148, DW_AT_name("bEnaCmd")
    1732                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("bEnaCmd")
    1733                            .dwattr $C$DW$148, DW_AT_bit_offset(0x03)
    1734                            .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1735                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1736                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1737                            .dwattr $C$DW$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1738                            .dwattr $C$DW$148, DW_AT_decl_line(0xf4)
    1739                            .dwattr $C$DW$148, DW_AT_decl_column(0x0f)
    1740                    
    1741                    $C$DW$149       .dwtag  DW_TAG_member
    1742                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$22)
    1743                            .dwattr $C$DW$149, DW_AT_name("triggerNo")
    1744                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("triggerNo")
    1745                            .dwattr $C$DW$149, DW_AT_bit_offset(0x01)
    1746                            .dwattr $C$DW$149, DW_AT_bit_size(0x02)
    1747                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1748                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1749                            .dwattr $C$DW$149, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1750                            .dwattr $C$DW$149, DW_AT_decl_line(0xf6)
    1751                            .dwattr $C$DW$149, DW_AT_decl_column(0x0f)
    1752                    
    1753                    $C$DW$150       .dwtag  DW_TAG_member
    1754                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$22)
    1755                            .dwattr $C$DW$150, DW_AT_name("pastTrig")
    1756                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("pastTrig")
    1757                            .dwattr $C$DW$150, DW_AT_bit_offset(0x00)
    1758                            .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1759                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   33

    1761                            .dwattr $C$DW$150, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1762                            .dwattr $C$DW$150, DW_AT_decl_line(0xf7)
    1763                            .dwattr $C$DW$150, DW_AT_decl_column(0x0f)
    1764                    
    1765                            .dwattr $C$DW$T$39, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1766                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xf2)
    1767                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    1768                            .dwendtag $C$DW$T$39
    1769                    
    1770                    
    1771                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1772                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1773                    $C$DW$151       .dwtag  DW_TAG_member
    1774                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$22)
    1775                            .dwattr $C$DW$151, DW_AT_name("rule")
    1776                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("rule")
    1777                            .dwattr $C$DW$151, DW_AT_bit_offset(0x04)
    1778                            .dwattr $C$DW$151, DW_AT_bit_size(0x04)
    1779                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1780                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1781                            .dwattr $C$DW$151, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1782                            .dwattr $C$DW$151, DW_AT_decl_line(0xfb)
    1783                            .dwattr $C$DW$151, DW_AT_decl_column(0x0f)
    1784                    
    1785                    $C$DW$152       .dwtag  DW_TAG_member
    1786                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$22)
    1787                            .dwattr $C$DW$152, DW_AT_name("nSkip")
    1788                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("nSkip")
    1789                            .dwattr $C$DW$152, DW_AT_bit_offset(0x00)
    1790                            .dwattr $C$DW$152, DW_AT_bit_size(0x04)
    1791                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1793                            .dwattr $C$DW$152, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1794                            .dwattr $C$DW$152, DW_AT_decl_line(0xfc)
    1795                            .dwattr $C$DW$152, DW_AT_decl_column(0x0f)
    1796                    
    1797                            .dwattr $C$DW$T$40, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1798                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xfa)
    1799                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    1800                            .dwendtag $C$DW$T$40
    1801                    
    1802                    
    1803                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1804                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1805                    $C$DW$153       .dwtag  DW_TAG_member
    1806                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$22)
    1807                            .dwattr $C$DW$153, DW_AT_name("bTxMode")
    1808                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("bTxMode")
    1809                            .dwattr $C$DW$153, DW_AT_bit_offset(0x07)
    1810                            .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1811                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1813                            .dwattr $C$DW$153, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1814                            .dwattr $C$DW$153, DW_AT_decl_line(0x101)
    1815                            .dwattr $C$DW$153, DW_AT_decl_column(0x0f)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   34

    1816                    
    1817                    $C$DW$154       .dwtag  DW_TAG_member
    1818                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$22)
    1819                            .dwattr $C$DW$154, DW_AT_name("refFreq")
    1820                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("refFreq")
    1821                            .dwattr $C$DW$154, DW_AT_bit_offset(0x01)
    1822                            .dwattr $C$DW$154, DW_AT_bit_size(0x06)
    1823                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1824                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1825                            .dwattr $C$DW$154, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1826                            .dwattr $C$DW$154, DW_AT_decl_line(0x103)
    1827                            .dwattr $C$DW$154, DW_AT_decl_column(0x0f)
    1828                    
    1829                            .dwattr $C$DW$T$41, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1830                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x100)
    1831                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    1832                            .dwendtag $C$DW$T$41
    1833                    
    1834                    
    1835                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1836                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1837                    $C$DW$155       .dwtag  DW_TAG_member
    1838                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$22)
    1839                            .dwattr $C$DW$155, DW_AT_name("triggerType")
    1840                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("triggerType")
    1841                            .dwattr $C$DW$155, DW_AT_bit_offset(0x04)
    1842                            .dwattr $C$DW$155, DW_AT_bit_size(0x04)
    1843                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1844                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1845                            .dwattr $C$DW$155, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1846                            .dwattr $C$DW$155, DW_AT_decl_line(0x86)
    1847                            .dwattr $C$DW$155, DW_AT_decl_column(0x0f)
    1848                    
    1849                    $C$DW$156       .dwtag  DW_TAG_member
    1850                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$22)
    1851                            .dwattr $C$DW$156, DW_AT_name("bEnaCmd")
    1852                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("bEnaCmd")
    1853                            .dwattr $C$DW$156, DW_AT_bit_offset(0x03)
    1854                            .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1855                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1856                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1857                            .dwattr $C$DW$156, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1858                            .dwattr $C$DW$156, DW_AT_decl_line(0x87)
    1859                            .dwattr $C$DW$156, DW_AT_decl_column(0x0f)
    1860                    
    1861                    $C$DW$157       .dwtag  DW_TAG_member
    1862                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
    1863                            .dwattr $C$DW$157, DW_AT_name("triggerNo")
    1864                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("triggerNo")
    1865                            .dwattr $C$DW$157, DW_AT_bit_offset(0x01)
    1866                            .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    1867                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1868                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1869                            .dwattr $C$DW$157, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1870                            .dwattr $C$DW$157, DW_AT_decl_line(0x89)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   35

    1871                            .dwattr $C$DW$157, DW_AT_decl_column(0x0f)
    1872                    
    1873                    $C$DW$158       .dwtag  DW_TAG_member
    1874                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$22)
    1875                            .dwattr $C$DW$158, DW_AT_name("pastTrig")
    1876                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("pastTrig")
    1877                            .dwattr $C$DW$158, DW_AT_bit_offset(0x00)
    1878                            .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1879                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1881                            .dwattr $C$DW$158, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1882                            .dwattr $C$DW$158, DW_AT_decl_line(0x8a)
    1883                            .dwattr $C$DW$158, DW_AT_decl_column(0x0f)
    1884                    
    1885                            .dwattr $C$DW$T$42, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1886                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x85)
    1887                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    1888                            .dwendtag $C$DW$T$42
    1889                    
    1890                    
    1891                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1892                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1893                    $C$DW$159       .dwtag  DW_TAG_member
    1894                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$22)
    1895                            .dwattr $C$DW$159, DW_AT_name("rule")
    1896                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("rule")
    1897                            .dwattr $C$DW$159, DW_AT_bit_offset(0x04)
    1898                            .dwattr $C$DW$159, DW_AT_bit_size(0x04)
    1899                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1900                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1901                            .dwattr $C$DW$159, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1902                            .dwattr $C$DW$159, DW_AT_decl_line(0x8e)
    1903                            .dwattr $C$DW$159, DW_AT_decl_column(0x0f)
    1904                    
    1905                    $C$DW$160       .dwtag  DW_TAG_member
    1906                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$22)
    1907                            .dwattr $C$DW$160, DW_AT_name("nSkip")
    1908                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("nSkip")
    1909                            .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    1910                            .dwattr $C$DW$160, DW_AT_bit_size(0x04)
    1911                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1913                            .dwattr $C$DW$160, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1914                            .dwattr $C$DW$160, DW_AT_decl_line(0x8f)
    1915                            .dwattr $C$DW$160, DW_AT_decl_column(0x0f)
    1916                    
    1917                            .dwattr $C$DW$T$43, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1918                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x8d)
    1919                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    1920                            .dwendtag $C$DW$T$43
    1921                    
    1922                    
    1923                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1924                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1925                    $C$DW$161       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   36

    1926                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$22)
    1927                            .dwattr $C$DW$161, DW_AT_name("bFsOff")
    1928                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("bFsOff")
    1929                            .dwattr $C$DW$161, DW_AT_bit_offset(0x07)
    1930                            .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    1931                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1932                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1933                            .dwattr $C$DW$161, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1934                            .dwattr $C$DW$161, DW_AT_decl_line(0x92)
    1935                            .dwattr $C$DW$161, DW_AT_decl_column(0x0f)
    1936                    
    1937                    $C$DW$162       .dwtag  DW_TAG_member
    1938                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
    1939                            .dwattr $C$DW$162, DW_AT_name("bUseCrc")
    1940                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("bUseCrc")
    1941                            .dwattr $C$DW$162, DW_AT_bit_offset(0x04)
    1942                            .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    1943                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1945                            .dwattr $C$DW$162, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1946                            .dwattr $C$DW$162, DW_AT_decl_line(0x95)
    1947                            .dwattr $C$DW$162, DW_AT_decl_column(0x0f)
    1948                    
    1949                    $C$DW$163       .dwtag  DW_TAG_member
    1950                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
    1951                            .dwattr $C$DW$163, DW_AT_name("bVarLen")
    1952                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("bVarLen")
    1953                            .dwattr $C$DW$163, DW_AT_bit_offset(0x03)
    1954                            .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1955                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1956                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1957                            .dwattr $C$DW$163, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    1958                            .dwattr $C$DW$163, DW_AT_decl_line(0x97)
    1959                            .dwattr $C$DW$163, DW_AT_decl_column(0x0f)
    1960                    
    1961                            .dwattr $C$DW$T$44, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    1962                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x91)
    1963                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    1964                            .dwendtag $C$DW$T$44
    1965                    
    1966                    
    1967                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1968                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    1969                    $C$DW$164       .dwtag  DW_TAG_member
    1970                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$34)
    1971                            .dwattr $C$DW$164, DW_AT_name("rawValue")
    1972                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("rawValue")
    1973                            .dwattr $C$DW$164, DW_AT_bit_offset(0x0a)
    1974                            .dwattr $C$DW$164, DW_AT_bit_size(0x16)
    1975                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1976                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1977                            .dwattr $C$DW$164, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    1978                            .dwattr $C$DW$164, DW_AT_decl_line(0x3ec)
    1979                            .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    1980                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   37

    1981                    $C$DW$165       .dwtag  DW_TAG_member
    1982                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$34)
    1983                            .dwattr $C$DW$165, DW_AT_name("__dummy")
    1984                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("__dummy")
    1985                            .dwattr $C$DW$165, DW_AT_bit_offset(0x01)
    1986                            .dwattr $C$DW$165, DW_AT_bit_size(0x09)
    1987                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1988                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1989                            .dwattr $C$DW$165, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    1990                            .dwattr $C$DW$165, DW_AT_decl_line(0x3f0)
    1991                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    1992                    
    1993                    $C$DW$166       .dwtag  DW_TAG_member
    1994                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$34)
    1995                            .dwattr $C$DW$166, DW_AT_name("paType")
    1996                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("paType")
    1997                            .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    1998                            .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    1999                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2001                            .dwattr $C$DW$166, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    2002                            .dwattr $C$DW$166, DW_AT_decl_line(0x3f1)
    2003                            .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    2004                    
    2005                            .dwattr $C$DW$T$45, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    2006                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x3eb)
    2007                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    2008                            .dwendtag $C$DW$T$45
    2009                    
    2010                    $C$DW$T$48      .dwtag  DW_TAG_typedef
    2011                            .dwattr $C$DW$T$48, DW_AT_name("RF_TxPowerTable_Value")
    2012                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$45)
    2013                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2014                            .dwattr $C$DW$T$48, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    2015                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x3f5)
    2016                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    2017                    
    2018                    
    2019                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2020                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x05)
    2021                    $C$DW$167       .dwtag  DW_TAG_member
    2022                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$47)
    2023                            .dwattr $C$DW$167, DW_AT_name("power")
    2024                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("power")
    2025                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2026                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2027                            .dwattr $C$DW$167, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    2028                            .dwattr $C$DW$167, DW_AT_decl_line(0x40b)
    2029                            .dwattr $C$DW$167, DW_AT_decl_column(0x0c)
    2030                    
    2031                    $C$DW$168       .dwtag  DW_TAG_member
    2032                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$48)
    2033                            .dwattr $C$DW$168, DW_AT_name("value")
    2034                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("value")
    2035                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   38

    2036                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2037                            .dwattr $C$DW$168, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    2038                            .dwattr $C$DW$168, DW_AT_decl_line(0x40e)
    2039                            .dwattr $C$DW$168, DW_AT_decl_column(0x1b)
    2040                    
    2041                            .dwattr $C$DW$T$49, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    2042                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x40a)
    2043                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    2044                            .dwendtag $C$DW$T$49
    2045                    
    2046                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    2047                            .dwattr $C$DW$T$76, DW_AT_name("RF_TxPowerTable_Entry")
    2048                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$49)
    2049                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2050                            .dwattr $C$DW$T$76, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
    2051                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x40f)
    2052                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x1b)
    2053                    
    2054                    $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    2055                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2056                            .dwattr $C$DW$T$77, DW_AT_address_class(0x20)
    2057                    
    2058                    
    2059                    $C$DW$T$630     .dwtag  DW_TAG_array_type
    2060                            .dwattr $C$DW$T$630, DW_AT_type(*$C$DW$T$76)
    2061                            .dwattr $C$DW$T$630, DW_AT_language(DW_LANG_C)
    2062                    $C$DW$169       .dwtag  DW_TAG_subrange_type
    2063                    
    2064                            .dwendtag $C$DW$T$630
    2065                    
    2066                    
    2067                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2068                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2069                    $C$DW$170       .dwtag  DW_TAG_member
    2070                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2071                            .dwattr $C$DW$170, DW_AT_name("triggerType")
    2072                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("triggerType")
    2073                            .dwattr $C$DW$170, DW_AT_bit_offset(0x04)
    2074                            .dwattr $C$DW$170, DW_AT_bit_size(0x04)
    2075                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2076                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2077                            .dwattr $C$DW$170, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2078                            .dwattr $C$DW$170, DW_AT_decl_line(0x135)
    2079                            .dwattr $C$DW$170, DW_AT_decl_column(0x0f)
    2080                    
    2081                    $C$DW$171       .dwtag  DW_TAG_member
    2082                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2083                            .dwattr $C$DW$171, DW_AT_name("bEnaCmd")
    2084                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("bEnaCmd")
    2085                            .dwattr $C$DW$171, DW_AT_bit_offset(0x03)
    2086                            .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2087                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2088                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2089                            .dwattr $C$DW$171, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2090                            .dwattr $C$DW$171, DW_AT_decl_line(0x136)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   39

    2091                            .dwattr $C$DW$171, DW_AT_decl_column(0x0f)
    2092                    
    2093                    $C$DW$172       .dwtag  DW_TAG_member
    2094                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    2095                            .dwattr $C$DW$172, DW_AT_name("triggerNo")
    2096                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("triggerNo")
    2097                            .dwattr $C$DW$172, DW_AT_bit_offset(0x01)
    2098                            .dwattr $C$DW$172, DW_AT_bit_size(0x02)
    2099                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwattr $C$DW$172, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2102                            .dwattr $C$DW$172, DW_AT_decl_line(0x138)
    2103                            .dwattr $C$DW$172, DW_AT_decl_column(0x0f)
    2104                    
    2105                    $C$DW$173       .dwtag  DW_TAG_member
    2106                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    2107                            .dwattr $C$DW$173, DW_AT_name("pastTrig")
    2108                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("pastTrig")
    2109                            .dwattr $C$DW$173, DW_AT_bit_offset(0x00)
    2110                            .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2111                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2112                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2113                            .dwattr $C$DW$173, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2114                            .dwattr $C$DW$173, DW_AT_decl_line(0x139)
    2115                            .dwattr $C$DW$173, DW_AT_decl_column(0x0f)
    2116                    
    2117                            .dwattr $C$DW$T$50, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    2118                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x134)
    2119                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x0b)
    2120                            .dwendtag $C$DW$T$50
    2121                    
    2122                    
    2123                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    2124                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2125                    $C$DW$174       .dwtag  DW_TAG_member
    2126                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    2127                            .dwattr $C$DW$174, DW_AT_name("rule")
    2128                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("rule")
    2129                            .dwattr $C$DW$174, DW_AT_bit_offset(0x04)
    2130                            .dwattr $C$DW$174, DW_AT_bit_size(0x04)
    2131                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2133                            .dwattr $C$DW$174, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2134                            .dwattr $C$DW$174, DW_AT_decl_line(0x13d)
    2135                            .dwattr $C$DW$174, DW_AT_decl_column(0x0f)
    2136                    
    2137                    $C$DW$175       .dwtag  DW_TAG_member
    2138                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    2139                            .dwattr $C$DW$175, DW_AT_name("nSkip")
    2140                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("nSkip")
    2141                            .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2142                            .dwattr $C$DW$175, DW_AT_bit_size(0x04)
    2143                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2145                            .dwattr $C$DW$175, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   40

    2146                            .dwattr $C$DW$175, DW_AT_decl_line(0x13e)
    2147                            .dwattr $C$DW$175, DW_AT_decl_column(0x0f)
    2148                    
    2149                            .dwattr $C$DW$T$51, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    2150                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x13c)
    2151                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x0b)
    2152                            .dwendtag $C$DW$T$51
    2153                    
    2154                    
    2155                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2156                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2157                    $C$DW$176       .dwtag  DW_TAG_member
    2158                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    2159                            .dwattr $C$DW$176, DW_AT_name("bFsOff")
    2160                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("bFsOff")
    2161                            .dwattr $C$DW$176, DW_AT_bit_offset(0x07)
    2162                            .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2163                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2164                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2165                            .dwattr $C$DW$176, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2166                            .dwattr $C$DW$176, DW_AT_decl_line(0x141)
    2167                            .dwattr $C$DW$176, DW_AT_decl_column(0x0f)
    2168                    
    2169                    $C$DW$177       .dwtag  DW_TAG_member
    2170                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    2171                            .dwattr $C$DW$177, DW_AT_name("bRepeatOk")
    2172                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("bRepeatOk")
    2173                            .dwattr $C$DW$177, DW_AT_bit_offset(0x06)
    2174                            .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2175                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2177                            .dwattr $C$DW$177, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2178                            .dwattr $C$DW$177, DW_AT_decl_line(0x143)
    2179                            .dwattr $C$DW$177, DW_AT_decl_column(0x0f)
    2180                    
    2181                    $C$DW$178       .dwtag  DW_TAG_member
    2182                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    2183                            .dwattr $C$DW$178, DW_AT_name("bRepeatNok")
    2184                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("bRepeatNok")
    2185                            .dwattr $C$DW$178, DW_AT_bit_offset(0x05)
    2186                            .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2187                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2188                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2189                            .dwattr $C$DW$178, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2190                            .dwattr $C$DW$178, DW_AT_decl_line(0x145)
    2191                            .dwattr $C$DW$178, DW_AT_decl_column(0x0f)
    2192                    
    2193                    $C$DW$179       .dwtag  DW_TAG_member
    2194                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$22)
    2195                            .dwattr $C$DW$179, DW_AT_name("bUseCrc")
    2196                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("bUseCrc")
    2197                            .dwattr $C$DW$179, DW_AT_bit_offset(0x04)
    2198                            .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2199                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2200                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   41

    2201                            .dwattr $C$DW$179, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2202                            .dwattr $C$DW$179, DW_AT_decl_line(0x147)
    2203                            .dwattr $C$DW$179, DW_AT_decl_column(0x0f)
    2204                    
    2205                    $C$DW$180       .dwtag  DW_TAG_member
    2206                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    2207                            .dwattr $C$DW$180, DW_AT_name("bCrcIncSw")
    2208                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("bCrcIncSw")
    2209                            .dwattr $C$DW$180, DW_AT_bit_offset(0x03)
    2210                            .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2211                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2212                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2213                            .dwattr $C$DW$180, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2214                            .dwattr $C$DW$180, DW_AT_decl_line(0x149)
    2215                            .dwattr $C$DW$180, DW_AT_decl_column(0x0f)
    2216                    
    2217                    $C$DW$181       .dwtag  DW_TAG_member
    2218                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$22)
    2219                            .dwattr $C$DW$181, DW_AT_name("bCrcIncHdr")
    2220                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("bCrcIncHdr")
    2221                            .dwattr $C$DW$181, DW_AT_bit_offset(0x02)
    2222                            .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2223                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2224                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2225                            .dwattr $C$DW$181, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2226                            .dwattr $C$DW$181, DW_AT_decl_line(0x14b)
    2227                            .dwattr $C$DW$181, DW_AT_decl_column(0x0f)
    2228                    
    2229                    $C$DW$182       .dwtag  DW_TAG_member
    2230                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    2231                            .dwattr $C$DW$182, DW_AT_name("endType")
    2232                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("endType")
    2233                            .dwattr $C$DW$182, DW_AT_bit_offset(0x01)
    2234                            .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2235                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2236                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2237                            .dwattr $C$DW$182, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2238                            .dwattr $C$DW$182, DW_AT_decl_line(0x14d)
    2239                            .dwattr $C$DW$182, DW_AT_decl_column(0x0f)
    2240                    
    2241                    $C$DW$183       .dwtag  DW_TAG_member
    2242                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    2243                            .dwattr $C$DW$183, DW_AT_name("filterOp")
    2244                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("filterOp")
    2245                            .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    2246                            .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2247                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2248                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2249                            .dwattr $C$DW$183, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2250                            .dwattr $C$DW$183, DW_AT_decl_line(0x14f)
    2251                            .dwattr $C$DW$183, DW_AT_decl_column(0x0f)
    2252                    
    2253                            .dwattr $C$DW$T$52, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    2254                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x140)
    2255                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x0b)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   42

    2256                            .dwendtag $C$DW$T$52
    2257                    
    2258                    
    2259                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2260                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    2261                    $C$DW$184       .dwtag  DW_TAG_member
    2262                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    2263                            .dwattr $C$DW$184, DW_AT_name("bAutoFlushIgnored")
    2264                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("bAutoFlushIgnored")
    2265                            .dwattr $C$DW$184, DW_AT_bit_offset(0x07)
    2266                            .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2267                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2268                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2269                            .dwattr $C$DW$184, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2270                            .dwattr $C$DW$184, DW_AT_decl_line(0x153)
    2271                            .dwattr $C$DW$184, DW_AT_decl_column(0x0f)
    2272                    
    2273                    $C$DW$185       .dwtag  DW_TAG_member
    2274                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    2275                            .dwattr $C$DW$185, DW_AT_name("bAutoFlushCrcErr")
    2276                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("bAutoFlushCrcErr")
    2277                            .dwattr $C$DW$185, DW_AT_bit_offset(0x06)
    2278                            .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2279                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2280                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2281                            .dwattr $C$DW$185, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2282                            .dwattr $C$DW$185, DW_AT_decl_line(0x154)
    2283                            .dwattr $C$DW$185, DW_AT_decl_column(0x0f)
    2284                    
    2285                    $C$DW$186       .dwtag  DW_TAG_member
    2286                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
    2287                            .dwattr $C$DW$186, DW_AT_name("bIncludeHdr")
    2288                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("bIncludeHdr")
    2289                            .dwattr $C$DW$186, DW_AT_bit_offset(0x04)
    2290                            .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2291                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2292                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2293                            .dwattr $C$DW$186, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2294                            .dwattr $C$DW$186, DW_AT_decl_line(0x156)
    2295                            .dwattr $C$DW$186, DW_AT_decl_column(0x0f)
    2296                    
    2297                    $C$DW$187       .dwtag  DW_TAG_member
    2298                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    2299                            .dwattr $C$DW$187, DW_AT_name("bIncludeCrc")
    2300                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("bIncludeCrc")
    2301                            .dwattr $C$DW$187, DW_AT_bit_offset(0x03)
    2302                            .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2303                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2304                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2305                            .dwattr $C$DW$187, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2306                            .dwattr $C$DW$187, DW_AT_decl_line(0x157)
    2307                            .dwattr $C$DW$187, DW_AT_decl_column(0x0f)
    2308                    
    2309                    $C$DW$188       .dwtag  DW_TAG_member
    2310                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   43

    2311                            .dwattr $C$DW$188, DW_AT_name("bAppendRssi")
    2312                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("bAppendRssi")
    2313                            .dwattr $C$DW$188, DW_AT_bit_offset(0x02)
    2314                            .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2315                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2316                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2317                            .dwattr $C$DW$188, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2318                            .dwattr $C$DW$188, DW_AT_decl_line(0x158)
    2319                            .dwattr $C$DW$188, DW_AT_decl_column(0x0f)
    2320                    
    2321                    $C$DW$189       .dwtag  DW_TAG_member
    2322                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2323                            .dwattr $C$DW$189, DW_AT_name("bAppendTimestamp")
    2324                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("bAppendTimestamp")
    2325                            .dwattr $C$DW$189, DW_AT_bit_offset(0x01)
    2326                            .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2327                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2328                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2329                            .dwattr $C$DW$189, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2330                            .dwattr $C$DW$189, DW_AT_decl_line(0x159)
    2331                            .dwattr $C$DW$189, DW_AT_decl_column(0x0f)
    2332                    
    2333                    $C$DW$190       .dwtag  DW_TAG_member
    2334                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    2335                            .dwattr $C$DW$190, DW_AT_name("bAppendStatus")
    2336                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("bAppendStatus")
    2337                            .dwattr $C$DW$190, DW_AT_bit_offset(0x00)
    2338                            .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2339                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2340                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2341                            .dwattr $C$DW$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2342                            .dwattr $C$DW$190, DW_AT_decl_line(0x15a)
    2343                            .dwattr $C$DW$190, DW_AT_decl_column(0x0f)
    2344                    
    2345                            .dwattr $C$DW$T$53, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
    2346                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x152)
    2347                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x0b)
    2348                            .dwendtag $C$DW$T$53
    2349                    
    2350                    
    2351                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2352                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    2353                    $C$DW$191       .dwtag  DW_TAG_member
    2354                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$31)
    2355                            .dwattr $C$DW$191, DW_AT_name("numHdrBits")
    2356                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("numHdrBits")
    2357                            .dwattr $C$DW$191, DW_AT_bit_offset(0x0a)
    2358                            .dwattr $C$DW$191, DW_AT_bit_size(0x06)
    2359                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2360                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2361                            .dwattr $C$DW$191, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
    2362                            .dwattr $C$DW$191, DW_AT_decl_line(0x161)
    2363                            .dwattr $C$DW$191, DW_AT_decl_column(0x10)
    2364                    
    2365                    $C$DW$192       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
easylink_config.asm                                                  PAGE   44

