TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
       3                    ;* Date/Time created: Fri Apr  2 00:57:45 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../MPU9250/inv_mpu.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
      13                            .global reg
      14 00000000                   .sect   ".const:reg"
      15                            .align  1

   22697                            .global __aeabi_cfcmple
   22698                            .global __aeabi_cfrcmple
   22699                            .global __aeabi_i2d
   22700                            .global __aeabi_cdcmple
   22701                    ;*****************************************************************************
   22702                    ;* SECTION GROUPS                                                            *
   22703                    ;*****************************************************************************
   22704                            .group    "__fpclassify", 1
   22705                            .gmember  ".text:__fpclassify"
   22706                            .endgroup
   22707                            .group    "__fpclassifyf", 1
   22708                            .gmember  ".text:__fpclassifyf"
   22709                            .endgroup
   22710                            .group    "__fpclassifyl", 1
   22711                            .gmember  ".text:__fpclassifyl"
   22712                            .endgroup
   22713                            .group    "__isfinite", 1
   22714                            .gmember  ".text:__isfinite"
   22715                            .endgroup
   22716                            .group    "__isfinitef", 1
   22717                            .gmember  ".text:__isfinitef"
   22718                            .endgroup
   22719                            .group    "__isfinitel", 1
   22720                            .gmember  ".text:__isfinitel"
   22721                            .endgroup
   22722                            .group    "__isinf", 1
   22723                            .gmember  ".text:__isinf"
   22724                            .endgroup
   22725                            .group    "__isinff", 1
   22726                            .gmember  ".text:__isinff"
   22727                            .endgroup
   22728                            .group    "__isinfl", 1
   22729                            .gmember  ".text:__isinfl"
   22730                            .endgroup
   22731                            .group    "__isnan", 1
   22732                            .gmember  ".text:__isnan"
   22733                            .endgroup
   22734                            .group    "__isnanf", 1
   22735                            .gmember  ".text:__isnanf"
   22736                            .endgroup
   22737                            .group    "__isnanl", 1
   22738                            .gmember  ".text:__isnanl"
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  416

   22739                            .endgroup
   22740                            .group    "__isnormal", 1
   22741                            .gmember  ".text:__isnormal"
   22742                            .endgroup
   22743                            .group    "__isnormalf", 1
   22744                            .gmember  ".text:__isnormalf"
   22745                            .endgroup
   22746                            .group    "__isnormall", 1
   22747                            .gmember  ".text:__isnormall"
   22748                            .endgroup
   22749                            .group    "__signbit", 1
   22750                            .gmember  ".text:__signbit"
   22751                            .endgroup
   22752                            .group    "__signbitf", 1
   22753                            .gmember  ".text:__signbitf"
   22754                            .endgroup
   22755                            .group    "__signbitl", 1
   22756                            .gmember  ".text:__signbitl"
   22757                            .endgroup
   22758                    
   22759                    
   22760                    ;******************************************************************************
   22761                    ;* BUILD ATTRIBUTES                                                           *
   22762                    ;******************************************************************************
   22763                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
   22764                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
   22765                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
   22766                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
   22767                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
   22768                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
   22769                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
   22770                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
   22771                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
   22772                            .battr "TI", Tag_File, 1, Tag_FP_interface(0)
   22773                    
   22774                    ;******************************************************************************
   22775                    ;* TYPE INFORMATION                                                           *
   22776                    ;******************************************************************************
   22777                    
   22778                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
   22779                            .dwattr $C$DW$T$28, DW_AT_byte_size(0xdc)
   22780                    $C$DW$819       .dwtag  DW_TAG_member
   22781                            .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$23)
   22782                            .dwattr $C$DW$819, DW_AT_name("tmp")
   22783                            .dwattr $C$DW$819, DW_AT_TI_symbol_name("tmp")
   22784                            .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   22785                            .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
   22786                            .dwattr $C$DW$819, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22787                            .dwattr $C$DW$819, DW_AT_decl_line(0x18)
   22788                            .dwattr $C$DW$819, DW_AT_decl_column(0x1b)
   22789                    
   22790                    $C$DW$820       .dwtag  DW_TAG_member
   22791                            .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$25)
   22792                            .dwattr $C$DW$820, DW_AT_name("ofs")
   22793                            .dwattr $C$DW$820, DW_AT_TI_symbol_name("ofs")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  417

   22794                            .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   22795                            .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
   22796                            .dwattr $C$DW$820, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22797                            .dwattr $C$DW$820, DW_AT_decl_line(0x19)
   22798                            .dwattr $C$DW$820, DW_AT_decl_column(0x1b)
   22799                    
   22800                    $C$DW$821       .dwtag  DW_TAG_member
   22801                            .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$24)
   22802                            .dwattr $C$DW$821, DW_AT_name("fsA")
   22803                            .dwattr $C$DW$821, DW_AT_TI_symbol_name("fsA")
   22804                            .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   22805                            .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
   22806                            .dwattr $C$DW$821, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22807                            .dwattr $C$DW$821, DW_AT_decl_line(0x1a)
   22808                            .dwattr $C$DW$821, DW_AT_decl_column(0x1b)
   22809                    
   22810                    $C$DW$822       .dwtag  DW_TAG_member
   22811                            .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$24)
   22812                            .dwattr $C$DW$822, DW_AT_name("fsG")
   22813                            .dwattr $C$DW$822, DW_AT_TI_symbol_name("fsG")
   22814                            .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   22815                            .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
   22816                            .dwattr $C$DW$822, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22817                            .dwattr $C$DW$822, DW_AT_decl_line(0x1b)
   22818                            .dwattr $C$DW$822, DW_AT_decl_column(0x1b)
   22819                    
   22820                    $C$DW$823       .dwtag  DW_TAG_member
   22821                            .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$25)
   22822                            .dwattr $C$DW$823, DW_AT_name("raw")
   22823                            .dwattr $C$DW$823, DW_AT_TI_symbol_name("raw")
   22824                            .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   22825                            .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
   22826                            .dwattr $C$DW$823, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22827                            .dwattr $C$DW$823, DW_AT_decl_line(0x1c)
   22828                            .dwattr $C$DW$823, DW_AT_decl_column(0x1b)
   22829                    
   22830                    $C$DW$824       .dwtag  DW_TAG_member
   22831                            .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$25)
   22832                            .dwattr $C$DW$824, DW_AT_name("val")
   22833                            .dwattr $C$DW$824, DW_AT_TI_symbol_name("val")
   22834                            .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   22835                            .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
   22836                            .dwattr $C$DW$824, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22837                            .dwattr $C$DW$824, DW_AT_decl_line(0x1d)
   22838                            .dwattr $C$DW$824, DW_AT_decl_column(0x1b)
   22839                    
   22840                    $C$DW$825       .dwtag  DW_TAG_member
   22841                            .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$25)
   22842                            .dwattr $C$DW$825, DW_AT_name("phy")
   22843                            .dwattr $C$DW$825, DW_AT_TI_symbol_name("phy")
   22844                            .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   22845                            .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
   22846                            .dwattr $C$DW$825, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22847                            .dwattr $C$DW$825, DW_AT_decl_line(0x1e)
   22848                            .dwattr $C$DW$825, DW_AT_decl_column(0x1b)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  418

   22849                    
   22850                    $C$DW$826       .dwtag  DW_TAG_member
   22851                            .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$26)
   22852                            .dwattr $C$DW$826, DW_AT_name("avg")
   22853                            .dwattr $C$DW$826, DW_AT_TI_symbol_name("avg")
   22854                            .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
   22855                            .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
   22856                            .dwattr $C$DW$826, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22857                            .dwattr $C$DW$826, DW_AT_decl_line(0x1f)
   22858                            .dwattr $C$DW$826, DW_AT_decl_column(0x1b)
   22859                    
   22860                    $C$DW$827       .dwtag  DW_TAG_member
   22861                            .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$24)
   22862                            .dwattr $C$DW$827, DW_AT_name("tem")
   22863                            .dwattr $C$DW$827, DW_AT_TI_symbol_name("tem")
   22864                            .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
   22865                            .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
   22866                            .dwattr $C$DW$827, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22867                            .dwattr $C$DW$827, DW_AT_decl_line(0x20)
   22868                            .dwattr $C$DW$827, DW_AT_decl_column(0x1b)
   22869                    
   22870                    $C$DW$828       .dwtag  DW_TAG_member
   22871                            .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$27)
   22872                            .dwattr $C$DW$828, DW_AT_name("irq")
   22873                            .dwattr $C$DW$828, DW_AT_TI_symbol_name("irq")
   22874                            .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
   22875                            .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
   22876                            .dwattr $C$DW$828, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22877                            .dwattr $C$DW$828, DW_AT_decl_line(0x21)
   22878                            .dwattr $C$DW$828, DW_AT_decl_column(0x1b)
   22879                    
   22880                    $C$DW$829       .dwtag  DW_TAG_member
   22881                            .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$27)
   22882                            .dwattr $C$DW$829, DW_AT_name("cn0")
   22883                            .dwattr $C$DW$829, DW_AT_TI_symbol_name("cn0")
   22884                            .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
   22885                            .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
   22886                            .dwattr $C$DW$829, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22887                            .dwattr $C$DW$829, DW_AT_decl_line(0x22)
   22888                            .dwattr $C$DW$829, DW_AT_decl_column(0x1b)
   22889                    
   22890                    $C$DW$830       .dwtag  DW_TAG_member
   22891                            .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$27)
   22892                            .dwattr $C$DW$830, DW_AT_name("cn1")
   22893                            .dwattr $C$DW$830, DW_AT_TI_symbol_name("cn1")
   22894                            .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
   22895                            .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
   22896                            .dwattr $C$DW$830, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22897                            .dwattr $C$DW$830, DW_AT_decl_line(0x23)
   22898                            .dwattr $C$DW$830, DW_AT_decl_column(0x1b)
   22899                    
   22900                            .dwattr $C$DW$T$28, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22901                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x18)
   22902                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
   22903                            .dwendtag $C$DW$T$28
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  419

   22904                    
   22905                    $C$DW$T$139     .dwtag  DW_TAG_typedef
   22906                            .dwattr $C$DW$T$139, DW_AT_name("MPU_t")
   22907                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$28)
   22908                            .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
   22909                            .dwattr $C$DW$T$139, DW_AT_decl_file("../MPU9250/inv_mpu.h")
   22910                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x24)
   22911                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x12)
   22912                    
   22913                    
   22914                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
   22915                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
   22916                    $C$DW$831       .dwtag  DW_TAG_member
   22917                            .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$14)
   22918                            .dwattr $C$DW$831, DW_AT_name("__max_align1")
   22919                            .dwattr $C$DW$831, DW_AT_TI_symbol_name("__max_align1")
   22920                            .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   22921                            .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
   22922                            .dwattr $C$DW$831, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
   22923                            .dwattr $C$DW$831, DW_AT_decl_line(0x7b)
   22924                            .dwattr $C$DW$831, DW_AT_decl_column(0x0c)
   22925                    
   22926                    $C$DW$832       .dwtag  DW_TAG_member
   22927                            .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$18)
   22928                            .dwattr $C$DW$832, DW_AT_name("__max_align2")
   22929                            .dwattr $C$DW$832, DW_AT_TI_symbol_name("__max_align2")
   22930                            .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   22931                            .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
   22932                            .dwattr $C$DW$832, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
   22933                            .dwattr $C$DW$832, DW_AT_decl_line(0x7c)
   22934                            .dwattr $C$DW$832, DW_AT_decl_column(0x0e)
   22935                    
   22936                            .dwattr $C$DW$T$29, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-ar
   22937                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x7a)
   22938                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
   22939                            .dwendtag $C$DW$T$29
   22940                    
   22941                    $C$DW$T$140     .dwtag  DW_TAG_typedef
   22942                            .dwattr $C$DW$T$140, DW_AT_name("__max_align_t")
   22943                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$29)
   22944                            .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
   22945                            .dwattr $C$DW$T$140, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-a
   22946                            .dwattr $C$DW$T$140, DW_AT_decl_line(0x7d)
   22947                            .dwattr $C$DW$T$140, DW_AT_decl_column(0x03)
   22948                    
   22949                    
   22950                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
   22951                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
   22952                    $C$DW$833       .dwtag  DW_TAG_member
   22953                            .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$10)
   22954                            .dwattr $C$DW$833, DW_AT_name("quot")
   22955                            .dwattr $C$DW$833, DW_AT_TI_symbol_name("quot")
   22956                            .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   22957                            .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
   22958                            .dwattr $C$DW$833, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  420

   22959                            .dwattr $C$DW$833, DW_AT_decl_line(0x4e)
   22960                            .dwattr $C$DW$833, DW_AT_decl_column(0x16)
   22961                    
   22962                    $C$DW$834       .dwtag  DW_TAG_member
   22963                            .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$10)
   22964                            .dwattr $C$DW$834, DW_AT_name("rem")
   22965                            .dwattr $C$DW$834, DW_AT_TI_symbol_name("rem")
   22966                            .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   22967                            .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
   22968                            .dwattr $C$DW$834, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
   22969                            .dwattr $C$DW$834, DW_AT_decl_line(0x4e)
   22970                            .dwattr $C$DW$834, DW_AT_decl_column(0x1c)
   22971                    
   22972                            .dwattr $C$DW$T$30, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-ar
   22973                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x4e)
   22974                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
   22975                            .dwendtag $C$DW$T$30
   22976                    
   22977                    $C$DW$T$141     .dwtag  DW_TAG_typedef
   22978                            .dwattr $C$DW$T$141, DW_AT_name("div_t")
   22979                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$30)
   22980                            .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
   22981                            .dwattr $C$DW$T$141, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-a
   22982                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x4e)
   22983                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x23)
   22984                    
   22985                    
   22986                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
   22987                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
   22988                    $C$DW$835       .dwtag  DW_TAG_member
   22989                            .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$10)
   22990                            .dwattr $C$DW$835, DW_AT_name("quot")
   22991                            .dwattr $C$DW$835, DW_AT_TI_symbol_name("quot")
   22992                            .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   22993                            .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
   22994                            .dwattr $C$DW$835, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
   22995                            .dwattr $C$DW$835, DW_AT_decl_line(0x53)
   22996                            .dwattr $C$DW$835, DW_AT_decl_column(0x16)
   22997                    
   22998                    $C$DW$836       .dwtag  DW_TAG_member
   22999                            .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$10)
   23000                            .dwattr $C$DW$836, DW_AT_name("rem")
   23001                            .dwattr $C$DW$836, DW_AT_TI_symbol_name("rem")
   23002                            .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   23003                            .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
   23004                            .dwattr $C$DW$836, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
   23005                            .dwattr $C$DW$836, DW_AT_decl_line(0x53)
   23006                            .dwattr $C$DW$836, DW_AT_decl_column(0x1c)
   23007                    
   23008                            .dwattr $C$DW$T$31, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-ar
   23009                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x53)
   23010                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
   23011                            .dwendtag $C$DW$T$31
   23012                    
   23013                    $C$DW$T$142     .dwtag  DW_TAG_typedef
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  421

   23014                            .dwattr $C$DW$T$142, DW_AT_name("ldiv_t")
   23015                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$31)
   23016                            .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
   23017                            .dwattr $C$DW$T$142, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-a
   23018                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x53)
   23019                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x23)
   23020                    
   23021                    
   23022                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
   23023                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
   23024                    $C$DW$837       .dwtag  DW_TAG_member
   23025                            .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$14)
   23026                            .dwattr $C$DW$837, DW_AT_name("quot")
   23027                            .dwattr $C$DW$837, DW_AT_TI_symbol_name("quot")
   23028                            .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   23029                            .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
   23030                            .dwattr $C$DW$837, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
   23031                            .dwattr $C$DW$837, DW_AT_decl_line(0x5b)
   23032                            .dwattr $C$DW$837, DW_AT_decl_column(0x1c)
   23033                    
   23034                    $C$DW$838       .dwtag  DW_TAG_member
   23035                            .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$14)
   23036                            .dwattr $C$DW$838, DW_AT_name("rem")
   23037                            .dwattr $C$DW$838, DW_AT_TI_symbol_name("rem")
   23038                            .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   23039                            .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
   23040                            .dwattr $C$DW$838, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
   23041                            .dwattr $C$DW$838, DW_AT_decl_line(0x5b)
   23042                            .dwattr $C$DW$838, DW_AT_decl_column(0x22)
   23043                    
   23044                            .dwattr $C$DW$T$32, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-ar
   23045                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x5b)
   23046                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
   23047                            .dwendtag $C$DW$T$32
   23048                    
   23049                    $C$DW$T$143     .dwtag  DW_TAG_typedef
   23050                            .dwattr $C$DW$T$143, DW_AT_name("lldiv_t")
   23051                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$32)
   23052                            .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
   23053                            .dwattr $C$DW$T$143, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-a
   23054                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x5b)
   23055                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x29)
   23056                    
   23057                    
   23058                    $C$DW$T$77      .dwtag  DW_TAG_structure_type
   23059                            .dwattr $C$DW$T$77, DW_AT_byte_size(0x4c)
   23060                    $C$DW$839       .dwtag  DW_TAG_member
   23061                            .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$40)
   23062                            .dwattr $C$DW$839, DW_AT_name("Crc32")
   23063                            .dwattr $C$DW$839, DW_AT_TI_symbol_name("Crc32")
   23064                            .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   23065                            .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
   23066                            .dwattr $C$DW$839, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23067                            .dwattr $C$DW$839, DW_AT_decl_line(0x76)
   23068                            .dwattr $C$DW$839, DW_AT_decl_column(0x25)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  422

   23069                    
   23070                    $C$DW$840       .dwtag  DW_TAG_member
   23071                            .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$43)
   23072                            .dwattr $C$DW$840, DW_AT_name("FlashGetSize")
   23073                            .dwattr $C$DW$840, DW_AT_TI_symbol_name("FlashGetSize")
   23074                            .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   23075                            .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
   23076                            .dwattr $C$DW$840, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23077                            .dwattr $C$DW$840, DW_AT_decl_line(0x77)
   23078                            .dwattr $C$DW$840, DW_AT_decl_column(0x25)
   23079                    
   23080                    $C$DW$841       .dwtag  DW_TAG_member
   23081                            .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$44)
   23082                            .dwattr $C$DW$841, DW_AT_name("GetChipId")
   23083                            .dwattr $C$DW$841, DW_AT_TI_symbol_name("GetChipId")
   23084                            .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   23085                            .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
   23086                            .dwattr $C$DW$841, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23087                            .dwattr $C$DW$841, DW_AT_decl_line(0x78)
   23088                            .dwattr $C$DW$841, DW_AT_decl_column(0x25)
   23089                    
   23090                    $C$DW$842       .dwtag  DW_TAG_member
   23091                            .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$47)
   23092                            .dwattr $C$DW$842, DW_AT_name("ReservedLocation1")
   23093                            .dwattr $C$DW$842, DW_AT_TI_symbol_name("ReservedLocation1")
   23094                            .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   23095                            .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
   23096                            .dwattr $C$DW$842, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23097                            .dwattr $C$DW$842, DW_AT_decl_line(0x79)
   23098                            .dwattr $C$DW$842, DW_AT_decl_column(0x25)
   23099                    
   23100                    $C$DW$843       .dwtag  DW_TAG_member
   23101                            .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$48)
   23102                            .dwattr $C$DW$843, DW_AT_name("ReservedLocation2")
   23103                            .dwattr $C$DW$843, DW_AT_TI_symbol_name("ReservedLocation2")
   23104                            .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   23105                            .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
   23106                            .dwattr $C$DW$843, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23107                            .dwattr $C$DW$843, DW_AT_decl_line(0x7a)
   23108                            .dwattr $C$DW$843, DW_AT_decl_column(0x25)
   23109                    
   23110                    $C$DW$844       .dwtag  DW_TAG_member
   23111                            .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$49)
   23112                            .dwattr $C$DW$844, DW_AT_name("ReservedLocation3")
   23113                            .dwattr $C$DW$844, DW_AT_TI_symbol_name("ReservedLocation3")
   23114                            .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   23115                            .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
   23116                            .dwattr $C$DW$844, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23117                            .dwattr $C$DW$844, DW_AT_decl_line(0x7b)
   23118                            .dwattr $C$DW$844, DW_AT_decl_column(0x25)
   23119                    
   23120                    $C$DW$845       .dwtag  DW_TAG_member
   23121                            .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$52)
   23122                            .dwattr $C$DW$845, DW_AT_name("ResetDevice")
   23123                            .dwattr $C$DW$845, DW_AT_TI_symbol_name("ResetDevice")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  423

   23124                            .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   23125                            .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
   23126                            .dwattr $C$DW$845, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23127                            .dwattr $C$DW$845, DW_AT_decl_line(0x7c)
   23128                            .dwattr $C$DW$845, DW_AT_decl_column(0x25)
   23129                    
   23130                    $C$DW$846       .dwtag  DW_TAG_member
   23131                            .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$58)
   23132                            .dwattr $C$DW$846, DW_AT_name("Fletcher32")
   23133                            .dwattr $C$DW$846, DW_AT_TI_symbol_name("Fletcher32")
   23134                            .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   23135                            .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
   23136                            .dwattr $C$DW$846, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23137                            .dwattr $C$DW$846, DW_AT_decl_line(0x7d)
   23138                            .dwattr $C$DW$846, DW_AT_decl_column(0x25)
   23139                    
   23140                    $C$DW$847       .dwtag  DW_TAG_member
   23141                            .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$62)
   23142                            .dwattr $C$DW$847, DW_AT_name("MinValue")
   23143                            .dwattr $C$DW$847, DW_AT_TI_symbol_name("MinValue")
   23144                            .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   23145                            .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
   23146                            .dwattr $C$DW$847, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23147                            .dwattr $C$DW$847, DW_AT_decl_line(0x7e)
   23148                            .dwattr $C$DW$847, DW_AT_decl_column(0x25)
   23149                    
   23150                    $C$DW$848       .dwtag  DW_TAG_member
   23151                            .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$63)
   23152                            .dwattr $C$DW$848, DW_AT_name("MaxValue")
   23153                            .dwattr $C$DW$848, DW_AT_TI_symbol_name("MaxValue")
   23154                            .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   23155                            .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
   23156                            .dwattr $C$DW$848, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23157                            .dwattr $C$DW$848, DW_AT_decl_line(0x7f)
   23158                            .dwattr $C$DW$848, DW_AT_decl_column(0x25)
   23159                    
   23160                    $C$DW$849       .dwtag  DW_TAG_member
   23161                            .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$64)
   23162                            .dwattr $C$DW$849, DW_AT_name("MeanValue")
   23163                            .dwattr $C$DW$849, DW_AT_TI_symbol_name("MeanValue")
   23164                            .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   23165                            .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
   23166                            .dwattr $C$DW$849, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23167                            .dwattr $C$DW$849, DW_AT_decl_line(0x80)
   23168                            .dwattr $C$DW$849, DW_AT_decl_column(0x25)
   23169                    
   23170                    $C$DW$850       .dwtag  DW_TAG_member
   23171                            .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$65)
   23172                            .dwattr $C$DW$850, DW_AT_name("StandDeviationValue")
   23173                            .dwattr $C$DW$850, DW_AT_TI_symbol_name("StandDeviationValue")
   23174                            .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   23175                            .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
   23176                            .dwattr $C$DW$850, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23177                            .dwattr $C$DW$850, DW_AT_decl_line(0x81)
   23178                            .dwattr $C$DW$850, DW_AT_decl_column(0x25)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  424

   23179                    
   23180                    $C$DW$851       .dwtag  DW_TAG_member
   23181                            .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$68)
   23182                            .dwattr $C$DW$851, DW_AT_name("ReservedLocation4")
   23183                            .dwattr $C$DW$851, DW_AT_TI_symbol_name("ReservedLocation4")
   23184                            .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   23185                            .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
   23186                            .dwattr $C$DW$851, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23187                            .dwattr $C$DW$851, DW_AT_decl_line(0x82)
   23188                            .dwattr $C$DW$851, DW_AT_decl_column(0x25)
   23189                    
   23190                    $C$DW$852       .dwtag  DW_TAG_member
   23191                            .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$69)
   23192                            .dwattr $C$DW$852, DW_AT_name("ReservedLocation5")
   23193                            .dwattr $C$DW$852, DW_AT_TI_symbol_name("ReservedLocation5")
   23194                            .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   23195                            .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
   23196                            .dwattr $C$DW$852, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23197                            .dwattr $C$DW$852, DW_AT_decl_line(0x83)
   23198                            .dwattr $C$DW$852, DW_AT_decl_column(0x25)
   23199                    
   23200                    $C$DW$853       .dwtag  DW_TAG_member
   23201                            .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$70)
   23202                            .dwattr $C$DW$853, DW_AT_name("HFSourceSafeSwitch")
   23203                            .dwattr $C$DW$853, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
   23204                            .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   23205                            .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
   23206                            .dwattr $C$DW$853, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23207                            .dwattr $C$DW$853, DW_AT_decl_line(0x84)
   23208                            .dwattr $C$DW$853, DW_AT_decl_column(0x25)
   23209                    
   23210                    $C$DW$854       .dwtag  DW_TAG_member
   23211                            .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$73)
   23212                            .dwattr $C$DW$854, DW_AT_name("SelectCompAInput")
   23213                            .dwattr $C$DW$854, DW_AT_TI_symbol_name("SelectCompAInput")
   23214                            .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   23215                            .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
   23216                            .dwattr $C$DW$854, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23217                            .dwattr $C$DW$854, DW_AT_decl_line(0x85)
   23218                            .dwattr $C$DW$854, DW_AT_decl_column(0x25)
   23219                    
   23220                    $C$DW$855       .dwtag  DW_TAG_member
   23221                            .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$74)
   23222                            .dwattr $C$DW$855, DW_AT_name("SelectCompARef")
   23223                            .dwattr $C$DW$855, DW_AT_TI_symbol_name("SelectCompARef")
   23224                            .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   23225                            .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
   23226                            .dwattr $C$DW$855, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23227                            .dwattr $C$DW$855, DW_AT_decl_line(0x86)
   23228                            .dwattr $C$DW$855, DW_AT_decl_column(0x25)
   23229                    
   23230                    $C$DW$856       .dwtag  DW_TAG_member
   23231                            .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$75)
   23232                            .dwattr $C$DW$856, DW_AT_name("SelectADCCompBInput")
   23233                            .dwattr $C$DW$856, DW_AT_TI_symbol_name("SelectADCCompBInput")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  425

   23234                            .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   23235                            .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
   23236                            .dwattr $C$DW$856, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23237                            .dwattr $C$DW$856, DW_AT_decl_line(0x87)
   23238                            .dwattr $C$DW$856, DW_AT_decl_column(0x25)
   23239                    
   23240                    $C$DW$857       .dwtag  DW_TAG_member
   23241                            .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$76)
   23242                            .dwattr $C$DW$857, DW_AT_name("SelectCompBRef")
   23243                            .dwattr $C$DW$857, DW_AT_TI_symbol_name("SelectCompBRef")
   23244                            .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   23245                            .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
   23246                            .dwattr $C$DW$857, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   23247                            .dwattr $C$DW$857, DW_AT_decl_line(0x88)
   23248                            .dwattr $C$DW$857, DW_AT_decl_column(0x25)
   23249                    
   23250                            .dwattr $C$DW$T$77, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dev
   23251                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x75)
   23252                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x01)
   23253                            .dwendtag $C$DW$T$77
   23254                    
   23255                    $C$DW$T$144     .dwtag  DW_TAG_typedef
   23256                            .dwattr $C$DW$T$144, DW_AT_name("HARD_API_T")
   23257                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$77)
   23258                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
   23259                            .dwattr $C$DW$T$144, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
   23260                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x89)
   23261                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x03)
   23262                    
   23263                    
   23264                    $C$DW$T$79      .dwtag  DW_TAG_structure_type
   23265                            .dwattr $C$DW$T$79, DW_AT_byte_size(0x3c)
   23266                    $C$DW$858       .dwtag  DW_TAG_member
   23267                            .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$78)
   23268                            .dwattr $C$DW$858, DW_AT_name("ref")
   23269                            .dwattr $C$DW$858, DW_AT_TI_symbol_name("ref")
   23270                            .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   23271                            .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
   23272                            .dwattr $C$DW$858, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23273                            .dwattr $C$DW$858, DW_AT_decl_line(0x03)
   23274                            .dwattr $C$DW$858, DW_AT_decl_column(0x18)
   23275                    
   23276                    $C$DW$859       .dwtag  DW_TAG_member
   23277                            .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$78)
   23278                            .dwattr $C$DW$859, DW_AT_name("fdb")
   23279                            .dwattr $C$DW$859, DW_AT_TI_symbol_name("fdb")
   23280                            .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   23281                            .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
   23282                            .dwattr $C$DW$859, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23283                            .dwattr $C$DW$859, DW_AT_decl_line(0x04)
   23284                            .dwattr $C$DW$859, DW_AT_decl_column(0x18)
   23285                    
   23286                    $C$DW$860       .dwtag  DW_TAG_member
   23287                            .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$24)
   23288                            .dwattr $C$DW$860, DW_AT_name("Kp")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  426

   23289                            .dwattr $C$DW$860, DW_AT_TI_symbol_name("Kp")
   23290                            .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   23291                            .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
   23292                            .dwattr $C$DW$860, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23293                            .dwattr $C$DW$860, DW_AT_decl_line(0x05)
   23294                            .dwattr $C$DW$860, DW_AT_decl_column(0x18)
   23295                    
   23296                    $C$DW$861       .dwtag  DW_TAG_member
   23297                            .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$24)
   23298                            .dwattr $C$DW$861, DW_AT_name("Ki")
   23299                            .dwattr $C$DW$861, DW_AT_TI_symbol_name("Ki")
   23300                            .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   23301                            .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
   23302                            .dwattr $C$DW$861, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23303                            .dwattr $C$DW$861, DW_AT_decl_line(0x06)
   23304                            .dwattr $C$DW$861, DW_AT_decl_column(0x18)
   23305                    
   23306                    $C$DW$862       .dwtag  DW_TAG_member
   23307                            .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$24)
   23308                            .dwattr $C$DW$862, DW_AT_name("Kd")
   23309                            .dwattr $C$DW$862, DW_AT_TI_symbol_name("Kd")
   23310                            .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   23311                            .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
   23312                            .dwattr $C$DW$862, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23313                            .dwattr $C$DW$862, DW_AT_decl_line(0x07)
   23314                            .dwattr $C$DW$862, DW_AT_decl_column(0x18)
   23315                    
   23316                    $C$DW$863       .dwtag  DW_TAG_member
   23317                            .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$24)
   23318                            .dwattr $C$DW$863, DW_AT_name("Kc")
   23319                            .dwattr $C$DW$863, DW_AT_TI_symbol_name("Kc")
   23320                            .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   23321                            .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
   23322                            .dwattr $C$DW$863, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23323                            .dwattr $C$DW$863, DW_AT_decl_line(0x08)
   23324                            .dwattr $C$DW$863, DW_AT_decl_column(0x18)
   23325                    
   23326                    $C$DW$864       .dwtag  DW_TAG_member
   23327                            .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$24)
   23328                            .dwattr $C$DW$864, DW_AT_name("Gp")
   23329                            .dwattr $C$DW$864, DW_AT_TI_symbol_name("Gp")
   23330                            .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   23331                            .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
   23332                            .dwattr $C$DW$864, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23333                            .dwattr $C$DW$864, DW_AT_decl_line(0x09)
   23334                            .dwattr $C$DW$864, DW_AT_decl_column(0x18)
   23335                    
   23336                    $C$DW$865       .dwtag  DW_TAG_member
   23337                            .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$24)
   23338                            .dwattr $C$DW$865, DW_AT_name("Gi")
   23339                            .dwattr $C$DW$865, DW_AT_TI_symbol_name("Gi")
   23340                            .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   23341                            .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
   23342                            .dwattr $C$DW$865, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23343                            .dwattr $C$DW$865, DW_AT_decl_line(0x0a)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  427

   23344                            .dwattr $C$DW$865, DW_AT_decl_column(0x18)
   23345                    
   23346                    $C$DW$866       .dwtag  DW_TAG_member
   23347                            .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$24)
   23348                            .dwattr $C$DW$866, DW_AT_name("yn")
   23349                            .dwattr $C$DW$866, DW_AT_TI_symbol_name("yn")
   23350                            .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   23351                            .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
   23352                            .dwattr $C$DW$866, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23353                            .dwattr $C$DW$866, DW_AT_decl_line(0x0b)
   23354                            .dwattr $C$DW$866, DW_AT_decl_column(0x18)
   23355                    
   23356                    $C$DW$867       .dwtag  DW_TAG_member
   23357                            .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$24)
   23358                            .dwattr $C$DW$867, DW_AT_name("yp")
   23359                            .dwattr $C$DW$867, DW_AT_TI_symbol_name("yp")
   23360                            .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   23361                            .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
   23362                            .dwattr $C$DW$867, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23363                            .dwattr $C$DW$867, DW_AT_decl_line(0x0c)
   23364                            .dwattr $C$DW$867, DW_AT_decl_column(0x18)
   23365                    
   23366                    $C$DW$868       .dwtag  DW_TAG_member
   23367                            .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$24)
   23368                            .dwattr $C$DW$868, DW_AT_name("ep")
   23369                            .dwattr $C$DW$868, DW_AT_TI_symbol_name("ep")
   23370                            .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   23371                            .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
   23372                            .dwattr $C$DW$868, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23373                            .dwattr $C$DW$868, DW_AT_decl_line(0x0d)
   23374                            .dwattr $C$DW$868, DW_AT_decl_column(0x18)
   23375                    
   23376                    $C$DW$869       .dwtag  DW_TAG_member
   23377                            .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$24)
   23378                            .dwattr $C$DW$869, DW_AT_name("es")
   23379                            .dwattr $C$DW$869, DW_AT_TI_symbol_name("es")
   23380                            .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   23381                            .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
   23382                            .dwattr $C$DW$869, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23383                            .dwattr $C$DW$869, DW_AT_decl_line(0x0e)
   23384                            .dwattr $C$DW$869, DW_AT_decl_column(0x18)
   23385                    
   23386                    $C$DW$870       .dwtag  DW_TAG_member
   23387                            .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$24)
   23388                            .dwattr $C$DW$870, DW_AT_name("ei")
   23389                            .dwattr $C$DW$870, DW_AT_TI_symbol_name("ei")
   23390                            .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   23391                            .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
   23392                            .dwattr $C$DW$870, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23393                            .dwattr $C$DW$870, DW_AT_decl_line(0x0f)
   23394                            .dwattr $C$DW$870, DW_AT_decl_column(0x18)
   23395                    
   23396                    $C$DW$871       .dwtag  DW_TAG_member
   23397                            .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$24)
   23398                            .dwattr $C$DW$871, DW_AT_name("ed")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  428

   23399                            .dwattr $C$DW$871, DW_AT_TI_symbol_name("ed")
   23400                            .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   23401                            .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
   23402                            .dwattr $C$DW$871, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23403                            .dwattr $C$DW$871, DW_AT_decl_line(0x10)
   23404                            .dwattr $C$DW$871, DW_AT_decl_column(0x18)
   23405                    
   23406                    $C$DW$872       .dwtag  DW_TAG_member
   23407                            .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$24)
   23408                            .dwattr $C$DW$872, DW_AT_name("y")
   23409                            .dwattr $C$DW$872, DW_AT_TI_symbol_name("y")
   23410                            .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   23411                            .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
   23412                            .dwattr $C$DW$872, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23413                            .dwattr $C$DW$872, DW_AT_decl_line(0x11)
   23414                            .dwattr $C$DW$872, DW_AT_decl_column(0x18)
   23415                    
   23416                            .dwattr $C$DW$T$79, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23417                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x03)
   23418                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x11)
   23419                            .dwendtag $C$DW$T$79
   23420                    
   23421                    $C$DW$T$145     .dwtag  DW_TAG_typedef
   23422                            .dwattr $C$DW$T$145, DW_AT_name("PID_t")
   23423                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$79)
   23424                            .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
   23425                            .dwattr $C$DW$T$145, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/App/flight.h")
   23426                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x11)
   23427                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x1d)
   23428                    
   23429                    
   23430                    $C$DW$T$87      .dwtag  DW_TAG_structure_type
   23431                            .dwattr $C$DW$T$87, DW_AT_name("GPTimerCC26XX_Config")
   23432                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x0c)
   23433                    $C$DW$873       .dwtag  DW_TAG_member
   23434                            .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$81)
   23435                            .dwattr $C$DW$873, DW_AT_name("object")
   23436                            .dwattr $C$DW$873, DW_AT_TI_symbol_name("object")
   23437                            .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   23438                            .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
   23439                            .dwattr $C$DW$873, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23440                            .dwattr $C$DW$873, DW_AT_decl_line(0x198)
   23441                            .dwattr $C$DW$873, DW_AT_decl_column(0x22)
   23442                    
   23443                    $C$DW$874       .dwtag  DW_TAG_member
   23444                            .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$84)
   23445                            .dwattr $C$DW$874, DW_AT_name("hwAttrs")
   23446                            .dwattr $C$DW$874, DW_AT_TI_symbol_name("hwAttrs")
   23447                            .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   23448                            .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
   23449                            .dwattr $C$DW$874, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23450                            .dwattr $C$DW$874, DW_AT_decl_line(0x199)
   23451                            .dwattr $C$DW$874, DW_AT_decl_column(0x22)
   23452                    
   23453                    $C$DW$875       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  429

   23454                            .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$86)
   23455                            .dwattr $C$DW$875, DW_AT_name("timerPart")
   23456                            .dwattr $C$DW$875, DW_AT_TI_symbol_name("timerPart")
   23457                            .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   23458                            .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
   23459                            .dwattr $C$DW$875, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23460                            .dwattr $C$DW$875, DW_AT_decl_line(0x19a)
   23461                            .dwattr $C$DW$875, DW_AT_decl_column(0x21)
   23462                    
   23463                            .dwattr $C$DW$T$87, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
   23464                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x196)
   23465                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x08)
   23466                            .dwendtag $C$DW$T$87
   23467                    
   23468                    $C$DW$T$97      .dwtag  DW_TAG_typedef
   23469                            .dwattr $C$DW$T$97, DW_AT_name("GPTimerCC26XX_Config")
   23470                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$87)
   23471                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   23472                            .dwattr $C$DW$T$97, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
   23473                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x130)
   23474                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x27)
   23475                    
   23476                    $C$DW$T$98      .dwtag  DW_TAG_pointer_type
   23477                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
   23478                            .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
   23479                    
   23480                    $C$DW$T$99      .dwtag  DW_TAG_typedef
   23481                            .dwattr $C$DW$T$99, DW_AT_name("GPTimerCC26XX_Handle")
   23482                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   23483                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   23484                            .dwattr $C$DW$T$99, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
   23485                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x133)
   23486                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x2d)
   23487                    
   23488                    
   23489                    $C$DW$T$114     .dwtag  DW_TAG_enumeration_type
   23490                            .dwattr $C$DW$T$114, DW_AT_name("GPTimerCC26XX_DebugMode")
   23491                            .dwattr $C$DW$T$114, DW_AT_byte_size(0x01)
   23492                    $C$DW$876       .dwtag  DW_TAG_enumerator
   23493                            .dwattr $C$DW$876, DW_AT_name("GPTimerCC26XX_DEBUG_STALL_OFF")
   23494                            .dwattr $C$DW$876, DW_AT_const_value(0x00)
   23495                            .dwattr $C$DW$876, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23496                            .dwattr $C$DW$876, DW_AT_decl_line(0x104)
   23497                            .dwattr $C$DW$876, DW_AT_decl_column(0x05)
   23498                    
   23499                    $C$DW$877       .dwtag  DW_TAG_enumerator
   23500                            .dwattr $C$DW$877, DW_AT_name("GPTimerCC26XX_DEBUG_STALL_ON")
   23501                            .dwattr $C$DW$877, DW_AT_const_value(0x01)
   23502                            .dwattr $C$DW$877, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23503                            .dwattr $C$DW$877, DW_AT_decl_line(0x105)
   23504                            .dwattr $C$DW$877, DW_AT_decl_column(0x05)
   23505                    
   23506                            .dwattr $C$DW$T$114, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23507                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x102)
   23508                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x0e)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  430

   23509                            .dwendtag $C$DW$T$114
   23510                    
   23511                    $C$DW$T$115     .dwtag  DW_TAG_typedef
   23512                            .dwattr $C$DW$T$115, DW_AT_name("GPTimerCC26XX_DebugMode")
   23513                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
   23514                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
   23515                            .dwattr $C$DW$T$115, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23516                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x106)
   23517                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x03)
   23518                    
   23519                    
   23520                    $C$DW$T$112     .dwtag  DW_TAG_enumeration_type
   23521                            .dwattr $C$DW$T$112, DW_AT_name("GPTimerCC26XX_Direction")
   23522                            .dwattr $C$DW$T$112, DW_AT_byte_size(0x01)
   23523                    $C$DW$878       .dwtag  DW_TAG_enumerator
   23524                            .dwattr $C$DW$878, DW_AT_name("GPTimerCC26XX_DIRECTION_DOWN")
   23525                            .dwattr $C$DW$878, DW_AT_const_value(0x00)
   23526                            .dwattr $C$DW$878, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23527                            .dwattr $C$DW$878, DW_AT_decl_line(0x10f)
   23528                            .dwattr $C$DW$878, DW_AT_decl_column(0x05)
   23529                    
   23530                    $C$DW$879       .dwtag  DW_TAG_enumerator
   23531                            .dwattr $C$DW$879, DW_AT_name("GPTimerCC26XX_DIRECTION_UP")
   23532                            .dwattr $C$DW$879, DW_AT_const_value(0x01)
   23533                            .dwattr $C$DW$879, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23534                            .dwattr $C$DW$879, DW_AT_decl_line(0x110)
   23535                            .dwattr $C$DW$879, DW_AT_decl_column(0x05)
   23536                    
   23537                            .dwattr $C$DW$T$112, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23538                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x10d)
   23539                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x0e)
   23540                            .dwendtag $C$DW$T$112
   23541                    
   23542                    $C$DW$T$113     .dwtag  DW_TAG_typedef
   23543                            .dwattr $C$DW$T$113, DW_AT_name("GPTimerCC26XX_Direction")
   23544                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
   23545                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
   23546                            .dwattr $C$DW$T$113, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23547                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x111)
   23548                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x03)
   23549                    
   23550                    
   23551                    $C$DW$T$146     .dwtag  DW_TAG_enumeration_type
   23552                            .dwattr $C$DW$T$146, DW_AT_name("GPTimerCC26XX_Edge")
   23553                            .dwattr $C$DW$T$146, DW_AT_byte_size(0x01)
   23554                    $C$DW$880       .dwtag  DW_TAG_enumerator
   23555                            .dwattr $C$DW$880, DW_AT_name("GPTimerCC26XX_POS_EDGE")
   23556                            .dwattr $C$DW$880, DW_AT_const_value(0x00)
   23557                            .dwattr $C$DW$880, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23558                            .dwattr $C$DW$880, DW_AT_decl_line(0x129)
   23559                            .dwattr $C$DW$880, DW_AT_decl_column(0x05)
   23560                    
   23561                    $C$DW$881       .dwtag  DW_TAG_enumerator
   23562                            .dwattr $C$DW$881, DW_AT_name("GPTimerCC26XX_NEG_EDGE")
   23563                            .dwattr $C$DW$881, DW_AT_const_value(0x04)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  431

   23564                            .dwattr $C$DW$881, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23565                            .dwattr $C$DW$881, DW_AT_decl_line(0x12a)
   23566                            .dwattr $C$DW$881, DW_AT_decl_column(0x05)
   23567                    
   23568                    $C$DW$882       .dwtag  DW_TAG_enumerator
   23569                            .dwattr $C$DW$882, DW_AT_name("GPTimerCC26XX_BOTH_EDGES")
   23570                            .dwattr $C$DW$882, DW_AT_const_value(0x0c)
   23571                            .dwattr $C$DW$882, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23572                            .dwattr $C$DW$882, DW_AT_decl_line(0x12b)
   23573                            .dwattr $C$DW$882, DW_AT_decl_column(0x05)
   23574                    
   23575                            .dwattr $C$DW$T$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23576                            .dwattr $C$DW$T$146, DW_AT_decl_line(0x127)
   23577                            .dwattr $C$DW$T$146, DW_AT_decl_column(0x0e)
   23578                            .dwendtag $C$DW$T$146
   23579                    
   23580                    $C$DW$T$147     .dwtag  DW_TAG_typedef
   23581                            .dwattr $C$DW$T$147, DW_AT_name("GPTimerCC26XX_Edge")
   23582                            .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
   23583                            .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
   23584                            .dwattr $C$DW$T$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23585                            .dwattr $C$DW$T$147, DW_AT_decl_line(0x12c)
   23586                            .dwattr $C$DW$T$147, DW_AT_decl_column(0x03)
   23587                    
   23588                    
   23589                    $C$DW$T$90      .dwtag  DW_TAG_structure_type
   23590                            .dwattr $C$DW$T$90, DW_AT_name("GPTimerCC26XX_HWAttrs")
   23591                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x0c)
   23592                    $C$DW$883       .dwtag  DW_TAG_member
   23593                            .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$34)
   23594                            .dwattr $C$DW$883, DW_AT_name("baseAddr")
   23595                            .dwattr $C$DW$883, DW_AT_TI_symbol_name("baseAddr")
   23596                            .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   23597                            .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
   23598                            .dwattr $C$DW$883, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23599                            .dwattr $C$DW$883, DW_AT_decl_line(0x155)
   23600                            .dwattr $C$DW$883, DW_AT_decl_column(0x0e)
   23601                    
   23602                    $C$DW$884       .dwtag  DW_TAG_member
   23603                            .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$36)
   23604                            .dwattr $C$DW$884, DW_AT_name("intNum")
   23605                            .dwattr $C$DW$884, DW_AT_TI_symbol_name("intNum")
   23606                            .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   23607                            .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
   23608                            .dwattr $C$DW$884, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23609                            .dwattr $C$DW$884, DW_AT_decl_line(0x157)
   23610                            .dwattr $C$DW$884, DW_AT_decl_column(0x0e)
   23611                    
   23612                    $C$DW$885       .dwtag  DW_TAG_member
   23613                            .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$36)
   23614                            .dwattr $C$DW$885, DW_AT_name("intPriority")
   23615                            .dwattr $C$DW$885, DW_AT_TI_symbol_name("intPriority")
   23616                            .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   23617                            .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
   23618                            .dwattr $C$DW$885, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  432

   23619                            .dwattr $C$DW$885, DW_AT_decl_line(0x161)
   23620                            .dwattr $C$DW$885, DW_AT_decl_column(0x1a)
   23621                    
   23622                    $C$DW$886       .dwtag  DW_TAG_member
   23623                            .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$36)
   23624                            .dwattr $C$DW$886, DW_AT_name("powerMngrId")
   23625                            .dwattr $C$DW$886, DW_AT_TI_symbol_name("powerMngrId")
   23626                            .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   23627                            .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
   23628                            .dwattr $C$DW$886, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23629                            .dwattr $C$DW$886, DW_AT_decl_line(0x163)
   23630                            .dwattr $C$DW$886, DW_AT_decl_column(0x1a)
   23631                    
   23632                    $C$DW$887       .dwtag  DW_TAG_member
   23633                            .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$86)
   23634                            .dwattr $C$DW$887, DW_AT_name("timer")
   23635                            .dwattr $C$DW$887, DW_AT_TI_symbol_name("timer")
   23636                            .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   23637                            .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
   23638                            .dwattr $C$DW$887, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23639                            .dwattr $C$DW$887, DW_AT_decl_line(0x165)
   23640                            .dwattr $C$DW$887, DW_AT_decl_column(0x1a)
   23641                    
   23642                    $C$DW$888       .dwtag  DW_TAG_member
   23643                            .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$89)
   23644                            .dwattr $C$DW$888, DW_AT_name("pinMux")
   23645                            .dwattr $C$DW$888, DW_AT_TI_symbol_name("pinMux")
   23646                            .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   23647                            .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
   23648                            .dwattr $C$DW$888, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23649                            .dwattr $C$DW$888, DW_AT_decl_line(0x167)
   23650                            .dwattr $C$DW$888, DW_AT_decl_column(0x1a)
   23651                    
   23652                            .dwattr $C$DW$T$90, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
   23653                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x152)
   23654                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x10)
   23655                            .dwendtag $C$DW$T$90
   23656                    
   23657                    $C$DW$T$82      .dwtag  DW_TAG_typedef
   23658                            .dwattr $C$DW$T$82, DW_AT_name("GPTimerCC26XX_HWAttrs")
   23659                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$90)
   23660                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   23661                            .dwattr $C$DW$T$82, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
   23662                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x168)
   23663                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
   23664                    
   23665                    $C$DW$T$83      .dwtag  DW_TAG_const_type
   23666                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
   23667                    
   23668                    $C$DW$T$84      .dwtag  DW_TAG_pointer_type
   23669                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   23670                            .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
   23671                    
   23672                    
   23673                    $C$DW$T$148     .dwtag  DW_TAG_enumeration_type
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  433

   23674                            .dwattr $C$DW$T$148, DW_AT_name("GPTimerCC26XX_Interrupt")
   23675                            .dwattr $C$DW$T$148, DW_AT_byte_size(0x01)
   23676                    $C$DW$889       .dwtag  DW_TAG_enumerator
   23677                            .dwattr $C$DW$889, DW_AT_name("GPT_INT_TIMEOUT")
   23678                            .dwattr $C$DW$889, DW_AT_const_value(0x01)
   23679                            .dwattr $C$DW$889, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23680                            .dwattr $C$DW$889, DW_AT_decl_line(0xd3)
   23681                            .dwattr $C$DW$889, DW_AT_decl_column(0x05)
   23682                    
   23683                    $C$DW$890       .dwtag  DW_TAG_enumerator
   23684                            .dwattr $C$DW$890, DW_AT_name("GPT_INT_CAPTURE_MATCH")
   23685                            .dwattr $C$DW$890, DW_AT_const_value(0x02)
   23686                            .dwattr $C$DW$890, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23687                            .dwattr $C$DW$890, DW_AT_decl_line(0xd4)
   23688                            .dwattr $C$DW$890, DW_AT_decl_column(0x09)
   23689                    
   23690                    $C$DW$891       .dwtag  DW_TAG_enumerator
   23691                            .dwattr $C$DW$891, DW_AT_name("GPT_INT_CAPTURE")
   23692                            .dwattr $C$DW$891, DW_AT_const_value(0x04)
   23693                            .dwattr $C$DW$891, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23694                            .dwattr $C$DW$891, DW_AT_decl_line(0xd5)
   23695                            .dwattr $C$DW$891, DW_AT_decl_column(0x09)
   23696                    
   23697                    $C$DW$892       .dwtag  DW_TAG_enumerator
   23698                            .dwattr $C$DW$892, DW_AT_name("GPT_INT_MATCH")
   23699                            .dwattr $C$DW$892, DW_AT_const_value(0x08)
   23700                            .dwattr $C$DW$892, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23701                            .dwattr $C$DW$892, DW_AT_decl_line(0xd6)
   23702                            .dwattr $C$DW$892, DW_AT_decl_column(0x09)
   23703                    
   23704                            .dwattr $C$DW$T$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23705                            .dwattr $C$DW$T$148, DW_AT_decl_line(0xd1)
   23706                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x0e)
   23707                            .dwendtag $C$DW$T$148
   23708                    
   23709                    $C$DW$T$149     .dwtag  DW_TAG_typedef
   23710                            .dwattr $C$DW$T$149, DW_AT_name("GPTimerCC26XX_Interrupt")
   23711                            .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
   23712                            .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
   23713                            .dwattr $C$DW$T$149, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23714                            .dwattr $C$DW$T$149, DW_AT_decl_line(0xd7)
   23715                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x03)
   23716                    
   23717                    
   23718                    $C$DW$T$108     .dwtag  DW_TAG_enumeration_type
   23719                            .dwattr $C$DW$T$108, DW_AT_name("GPTimerCC26XX_Mode")
   23720                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x02)
   23721                    $C$DW$893       .dwtag  DW_TAG_enumerator
   23722                            .dwattr $C$DW$893, DW_AT_name("GPT_MODE_ONESHOT")
   23723                            .dwattr $C$DW$893, DW_AT_const_value(0x21)
   23724                            .dwattr $C$DW$893, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23725                            .dwattr $C$DW$893, DW_AT_decl_line(0xbd)
   23726                            .dwattr $C$DW$893, DW_AT_decl_column(0x05)
   23727                    
   23728                    $C$DW$894       .dwtag  DW_TAG_enumerator
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  434

   23729                            .dwattr $C$DW$894, DW_AT_name("GPT_MODE_PERIODIC")
   23730                            .dwattr $C$DW$894, DW_AT_const_value(0x22)
   23731                            .dwattr $C$DW$894, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23732                            .dwattr $C$DW$894, DW_AT_decl_line(0xbf)
   23733                            .dwattr $C$DW$894, DW_AT_decl_column(0x05)
   23734                    
   23735                    $C$DW$895       .dwtag  DW_TAG_enumerator
   23736                            .dwattr $C$DW$895, DW_AT_name("GPT_MODE_EDGE_COUNT")
   23737                            .dwattr $C$DW$895, DW_AT_const_value(0x03)
   23738                            .dwattr $C$DW$895, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23739                            .dwattr $C$DW$895, DW_AT_decl_line(0xc1)
   23740                            .dwattr $C$DW$895, DW_AT_decl_column(0x05)
   23741                    
   23742                    $C$DW$896       .dwtag  DW_TAG_enumerator
   23743                            .dwattr $C$DW$896, DW_AT_name("GPT_MODE_EDGE_TIME")
   23744                            .dwattr $C$DW$896, DW_AT_const_value(0x07)
   23745                            .dwattr $C$DW$896, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23746                            .dwattr $C$DW$896, DW_AT_decl_line(0xc3)
   23747                            .dwattr $C$DW$896, DW_AT_decl_column(0x05)
   23748                    
   23749                    $C$DW$897       .dwtag  DW_TAG_enumerator
   23750                            .dwattr $C$DW$897, DW_AT_name("GPT_MODE_PWM")
   23751                            .dwattr $C$DW$897, DW_AT_const_value(0xa0a)
   23752                            .dwattr $C$DW$897, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23753                            .dwattr $C$DW$897, DW_AT_decl_line(0xc6)
   23754                            .dwattr $C$DW$897, DW_AT_decl_column(0x05)
   23755                    
   23756                            .dwattr $C$DW$T$108, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23757                            .dwattr $C$DW$T$108, DW_AT_decl_line(0xba)
   23758                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x0e)
   23759                            .dwendtag $C$DW$T$108
   23760                    
   23761                    $C$DW$T$109     .dwtag  DW_TAG_typedef
   23762                            .dwattr $C$DW$T$109, DW_AT_name("GPTimerCC26XX_Mode")
   23763                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
   23764                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
   23765                            .dwattr $C$DW$T$109, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23766                            .dwattr $C$DW$T$109, DW_AT_decl_line(0xc9)
   23767                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x03)
   23768                    
   23769                    
   23770                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
   23771                            .dwattr $C$DW$T$107, DW_AT_name("GPTimerCC26XX_Object")
   23772                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x48)
   23773                    $C$DW$898       .dwtag  DW_TAG_member
   23774                            .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$92)
   23775                            .dwattr $C$DW$898, DW_AT_name("width")
   23776                            .dwattr $C$DW$898, DW_AT_TI_symbol_name("width")
   23777                            .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   23778                            .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
   23779                            .dwattr $C$DW$898, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23780                            .dwattr $C$DW$898, DW_AT_decl_line(0x17a)
   23781                            .dwattr $C$DW$898, DW_AT_decl_column(0x1a)
   23782                    
   23783                    $C$DW$899       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  435

   23784                            .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$94)
   23785                            .dwattr $C$DW$899, DW_AT_name("isOpen")
   23786                            .dwattr $C$DW$899, DW_AT_TI_symbol_name("isOpen")
   23787                            .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   23788                            .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
   23789                            .dwattr $C$DW$899, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23790                            .dwattr $C$DW$899, DW_AT_decl_line(0x17b)
   23791                            .dwattr $C$DW$899, DW_AT_decl_column(0x1a)
   23792                    
   23793                    $C$DW$900       .dwtag  DW_TAG_member
   23794                            .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$96)
   23795                            .dwattr $C$DW$900, DW_AT_name("hwi")
   23796                            .dwattr $C$DW$900, DW_AT_TI_symbol_name("hwi")
   23797                            .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   23798                            .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
   23799                            .dwattr $C$DW$900, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23800                            .dwattr $C$DW$900, DW_AT_decl_line(0x17c)
   23801                            .dwattr $C$DW$900, DW_AT_decl_column(0x1b)
   23802                    
   23803                    $C$DW$901       .dwtag  DW_TAG_member
   23804                            .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$104)
   23805                            .dwattr $C$DW$901, DW_AT_name("hwiCallbackFxn")
   23806                            .dwattr $C$DW$901, DW_AT_TI_symbol_name("hwiCallbackFxn")
   23807                            .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   23808                            .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
   23809                            .dwattr $C$DW$901, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23810                            .dwattr $C$DW$901, DW_AT_decl_line(0x17d)
   23811                            .dwattr $C$DW$901, DW_AT_decl_column(0x1a)
   23812                    
   23813                    $C$DW$902       .dwtag  DW_TAG_member
   23814                            .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$106)
   23815                            .dwattr $C$DW$902, DW_AT_name("powerConstraint")
   23816                            .dwattr $C$DW$902, DW_AT_TI_symbol_name("powerConstraint")
   23817                            .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   23818                            .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
   23819                            .dwattr $C$DW$902, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23820                            .dwattr $C$DW$902, DW_AT_decl_line(0x17e)
   23821                            .dwattr $C$DW$902, DW_AT_decl_column(0x1a)
   23822                    
   23823                            .dwattr $C$DW$T$107, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   23824                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x178)
   23825                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x10)
   23826                            .dwendtag $C$DW$T$107
   23827                    
   23828                    $C$DW$T$80      .dwtag  DW_TAG_typedef
   23829                            .dwattr $C$DW$T$80, DW_AT_name("GPTimerCC26XX_Object")
   23830                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$107)
   23831                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   23832                            .dwattr $C$DW$T$80, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dri
   23833                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x17f)
   23834                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
   23835                    
   23836                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
   23837                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
   23838                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  436

   23839                    
   23840                    
   23841                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
   23842                            .dwattr $C$DW$T$116, DW_AT_name("GPTimerCC26XX_Params")
   23843                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x08)
   23844                    $C$DW$903       .dwtag  DW_TAG_member
   23845                            .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$92)
   23846                            .dwattr $C$DW$903, DW_AT_name("width")
   23847                            .dwattr $C$DW$903, DW_AT_TI_symbol_name("width")
   23848                            .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   23849                            .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
   23850                            .dwattr $C$DW$903, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23851                            .dwattr $C$DW$903, DW_AT_decl_line(0x1a7)
   23852                            .dwattr $C$DW$903, DW_AT_decl_column(0x25)
   23853                    
   23854                    $C$DW$904       .dwtag  DW_TAG_member
   23855                            .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$109)
   23856                            .dwattr $C$DW$904, DW_AT_name("mode")
   23857                            .dwattr $C$DW$904, DW_AT_TI_symbol_name("mode")
   23858                            .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   23859                            .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
   23860                            .dwattr $C$DW$904, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23861                            .dwattr $C$DW$904, DW_AT_decl_line(0x1a8)
   23862                            .dwattr $C$DW$904, DW_AT_decl_column(0x25)
   23863                    
   23864                    $C$DW$905       .dwtag  DW_TAG_member
   23865                            .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$111)
   23866                            .dwattr $C$DW$905, DW_AT_name("matchTiming")
   23867                            .dwattr $C$DW$905, DW_AT_TI_symbol_name("matchTiming")
   23868                            .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   23869                            .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
   23870                            .dwattr $C$DW$905, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23871                            .dwattr $C$DW$905, DW_AT_decl_line(0x1a9)
   23872                            .dwattr $C$DW$905, DW_AT_decl_column(0x25)
   23873                    
   23874                    $C$DW$906       .dwtag  DW_TAG_member
   23875                            .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$113)
   23876                            .dwattr $C$DW$906, DW_AT_name("direction")
   23877                            .dwattr $C$DW$906, DW_AT_TI_symbol_name("direction")
   23878                            .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   23879                            .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
   23880                            .dwattr $C$DW$906, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23881                            .dwattr $C$DW$906, DW_AT_decl_line(0x1aa)
   23882                            .dwattr $C$DW$906, DW_AT_decl_column(0x25)
   23883                    
   23884                    $C$DW$907       .dwtag  DW_TAG_member
   23885                            .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$115)
   23886                            .dwattr $C$DW$907, DW_AT_name("debugStallMode")
   23887                            .dwattr $C$DW$907, DW_AT_TI_symbol_name("debugStallMode")
   23888                            .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   23889                            .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
   23890                            .dwattr $C$DW$907, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   23891                            .dwattr $C$DW$907, DW_AT_decl_line(0x1ab)
   23892                            .dwattr $C$DW$907, DW_AT_decl_column(0x25)
   23893                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
inv_mpu.asm                                                          PAGE  437

