TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.4.LTS *
       3                    ;* Date/Time created: Fri Apr  2 00:57:45 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../App/flight.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.4.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/home/merdak/KOLTEST/TIV10/Quad/Debug")
      13                    $C$DW$1 .dwtag  DW_TAG_variable
      14                            .dwattr $C$DW$1, DW_AT_name("mpu")

    9481                            .dwattr $C$DW$586, DW_AT_decl_column(0x05)
    9482                    
    9483                    $C$DW$587       .dwtag  DW_TAG_enumerator
    9484                            .dwattr $C$DW$587, DW_AT_name("SPI_MW")
    9485                            .dwattr $C$DW$587, DW_AT_const_value(0x05)
    9486                            .dwattr $C$DW$587, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9487                            .dwattr $C$DW$587, DW_AT_decl_line(0x25e)
    9488                            .dwattr $C$DW$587, DW_AT_decl_column(0x05)
    9489                    
    9490                            .dwattr $C$DW$T$146, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9491                            .dwattr $C$DW$T$146, DW_AT_decl_line(0x257)
    9492                            .dwattr $C$DW$T$146, DW_AT_decl_column(0x0e)
    9493                            .dwendtag $C$DW$T$146
    9494                    
    9495                    $C$DW$T$147     .dwtag  DW_TAG_typedef
    9496                            .dwattr $C$DW$T$147, DW_AT_name("SPI_FrameFormat")
    9497                            .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
    9498                            .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  174

    9499                            .dwattr $C$DW$T$147, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9500                            .dwattr $C$DW$T$147, DW_AT_decl_line(0x260)
    9501                            .dwattr $C$DW$T$147, DW_AT_decl_column(0x03)
    9502                    
    9503                    
    9504                    $C$DW$T$742     .dwtag  DW_TAG_enumeration_type
    9505                            .dwattr $C$DW$T$742, DW_AT_byte_size(0x01)
    9506                    $C$DW$588       .dwtag  DW_TAG_enumerator
    9507                            .dwattr $C$DW$588, DW_AT_name("PIN_SUCCESS")
    9508                            .dwattr $C$DW$588, DW_AT_const_value(0x00)
    9509                            .dwattr $C$DW$588, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9510                            .dwattr $C$DW$588, DW_AT_decl_line(0x2cd)
    9511                            .dwattr $C$DW$588, DW_AT_decl_column(0x05)
    9512                    
    9513                    $C$DW$589       .dwtag  DW_TAG_enumerator
    9514                            .dwattr $C$DW$589, DW_AT_name("PIN_ALREADY_ALLOCATED")
    9515                            .dwattr $C$DW$589, DW_AT_const_value(0x01)
    9516                            .dwattr $C$DW$589, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9517                            .dwattr $C$DW$589, DW_AT_decl_line(0x2ce)
    9518                            .dwattr $C$DW$589, DW_AT_decl_column(0x05)
    9519                    
    9520                    $C$DW$590       .dwtag  DW_TAG_enumerator
    9521                            .dwattr $C$DW$590, DW_AT_name("PIN_NO_ACCESS")
    9522                            .dwattr $C$DW$590, DW_AT_const_value(0x02)
    9523                            .dwattr $C$DW$590, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9524                            .dwattr $C$DW$590, DW_AT_decl_line(0x2cf)
    9525                            .dwattr $C$DW$590, DW_AT_decl_column(0x05)
    9526                    
    9527                    $C$DW$591       .dwtag  DW_TAG_enumerator
    9528                            .dwattr $C$DW$591, DW_AT_name("PIN_UNSUPPORTED")
    9529                            .dwattr $C$DW$591, DW_AT_const_value(0x03)
    9530                            .dwattr $C$DW$591, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9531                            .dwattr $C$DW$591, DW_AT_decl_line(0x2d0)
    9532                            .dwattr $C$DW$591, DW_AT_decl_column(0x05)
    9533                    
    9534                            .dwattr $C$DW$T$742, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9535                            .dwattr $C$DW$T$742, DW_AT_decl_line(0x2cc)
    9536                            .dwattr $C$DW$T$742, DW_AT_decl_column(0x0e)
    9537                            .dwendtag $C$DW$T$742
    9538                    
    9539                    $C$DW$T$743     .dwtag  DW_TAG_typedef
    9540                            .dwattr $C$DW$T$743, DW_AT_name("PIN_Status")
    9541                            .dwattr $C$DW$T$743, DW_AT_type(*$C$DW$T$742)
    9542                            .dwattr $C$DW$T$743, DW_AT_language(DW_LANG_C)
    9543                            .dwattr $C$DW$T$743, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9544                            .dwattr $C$DW$T$743, DW_AT_decl_line(0x2d1)
    9545                            .dwattr $C$DW$T$743, DW_AT_decl_column(0x03)
    9546                    
    9547                    
    9548                    $C$DW$T$130     .dwtag  DW_TAG_structure_type
    9549                            .dwattr $C$DW$T$130, DW_AT_byte_size(0x18)
    9550                    $C$DW$592       .dwtag  DW_TAG_member
    9551                            .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$123)
    9552                            .dwattr $C$DW$592, DW_AT_name("periodUnits")
    9553                            .dwattr $C$DW$592, DW_AT_TI_symbol_name("periodUnits")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  175

    9554                            .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9555                            .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    9556                            .dwattr $C$DW$592, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9557                            .dwattr $C$DW$592, DW_AT_decl_line(0x148)
    9558                            .dwattr $C$DW$592, DW_AT_decl_column(0x16)
    9559                    
    9560                    $C$DW$593       .dwtag  DW_TAG_member
    9561                            .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$125)
    9562                            .dwattr $C$DW$593, DW_AT_name("periodValue")
    9563                            .dwattr $C$DW$593, DW_AT_TI_symbol_name("periodValue")
    9564                            .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9565                            .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    9566                            .dwattr $C$DW$593, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9567                            .dwattr $C$DW$593, DW_AT_decl_line(0x149)
    9568                            .dwattr $C$DW$593, DW_AT_decl_column(0x16)
    9569                    
    9570                    $C$DW$594       .dwtag  DW_TAG_member
    9571                            .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$127)
    9572                            .dwattr $C$DW$594, DW_AT_name("dutyUnits")
    9573                            .dwattr $C$DW$594, DW_AT_TI_symbol_name("dutyUnits")
    9574                            .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9575                            .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    9576                            .dwattr $C$DW$594, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9577                            .dwattr $C$DW$594, DW_AT_decl_line(0x14a)
    9578                            .dwattr $C$DW$594, DW_AT_decl_column(0x16)
    9579                    
    9580                    $C$DW$595       .dwtag  DW_TAG_member
    9581                            .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$125)
    9582                            .dwattr $C$DW$595, DW_AT_name("dutyValue")
    9583                            .dwattr $C$DW$595, DW_AT_TI_symbol_name("dutyValue")
    9584                            .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9585                            .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    9586                            .dwattr $C$DW$595, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9587                            .dwattr $C$DW$595, DW_AT_decl_line(0x14b)
    9588                            .dwattr $C$DW$595, DW_AT_decl_column(0x16)
    9589                    
    9590                    $C$DW$596       .dwtag  DW_TAG_member
    9591                            .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$129)
    9592                            .dwattr $C$DW$596, DW_AT_name("idleLevel")
    9593                            .dwattr $C$DW$596, DW_AT_TI_symbol_name("idleLevel")
    9594                            .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9595                            .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    9596                            .dwattr $C$DW$596, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9597                            .dwattr $C$DW$596, DW_AT_decl_line(0x14c)
    9598                            .dwattr $C$DW$596, DW_AT_decl_column(0x16)
    9599                    
    9600                    $C$DW$597       .dwtag  DW_TAG_member
    9601                            .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$3)
    9602                            .dwattr $C$DW$597, DW_AT_name("custom")
    9603                            .dwattr $C$DW$597, DW_AT_TI_symbol_name("custom")
    9604                            .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9605                            .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    9606                            .dwattr $C$DW$597, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9607                            .dwattr $C$DW$597, DW_AT_decl_line(0x14d)
    9608                            .dwattr $C$DW$597, DW_AT_decl_column(0x16)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  176

    9609                    
    9610                            .dwattr $C$DW$T$130, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9611                            .dwattr $C$DW$T$130, DW_AT_decl_line(0x147)
    9612                            .dwattr $C$DW$T$130, DW_AT_decl_column(0x10)
    9613                            .dwendtag $C$DW$T$130
    9614                    
    9615                    $C$DW$T$341     .dwtag  DW_TAG_typedef
    9616                            .dwattr $C$DW$T$341, DW_AT_name("PWM_Params")
    9617                            .dwattr $C$DW$T$341, DW_AT_type(*$C$DW$T$130)
    9618                            .dwattr $C$DW$T$341, DW_AT_language(DW_LANG_C)
    9619                            .dwattr $C$DW$T$341, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9620                            .dwattr $C$DW$T$341, DW_AT_decl_line(0x14f)
    9621                            .dwattr $C$DW$T$341, DW_AT_decl_column(0x03)
    9622                    
    9623                    $C$DW$T$342     .dwtag  DW_TAG_pointer_type
    9624                            .dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$341)
    9625                            .dwattr $C$DW$T$342, DW_AT_address_class(0x20)
    9626                    
    9627                    
    9628                    $C$DW$T$134     .dwtag  DW_TAG_structure_type
    9629                            .dwattr $C$DW$T$134, DW_AT_byte_size(0x18)
    9630                    $C$DW$598       .dwtag  DW_TAG_member
    9631                            .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$131)
    9632                            .dwattr $C$DW$598, DW_AT_name("count")
    9633                            .dwattr $C$DW$598, DW_AT_TI_symbol_name("count")
    9634                            .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9635                            .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    9636                            .dwattr $C$DW$598, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9637                            .dwattr $C$DW$598, DW_AT_decl_line(0x235)
    9638                            .dwattr $C$DW$598, DW_AT_decl_column(0x10)
    9639                    
    9640                    $C$DW$599       .dwtag  DW_TAG_member
    9641                            .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$3)
    9642                            .dwattr $C$DW$599, DW_AT_name("txBuf")
    9643                            .dwattr $C$DW$599, DW_AT_TI_symbol_name("txBuf")
    9644                            .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9645                            .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    9646                            .dwattr $C$DW$599, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9647                            .dwattr $C$DW$599, DW_AT_decl_line(0x236)
    9648                            .dwattr $C$DW$599, DW_AT_decl_column(0x10)
    9649                    
    9650                    $C$DW$600       .dwtag  DW_TAG_member
    9651                            .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$3)
    9652                            .dwattr $C$DW$600, DW_AT_name("rxBuf")
    9653                            .dwattr $C$DW$600, DW_AT_TI_symbol_name("rxBuf")
    9654                            .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9655                            .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    9656                            .dwattr $C$DW$600, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9657                            .dwattr $C$DW$600, DW_AT_decl_line(0x237)
    9658                            .dwattr $C$DW$600, DW_AT_decl_column(0x10)
    9659                    
    9660                    $C$DW$601       .dwtag  DW_TAG_member
    9661                            .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$3)
    9662                            .dwattr $C$DW$601, DW_AT_name("arg")
    9663                            .dwattr $C$DW$601, DW_AT_TI_symbol_name("arg")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  177

    9664                            .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9665                            .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    9666                            .dwattr $C$DW$601, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9667                            .dwattr $C$DW$601, DW_AT_decl_line(0x238)
    9668                            .dwattr $C$DW$601, DW_AT_decl_column(0x10)
    9669                    
    9670                    $C$DW$602       .dwtag  DW_TAG_member
    9671                            .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$133)
    9672                            .dwattr $C$DW$602, DW_AT_name("status")
    9673                            .dwattr $C$DW$602, DW_AT_TI_symbol_name("status")
    9674                            .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9675                            .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    9676                            .dwattr $C$DW$602, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9677                            .dwattr $C$DW$602, DW_AT_decl_line(0x23b)
    9678                            .dwattr $C$DW$602, DW_AT_decl_column(0x10)
    9679                    
    9680                    $C$DW$603       .dwtag  DW_TAG_member
    9681                            .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$3)
    9682                            .dwattr $C$DW$603, DW_AT_name("nextPtr")
    9683                            .dwattr $C$DW$603, DW_AT_TI_symbol_name("nextPtr")
    9684                            .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9685                            .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    9686                            .dwattr $C$DW$603, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9687                            .dwattr $C$DW$603, DW_AT_decl_line(0x23d)
    9688                            .dwattr $C$DW$603, DW_AT_decl_column(0x0b)
    9689                    
    9690                            .dwattr $C$DW$T$134, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9691                            .dwattr $C$DW$T$134, DW_AT_decl_line(0x233)
    9692                            .dwattr $C$DW$T$134, DW_AT_decl_column(0x11)
    9693                            .dwendtag $C$DW$T$134
    9694                    
    9695                    $C$DW$T$139     .dwtag  DW_TAG_typedef
    9696                            .dwattr $C$DW$T$139, DW_AT_name("SPI_Transaction")
    9697                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$134)
    9698                            .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    9699                            .dwattr $C$DW$T$139, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9700                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x23f)
    9701                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x03)
    9702                    
    9703                    $C$DW$T$140     .dwtag  DW_TAG_pointer_type
    9704                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$139)
    9705                            .dwattr $C$DW$T$140, DW_AT_address_class(0x20)
    9706                    
    9707                    
    9708                    $C$DW$T$148     .dwtag  DW_TAG_structure_type
    9709                            .dwattr $C$DW$T$148, DW_AT_byte_size(0x20)
    9710                    $C$DW$604       .dwtag  DW_TAG_member
    9711                            .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$136)
    9712                            .dwattr $C$DW$604, DW_AT_name("transferMode")
    9713                            .dwattr $C$DW$604, DW_AT_TI_symbol_name("transferMode")
    9714                            .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9715                            .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    9716                            .dwattr $C$DW$604, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9717                            .dwattr $C$DW$604, DW_AT_decl_line(0x283)
    9718                            .dwattr $C$DW$604, DW_AT_decl_column(0x16)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  178

    9719                    
    9720                    $C$DW$605       .dwtag  DW_TAG_member
    9721                            .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$125)
    9722                            .dwattr $C$DW$605, DW_AT_name("transferTimeout")
    9723                            .dwattr $C$DW$605, DW_AT_TI_symbol_name("transferTimeout")
    9724                            .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9725                            .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    9726                            .dwattr $C$DW$605, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9727                            .dwattr $C$DW$605, DW_AT_decl_line(0x284)
    9728                            .dwattr $C$DW$605, DW_AT_decl_column(0x16)
    9729                    
    9730                    $C$DW$606       .dwtag  DW_TAG_member
    9731                            .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$143)
    9732                            .dwattr $C$DW$606, DW_AT_name("transferCallbackFxn")
    9733                            .dwattr $C$DW$606, DW_AT_TI_symbol_name("transferCallbackFxn")
    9734                            .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9735                            .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    9736                            .dwattr $C$DW$606, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9737                            .dwattr $C$DW$606, DW_AT_decl_line(0x286)
    9738                            .dwattr $C$DW$606, DW_AT_decl_column(0x16)
    9739                    
    9740                    $C$DW$607       .dwtag  DW_TAG_member
    9741                            .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$145)
    9742                            .dwattr $C$DW$607, DW_AT_name("mode")
    9743                            .dwattr $C$DW$607, DW_AT_TI_symbol_name("mode")
    9744                            .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9745                            .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    9746                            .dwattr $C$DW$607, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9747                            .dwattr $C$DW$607, DW_AT_decl_line(0x287)
    9748                            .dwattr $C$DW$607, DW_AT_decl_column(0x16)
    9749                    
    9750                    $C$DW$608       .dwtag  DW_TAG_member
    9751                            .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$125)
    9752                            .dwattr $C$DW$608, DW_AT_name("bitRate")
    9753                            .dwattr $C$DW$608, DW_AT_TI_symbol_name("bitRate")
    9754                            .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9755                            .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    9756                            .dwattr $C$DW$608, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9757                            .dwattr $C$DW$608, DW_AT_decl_line(0x295)
    9758                            .dwattr $C$DW$608, DW_AT_decl_column(0x16)
    9759                    
    9760                    $C$DW$609       .dwtag  DW_TAG_member
    9761                            .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$125)
    9762                            .dwattr $C$DW$609, DW_AT_name("dataSize")
    9763                            .dwattr $C$DW$609, DW_AT_TI_symbol_name("dataSize")
    9764                            .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9765                            .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    9766                            .dwattr $C$DW$609, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9767                            .dwattr $C$DW$609, DW_AT_decl_line(0x296)
    9768                            .dwattr $C$DW$609, DW_AT_decl_column(0x16)
    9769                    
    9770                    $C$DW$610       .dwtag  DW_TAG_member
    9771                            .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$147)
    9772                            .dwattr $C$DW$610, DW_AT_name("frameFormat")
    9773                            .dwattr $C$DW$610, DW_AT_TI_symbol_name("frameFormat")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  179

    9774                            .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9775                            .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    9776                            .dwattr $C$DW$610, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9777                            .dwattr $C$DW$610, DW_AT_decl_line(0x297)
    9778                            .dwattr $C$DW$610, DW_AT_decl_column(0x16)
    9779                    
    9780                    $C$DW$611       .dwtag  DW_TAG_member
    9781                            .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$3)
    9782                            .dwattr $C$DW$611, DW_AT_name("custom")
    9783                            .dwattr $C$DW$611, DW_AT_TI_symbol_name("custom")
    9784                            .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9785                            .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    9786                            .dwattr $C$DW$611, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9787                            .dwattr $C$DW$611, DW_AT_decl_line(0x298)
    9788                            .dwattr $C$DW$611, DW_AT_decl_column(0x16)
    9789                    
    9790                            .dwattr $C$DW$T$148, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9791                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x282)
    9792                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x10)
    9793                            .dwendtag $C$DW$T$148
    9794                    
    9795                    $C$DW$T$161     .dwtag  DW_TAG_typedef
    9796                            .dwattr $C$DW$T$161, DW_AT_name("SPI_Params")
    9797                            .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$148)
    9798                            .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    9799                            .dwattr $C$DW$T$161, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9800                            .dwattr $C$DW$T$161, DW_AT_decl_line(0x29a)
    9801                            .dwattr $C$DW$T$161, DW_AT_decl_column(0x03)
    9802                    
    9803                    $C$DW$T$162     .dwtag  DW_TAG_pointer_type
    9804                            .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$161)
    9805                            .dwattr $C$DW$T$162, DW_AT_address_class(0x20)
    9806                    
    9807                    
    9808                    $C$DW$T$171     .dwtag  DW_TAG_structure_type
    9809                            .dwattr $C$DW$T$171, DW_AT_byte_size(0x18)
    9810                    $C$DW$612       .dwtag  DW_TAG_member
    9811                            .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$151)
    9812                            .dwattr $C$DW$612, DW_AT_name("closeFxn")
    9813                            .dwattr $C$DW$612, DW_AT_TI_symbol_name("closeFxn")
    9814                            .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9815                            .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    9816                            .dwattr $C$DW$612, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9817                            .dwattr $C$DW$612, DW_AT_decl_line(0x2c9)
    9818                            .dwattr $C$DW$612, DW_AT_decl_column(0x1b)
    9819                    
    9820                    $C$DW$613       .dwtag  DW_TAG_member
    9821                            .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$159)
    9822                            .dwattr $C$DW$613, DW_AT_name("controlFxn")
    9823                            .dwattr $C$DW$613, DW_AT_TI_symbol_name("controlFxn")
    9824                            .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9825                            .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    9826                            .dwattr $C$DW$613, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9827                            .dwattr $C$DW$613, DW_AT_decl_line(0x2cc)
    9828                            .dwattr $C$DW$613, DW_AT_decl_column(0x1b)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  180

    9829                    
    9830                    $C$DW$614       .dwtag  DW_TAG_member
    9831                            .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$160)
    9832                            .dwattr $C$DW$614, DW_AT_name("initFxn")
    9833                            .dwattr $C$DW$614, DW_AT_TI_symbol_name("initFxn")
    9834                            .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9835                            .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    9836                            .dwattr $C$DW$614, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9837                            .dwattr $C$DW$614, DW_AT_decl_line(0x2cf)
    9838                            .dwattr $C$DW$614, DW_AT_decl_column(0x1b)
    9839                    
    9840                    $C$DW$615       .dwtag  DW_TAG_member
    9841                            .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$165)
    9842                            .dwattr $C$DW$615, DW_AT_name("openFxn")
    9843                            .dwattr $C$DW$615, DW_AT_TI_symbol_name("openFxn")
    9844                            .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9845                            .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    9846                            .dwattr $C$DW$615, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9847                            .dwattr $C$DW$615, DW_AT_decl_line(0x2d2)
    9848                            .dwattr $C$DW$615, DW_AT_decl_column(0x1b)
    9849                    
    9850                    $C$DW$616       .dwtag  DW_TAG_member
    9851                            .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$169)
    9852                            .dwattr $C$DW$616, DW_AT_name("transferFxn")
    9853                            .dwattr $C$DW$616, DW_AT_TI_symbol_name("transferFxn")
    9854                            .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9855                            .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    9856                            .dwattr $C$DW$616, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9857                            .dwattr $C$DW$616, DW_AT_decl_line(0x2d5)
    9858                            .dwattr $C$DW$616, DW_AT_decl_column(0x1b)
    9859                    
    9860                    $C$DW$617       .dwtag  DW_TAG_member
    9861                            .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$170)
    9862                            .dwattr $C$DW$617, DW_AT_name("transferCancelFxn")
    9863                            .dwattr $C$DW$617, DW_AT_TI_symbol_name("transferCancelFxn")
    9864                            .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9865                            .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    9866                            .dwattr $C$DW$617, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
    9867                            .dwattr $C$DW$617, DW_AT_decl_line(0x2d8)
    9868                            .dwattr $C$DW$617, DW_AT_decl_column(0x1b)
    9869                    
    9870                            .dwattr $C$DW$T$171, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9871                            .dwattr $C$DW$T$171, DW_AT_decl_line(0x2c7)
    9872                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x10)
    9873                            .dwendtag $C$DW$T$171
    9874                    
    9875                    $C$DW$T$356     .dwtag  DW_TAG_typedef
    9876                            .dwattr $C$DW$T$356, DW_AT_name("SPI_FxnTable")
    9877                            .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$171)
    9878                            .dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
    9879                            .dwattr $C$DW$T$356, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
    9880                            .dwattr $C$DW$T$356, DW_AT_decl_line(0x2d9)
    9881                            .dwattr $C$DW$T$356, DW_AT_decl_column(0x03)
    9882                    
    9883                    $C$DW$T$357     .dwtag  DW_TAG_const_type
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  181

    9884                            .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$356)
    9885                    
    9886                    $C$DW$T$358     .dwtag  DW_TAG_pointer_type
    9887                            .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$357)
    9888                            .dwattr $C$DW$T$358, DW_AT_address_class(0x20)
    9889                    
    9890                    
    9891                    $C$DW$T$174     .dwtag  DW_TAG_structure_type
    9892                            .dwattr $C$DW$T$174, DW_AT_byte_size(0x3c)
    9893                    $C$DW$618       .dwtag  DW_TAG_member
    9894                            .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$173)
    9895                            .dwattr $C$DW$618, DW_AT_name("ref")
    9896                            .dwattr $C$DW$618, DW_AT_TI_symbol_name("ref")
    9897                            .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9898                            .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    9899                            .dwattr $C$DW$618, DW_AT_decl_file("../App/flight.h")
    9900                            .dwattr $C$DW$618, DW_AT_decl_line(0x03)
    9901                            .dwattr $C$DW$618, DW_AT_decl_column(0x18)
    9902                    
    9903                    $C$DW$619       .dwtag  DW_TAG_member
    9904                            .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$173)
    9905                            .dwattr $C$DW$619, DW_AT_name("fdb")
    9906                            .dwattr $C$DW$619, DW_AT_TI_symbol_name("fdb")
    9907                            .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9908                            .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    9909                            .dwattr $C$DW$619, DW_AT_decl_file("../App/flight.h")
    9910                            .dwattr $C$DW$619, DW_AT_decl_line(0x04)
    9911                            .dwattr $C$DW$619, DW_AT_decl_column(0x18)
    9912                    
    9913                    $C$DW$620       .dwtag  DW_TAG_member
    9914                            .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$172)
    9915                            .dwattr $C$DW$620, DW_AT_name("Kp")
    9916                            .dwattr $C$DW$620, DW_AT_TI_symbol_name("Kp")
    9917                            .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9918                            .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    9919                            .dwattr $C$DW$620, DW_AT_decl_file("../App/flight.h")
    9920                            .dwattr $C$DW$620, DW_AT_decl_line(0x05)
    9921                            .dwattr $C$DW$620, DW_AT_decl_column(0x18)
    9922                    
    9923                    $C$DW$621       .dwtag  DW_TAG_member
    9924                            .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$172)
    9925                            .dwattr $C$DW$621, DW_AT_name("Ki")
    9926                            .dwattr $C$DW$621, DW_AT_TI_symbol_name("Ki")
    9927                            .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9928                            .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    9929                            .dwattr $C$DW$621, DW_AT_decl_file("../App/flight.h")
    9930                            .dwattr $C$DW$621, DW_AT_decl_line(0x06)
    9931                            .dwattr $C$DW$621, DW_AT_decl_column(0x18)
    9932                    
    9933                    $C$DW$622       .dwtag  DW_TAG_member
    9934                            .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$172)
    9935                            .dwattr $C$DW$622, DW_AT_name("Kd")
    9936                            .dwattr $C$DW$622, DW_AT_TI_symbol_name("Kd")
    9937                            .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9938                            .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  182

    9939                            .dwattr $C$DW$622, DW_AT_decl_file("../App/flight.h")
    9940                            .dwattr $C$DW$622, DW_AT_decl_line(0x07)
    9941                            .dwattr $C$DW$622, DW_AT_decl_column(0x18)
    9942                    
    9943                    $C$DW$623       .dwtag  DW_TAG_member
    9944                            .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$172)
    9945                            .dwattr $C$DW$623, DW_AT_name("Kc")
    9946                            .dwattr $C$DW$623, DW_AT_TI_symbol_name("Kc")
    9947                            .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9948                            .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    9949                            .dwattr $C$DW$623, DW_AT_decl_file("../App/flight.h")
    9950                            .dwattr $C$DW$623, DW_AT_decl_line(0x08)
    9951                            .dwattr $C$DW$623, DW_AT_decl_column(0x18)
    9952                    
    9953                    $C$DW$624       .dwtag  DW_TAG_member
    9954                            .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$172)
    9955                            .dwattr $C$DW$624, DW_AT_name("Gp")
    9956                            .dwattr $C$DW$624, DW_AT_TI_symbol_name("Gp")
    9957                            .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9958                            .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    9959                            .dwattr $C$DW$624, DW_AT_decl_file("../App/flight.h")
    9960                            .dwattr $C$DW$624, DW_AT_decl_line(0x09)
    9961                            .dwattr $C$DW$624, DW_AT_decl_column(0x18)
    9962                    
    9963                    $C$DW$625       .dwtag  DW_TAG_member
    9964                            .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$172)
    9965                            .dwattr $C$DW$625, DW_AT_name("Gi")
    9966                            .dwattr $C$DW$625, DW_AT_TI_symbol_name("Gi")
    9967                            .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9968                            .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    9969                            .dwattr $C$DW$625, DW_AT_decl_file("../App/flight.h")
    9970                            .dwattr $C$DW$625, DW_AT_decl_line(0x0a)
    9971                            .dwattr $C$DW$625, DW_AT_decl_column(0x18)
    9972                    
    9973                    $C$DW$626       .dwtag  DW_TAG_member
    9974                            .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$172)
    9975                            .dwattr $C$DW$626, DW_AT_name("yn")
    9976                            .dwattr $C$DW$626, DW_AT_TI_symbol_name("yn")
    9977                            .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9978                            .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    9979                            .dwattr $C$DW$626, DW_AT_decl_file("../App/flight.h")
    9980                            .dwattr $C$DW$626, DW_AT_decl_line(0x0b)
    9981                            .dwattr $C$DW$626, DW_AT_decl_column(0x18)
    9982                    
    9983                    $C$DW$627       .dwtag  DW_TAG_member
    9984                            .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$172)
    9985                            .dwattr $C$DW$627, DW_AT_name("yp")
    9986                            .dwattr $C$DW$627, DW_AT_TI_symbol_name("yp")
    9987                            .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    9988                            .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    9989                            .dwattr $C$DW$627, DW_AT_decl_file("../App/flight.h")
    9990                            .dwattr $C$DW$627, DW_AT_decl_line(0x0c)
    9991                            .dwattr $C$DW$627, DW_AT_decl_column(0x18)
    9992                    
    9993                    $C$DW$628       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  183

    9994                            .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$172)
    9995                            .dwattr $C$DW$628, DW_AT_name("ep")
    9996                            .dwattr $C$DW$628, DW_AT_TI_symbol_name("ep")
    9997                            .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9998                            .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    9999                            .dwattr $C$DW$628, DW_AT_decl_file("../App/flight.h")
   10000                            .dwattr $C$DW$628, DW_AT_decl_line(0x0d)
   10001                            .dwattr $C$DW$628, DW_AT_decl_column(0x18)
   10002                    
   10003                    $C$DW$629       .dwtag  DW_TAG_member
   10004                            .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$172)
   10005                            .dwattr $C$DW$629, DW_AT_name("es")
   10006                            .dwattr $C$DW$629, DW_AT_TI_symbol_name("es")
   10007                            .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   10008                            .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
   10009                            .dwattr $C$DW$629, DW_AT_decl_file("../App/flight.h")
   10010                            .dwattr $C$DW$629, DW_AT_decl_line(0x0e)
   10011                            .dwattr $C$DW$629, DW_AT_decl_column(0x18)
   10012                    
   10013                    $C$DW$630       .dwtag  DW_TAG_member
   10014                            .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$172)
   10015                            .dwattr $C$DW$630, DW_AT_name("ei")
   10016                            .dwattr $C$DW$630, DW_AT_TI_symbol_name("ei")
   10017                            .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   10018                            .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
   10019                            .dwattr $C$DW$630, DW_AT_decl_file("../App/flight.h")
   10020                            .dwattr $C$DW$630, DW_AT_decl_line(0x0f)
   10021                            .dwattr $C$DW$630, DW_AT_decl_column(0x18)
   10022                    
   10023                    $C$DW$631       .dwtag  DW_TAG_member
   10024                            .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$172)
   10025                            .dwattr $C$DW$631, DW_AT_name("ed")
   10026                            .dwattr $C$DW$631, DW_AT_TI_symbol_name("ed")
   10027                            .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   10028                            .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
   10029                            .dwattr $C$DW$631, DW_AT_decl_file("../App/flight.h")
   10030                            .dwattr $C$DW$631, DW_AT_decl_line(0x10)
   10031                            .dwattr $C$DW$631, DW_AT_decl_column(0x18)
   10032                    
   10033                    $C$DW$632       .dwtag  DW_TAG_member
   10034                            .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$172)
   10035                            .dwattr $C$DW$632, DW_AT_name("y")
   10036                            .dwattr $C$DW$632, DW_AT_TI_symbol_name("y")
   10037                            .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10038                            .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
   10039                            .dwattr $C$DW$632, DW_AT_decl_file("../App/flight.h")
   10040                            .dwattr $C$DW$632, DW_AT_decl_line(0x11)
   10041                            .dwattr $C$DW$632, DW_AT_decl_column(0x18)
   10042                    
   10043                            .dwattr $C$DW$T$174, DW_AT_decl_file("../App/flight.h")
   10044                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x03)
   10045                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x11)
   10046                            .dwendtag $C$DW$T$174
   10047                    
   10048                    $C$DW$T$748     .dwtag  DW_TAG_typedef
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  184

   10049                            .dwattr $C$DW$T$748, DW_AT_name("PID_t")
   10050                            .dwattr $C$DW$T$748, DW_AT_type(*$C$DW$T$174)
   10051                            .dwattr $C$DW$T$748, DW_AT_language(DW_LANG_C)
   10052                            .dwattr $C$DW$T$748, DW_AT_decl_file("../App/flight.h")
   10053                            .dwattr $C$DW$T$748, DW_AT_decl_line(0x11)
   10054                            .dwattr $C$DW$T$748, DW_AT_decl_column(0x1d)
   10055                    
   10056                    $C$DW$T$749     .dwtag  DW_TAG_pointer_type
   10057                            .dwattr $C$DW$T$749, DW_AT_type(*$C$DW$T$748)
   10058                            .dwattr $C$DW$T$749, DW_AT_address_class(0x20)
   10059                    
   10060                    
   10061                    $C$DW$T$180     .dwtag  DW_TAG_structure_type
   10062                            .dwattr $C$DW$T$180, DW_AT_byte_size(0xdc)
   10063                    $C$DW$633       .dwtag  DW_TAG_member
   10064                            .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$176)
   10065                            .dwattr $C$DW$633, DW_AT_name("tmp")
   10066                            .dwattr $C$DW$633, DW_AT_TI_symbol_name("tmp")
   10067                            .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10068                            .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
   10069                            .dwattr $C$DW$633, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10070                            .dwattr $C$DW$633, DW_AT_decl_line(0x18)
   10071                            .dwattr $C$DW$633, DW_AT_decl_column(0x1b)
   10072                    
   10073                    $C$DW$634       .dwtag  DW_TAG_member
   10074                            .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$177)
   10075                            .dwattr $C$DW$634, DW_AT_name("ofs")
   10076                            .dwattr $C$DW$634, DW_AT_TI_symbol_name("ofs")
   10077                            .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10078                            .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
   10079                            .dwattr $C$DW$634, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10080                            .dwattr $C$DW$634, DW_AT_decl_line(0x19)
   10081                            .dwattr $C$DW$634, DW_AT_decl_column(0x1b)
   10082                    
   10083                    $C$DW$635       .dwtag  DW_TAG_member
   10084                            .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$172)
   10085                            .dwattr $C$DW$635, DW_AT_name("fsA")
   10086                            .dwattr $C$DW$635, DW_AT_TI_symbol_name("fsA")
   10087                            .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10088                            .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
   10089                            .dwattr $C$DW$635, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10090                            .dwattr $C$DW$635, DW_AT_decl_line(0x1a)
   10091                            .dwattr $C$DW$635, DW_AT_decl_column(0x1b)
   10092                    
   10093                    $C$DW$636       .dwtag  DW_TAG_member
   10094                            .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$172)
   10095                            .dwattr $C$DW$636, DW_AT_name("fsG")
   10096                            .dwattr $C$DW$636, DW_AT_TI_symbol_name("fsG")
   10097                            .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10098                            .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
   10099                            .dwattr $C$DW$636, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10100                            .dwattr $C$DW$636, DW_AT_decl_line(0x1b)
   10101                            .dwattr $C$DW$636, DW_AT_decl_column(0x1b)
   10102                    
   10103                    $C$DW$637       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  185

   10104                            .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$177)
   10105                            .dwattr $C$DW$637, DW_AT_name("raw")
   10106                            .dwattr $C$DW$637, DW_AT_TI_symbol_name("raw")
   10107                            .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10108                            .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
   10109                            .dwattr $C$DW$637, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10110                            .dwattr $C$DW$637, DW_AT_decl_line(0x1c)
   10111                            .dwattr $C$DW$637, DW_AT_decl_column(0x1b)
   10112                    
   10113                    $C$DW$638       .dwtag  DW_TAG_member
   10114                            .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$177)
   10115                            .dwattr $C$DW$638, DW_AT_name("val")
   10116                            .dwattr $C$DW$638, DW_AT_TI_symbol_name("val")
   10117                            .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10118                            .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
   10119                            .dwattr $C$DW$638, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10120                            .dwattr $C$DW$638, DW_AT_decl_line(0x1d)
   10121                            .dwattr $C$DW$638, DW_AT_decl_column(0x1b)
   10122                    
   10123                    $C$DW$639       .dwtag  DW_TAG_member
   10124                            .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$177)
   10125                            .dwattr $C$DW$639, DW_AT_name("phy")
   10126                            .dwattr $C$DW$639, DW_AT_TI_symbol_name("phy")
   10127                            .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   10128                            .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
   10129                            .dwattr $C$DW$639, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10130                            .dwattr $C$DW$639, DW_AT_decl_line(0x1e)
   10131                            .dwattr $C$DW$639, DW_AT_decl_column(0x1b)
   10132                    
   10133                    $C$DW$640       .dwtag  DW_TAG_member
   10134                            .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$178)
   10135                            .dwattr $C$DW$640, DW_AT_name("avg")
   10136                            .dwattr $C$DW$640, DW_AT_TI_symbol_name("avg")
   10137                            .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
   10138                            .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
   10139                            .dwattr $C$DW$640, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10140                            .dwattr $C$DW$640, DW_AT_decl_line(0x1f)
   10141                            .dwattr $C$DW$640, DW_AT_decl_column(0x1b)
   10142                    
   10143                    $C$DW$641       .dwtag  DW_TAG_member
   10144                            .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$172)
   10145                            .dwattr $C$DW$641, DW_AT_name("tem")
   10146                            .dwattr $C$DW$641, DW_AT_TI_symbol_name("tem")
   10147                            .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
   10148                            .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
   10149                            .dwattr $C$DW$641, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10150                            .dwattr $C$DW$641, DW_AT_decl_line(0x20)
   10151                            .dwattr $C$DW$641, DW_AT_decl_column(0x1b)
   10152                    
   10153                    $C$DW$642       .dwtag  DW_TAG_member
   10154                            .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$179)
   10155                            .dwattr $C$DW$642, DW_AT_name("irq")
   10156                            .dwattr $C$DW$642, DW_AT_TI_symbol_name("irq")
   10157                            .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
   10158                            .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  186

   10159                            .dwattr $C$DW$642, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10160                            .dwattr $C$DW$642, DW_AT_decl_line(0x21)
   10161                            .dwattr $C$DW$642, DW_AT_decl_column(0x1b)
   10162                    
   10163                    $C$DW$643       .dwtag  DW_TAG_member
   10164                            .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$179)
   10165                            .dwattr $C$DW$643, DW_AT_name("cn0")
   10166                            .dwattr $C$DW$643, DW_AT_TI_symbol_name("cn0")
   10167                            .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
   10168                            .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
   10169                            .dwattr $C$DW$643, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10170                            .dwattr $C$DW$643, DW_AT_decl_line(0x22)
   10171                            .dwattr $C$DW$643, DW_AT_decl_column(0x1b)
   10172                    
   10173                    $C$DW$644       .dwtag  DW_TAG_member
   10174                            .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$179)
   10175                            .dwattr $C$DW$644, DW_AT_name("cn1")
   10176                            .dwattr $C$DW$644, DW_AT_TI_symbol_name("cn1")
   10177                            .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
   10178                            .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
   10179                            .dwattr $C$DW$644, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10180                            .dwattr $C$DW$644, DW_AT_decl_line(0x23)
   10181                            .dwattr $C$DW$644, DW_AT_decl_column(0x1b)
   10182                    
   10183                            .dwattr $C$DW$T$180, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10184                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x18)
   10185                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x10)
   10186                            .dwendtag $C$DW$T$180
   10187                    
   10188                    $C$DW$T$750     .dwtag  DW_TAG_typedef
   10189                            .dwattr $C$DW$T$750, DW_AT_name("MPU_t")
   10190                            .dwattr $C$DW$T$750, DW_AT_type(*$C$DW$T$180)
   10191                            .dwattr $C$DW$T$750, DW_AT_language(DW_LANG_C)
   10192                            .dwattr $C$DW$T$750, DW_AT_decl_file("/home/merdak/KOLTEST/TIV10/Quad/MPU9250/inv_mpu.h")
   10193                            .dwattr $C$DW$T$750, DW_AT_decl_line(0x24)
   10194                            .dwattr $C$DW$T$750, DW_AT_decl_column(0x12)
   10195                    
   10196                    
   10197                    $C$DW$T$181     .dwtag  DW_TAG_structure_type
   10198                            .dwattr $C$DW$T$181, DW_AT_byte_size(0x10)
   10199                    $C$DW$645       .dwtag  DW_TAG_member
   10200                            .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$14)
   10201                            .dwattr $C$DW$645, DW_AT_name("__max_align1")
   10202                            .dwattr $C$DW$645, DW_AT_TI_symbol_name("__max_align1")
   10203                            .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10204                            .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
   10205                            .dwattr $C$DW$645, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
   10206                            .dwattr $C$DW$645, DW_AT_decl_line(0x7b)
   10207                            .dwattr $C$DW$645, DW_AT_decl_column(0x0c)
   10208                    
   10209                    $C$DW$646       .dwtag  DW_TAG_member
   10210                            .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$18)
   10211                            .dwattr $C$DW$646, DW_AT_name("__max_align2")
   10212                            .dwattr $C$DW$646, DW_AT_TI_symbol_name("__max_align2")
   10213                            .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  187

   10214                            .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
   10215                            .dwattr $C$DW$646, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-arm
   10216                            .dwattr $C$DW$646, DW_AT_decl_line(0x7c)
   10217                            .dwattr $C$DW$646, DW_AT_decl_column(0x0e)
   10218                    
   10219                            .dwattr $C$DW$T$181, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-a
   10220                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x7a)
   10221                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x10)
   10222                            .dwendtag $C$DW$T$181
   10223                    
   10224                    $C$DW$T$751     .dwtag  DW_TAG_typedef
   10225                            .dwattr $C$DW$T$751, DW_AT_name("__max_align_t")
   10226                            .dwattr $C$DW$T$751, DW_AT_type(*$C$DW$T$181)
   10227                            .dwattr $C$DW$T$751, DW_AT_language(DW_LANG_C)
   10228                            .dwattr $C$DW$T$751, DW_AT_decl_file("/home/merdak/Apps/ti/ccs1020/ccs/tools/compiler/ti-cgt-a
   10229                            .dwattr $C$DW$T$751, DW_AT_decl_line(0x7d)
   10230                            .dwattr $C$DW$T$751, DW_AT_decl_column(0x03)
   10231                    
   10232                    
   10233                    $C$DW$T$184     .dwtag  DW_TAG_structure_type
   10234                            .dwattr $C$DW$T$184, DW_AT_byte_size(0x08)
   10235                    $C$DW$647       .dwtag  DW_TAG_member
   10236                            .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$10)
   10237                            .dwattr $C$DW$647, DW_AT_name("length")
   10238                            .dwattr $C$DW$647, DW_AT_TI_symbol_name("length")
   10239                            .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10240                            .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
   10241                            .dwattr $C$DW$647, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
   10242                            .dwattr $C$DW$647, DW_AT_decl_line(0x165)
   10243                            .dwattr $C$DW$647, DW_AT_decl_column(0x16)
   10244                    
   10245                    $C$DW$648       .dwtag  DW_TAG_member
   10246                            .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$183)
   10247                            .dwattr $C$DW$648, DW_AT_name("elem")
   10248                            .dwattr $C$DW$648, DW_AT_TI_symbol_name("elem")
   10249                            .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10250                            .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
   10251                            .dwattr $C$DW$648, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
   10252                            .dwattr $C$DW$648, DW_AT_decl_line(0x165)
   10253                            .dwattr $C$DW$648, DW_AT_decl_column(0x3a)
   10254                    
   10255                            .dwattr $C$DW$T$184, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10256                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x165)
   10257                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x10)
   10258                            .dwendtag $C$DW$T$184
   10259                    
   10260                    $C$DW$T$752     .dwtag  DW_TAG_typedef
   10261                            .dwattr $C$DW$T$752, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
   10262                            .dwattr $C$DW$T$752, DW_AT_type(*$C$DW$T$184)
   10263                            .dwattr $C$DW$T$752, DW_AT_language(DW_LANG_C)
   10264                            .dwattr $C$DW$T$752, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10265                            .dwattr $C$DW$T$752, DW_AT_decl_line(0x165)
   10266                            .dwattr $C$DW$T$752, DW_AT_decl_column(0x42)
   10267                    
   10268                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  188

   10269                    $C$DW$T$187     .dwtag  DW_TAG_structure_type
   10270                            .dwattr $C$DW$T$187, DW_AT_byte_size(0x08)
   10271                    $C$DW$649       .dwtag  DW_TAG_member
   10272                            .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$10)
   10273                            .dwattr $C$DW$649, DW_AT_name("length")
   10274                            .dwattr $C$DW$649, DW_AT_TI_symbol_name("length")
   10275                            .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10276                            .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
   10277                            .dwattr $C$DW$649, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
   10278                            .dwattr $C$DW$649, DW_AT_decl_line(0x166)
   10279                            .dwattr $C$DW$649, DW_AT_decl_column(0x16)
   10280                    
   10281                    $C$DW$650       .dwtag  DW_TAG_member
   10282                            .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$186)
   10283                            .dwattr $C$DW$650, DW_AT_name("elem")
   10284                            .dwattr $C$DW$650, DW_AT_TI_symbol_name("elem")
   10285                            .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10286                            .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
   10287                            .dwattr $C$DW$650, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
   10288                            .dwattr $C$DW$650, DW_AT_decl_line(0x166)
   10289                            .dwattr $C$DW$650, DW_AT_decl_column(0x40)
   10290                    
   10291                            .dwattr $C$DW$T$187, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10292                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x166)
   10293                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x10)
   10294                            .dwendtag $C$DW$T$187
   10295                    
   10296                    $C$DW$T$753     .dwtag  DW_TAG_typedef
   10297                            .dwattr $C$DW$T$753, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
   10298                            .dwattr $C$DW$T$753, DW_AT_type(*$C$DW$T$187)
   10299                            .dwattr $C$DW$T$753, DW_AT_language(DW_LANG_C)
   10300                            .dwattr $C$DW$T$753, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10301                            .dwattr $C$DW$T$753, DW_AT_decl_line(0x166)
   10302                            .dwattr $C$DW$T$753, DW_AT_decl_column(0x48)
   10303                    
   10304                    $C$DW$T$754     .dwtag  DW_TAG_typedef
   10305                            .dwattr $C$DW$T$754, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
   10306                            .dwattr $C$DW$T$754, DW_AT_type(*$C$DW$T$753)
   10307                            .dwattr $C$DW$T$754, DW_AT_language(DW_LANG_C)
   10308                            .dwattr $C$DW$T$754, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10309                            .dwattr $C$DW$T$754, DW_AT_decl_line(0x168)
   10310                            .dwattr $C$DW$T$754, DW_AT_decl_column(0x2a)
   10311                    
   10312                    $C$DW$T$755     .dwtag  DW_TAG_typedef
   10313                            .dwattr $C$DW$T$755, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
   10314                            .dwattr $C$DW$T$755, DW_AT_type(*$C$DW$T$753)
   10315                            .dwattr $C$DW$T$755, DW_AT_language(DW_LANG_C)
   10316                            .dwattr $C$DW$T$755, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10317                            .dwattr $C$DW$T$755, DW_AT_decl_line(0x167)
   10318                            .dwattr $C$DW$T$755, DW_AT_decl_column(0x2a)
   10319                    
   10320                    
   10321                    $C$DW$T$190     .dwtag  DW_TAG_structure_type
   10322                            .dwattr $C$DW$T$190, DW_AT_byte_size(0x08)
   10323                    $C$DW$651       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  189

   10324                            .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$10)
   10325                            .dwattr $C$DW$651, DW_AT_name("length")
   10326                            .dwattr $C$DW$651, DW_AT_TI_symbol_name("length")
   10327                            .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10328                            .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
   10329                            .dwattr $C$DW$651, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
   10330                            .dwattr $C$DW$651, DW_AT_decl_line(0x29b)
   10331                            .dwattr $C$DW$651, DW_AT_decl_column(0x16)
   10332                    
   10333                    $C$DW$652       .dwtag  DW_TAG_member
   10334                            .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$189)
   10335                            .dwattr $C$DW$652, DW_AT_name("elem")
   10336                            .dwattr $C$DW$652, DW_AT_TI_symbol_name("elem")
   10337                            .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10338                            .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
   10339                            .dwattr $C$DW$652, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
   10340                            .dwattr $C$DW$652, DW_AT_decl_line(0x29b)
   10341                            .dwattr $C$DW$652, DW_AT_decl_column(0x3b)
   10342                    
   10343                            .dwattr $C$DW$T$190, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10344                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x29b)
   10345                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x10)
   10346                            .dwendtag $C$DW$T$190
   10347                    
   10348                    $C$DW$T$756     .dwtag  DW_TAG_typedef
   10349                            .dwattr $C$DW$T$756, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
   10350                            .dwattr $C$DW$T$756, DW_AT_type(*$C$DW$T$190)
   10351                            .dwattr $C$DW$T$756, DW_AT_language(DW_LANG_C)
   10352                            .dwattr $C$DW$T$756, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10353                            .dwattr $C$DW$T$756, DW_AT_decl_line(0x29b)
   10354                            .dwattr $C$DW$T$756, DW_AT_decl_column(0x43)
   10355                    
   10356                    
   10357                    $C$DW$T$193     .dwtag  DW_TAG_structure_type
   10358                            .dwattr $C$DW$T$193, DW_AT_byte_size(0x08)
   10359                    $C$DW$653       .dwtag  DW_TAG_member
   10360                            .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$10)
   10361                            .dwattr $C$DW$653, DW_AT_name("length")
   10362                            .dwattr $C$DW$653, DW_AT_TI_symbol_name("length")
   10363                            .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10364                            .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
   10365                            .dwattr $C$DW$653, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
   10366                            .dwattr $C$DW$653, DW_AT_decl_line(0x29c)
   10367                            .dwattr $C$DW$653, DW_AT_decl_column(0x16)
   10368                    
   10369                    $C$DW$654       .dwtag  DW_TAG_member
   10370                            .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$192)
   10371                            .dwattr $C$DW$654, DW_AT_name("elem")
   10372                            .dwattr $C$DW$654, DW_AT_TI_symbol_name("elem")
   10373                            .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10374                            .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
   10375                            .dwattr $C$DW$654, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirtos/
   10376                            .dwattr $C$DW$654, DW_AT_decl_line(0x29c)
   10377                            .dwattr $C$DW$654, DW_AT_decl_column(0x41)
   10378                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  190

   10379                            .dwattr $C$DW$T$193, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10380                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x29c)
   10381                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x10)
   10382                            .dwendtag $C$DW$T$193
   10383                    
   10384                    $C$DW$T$757     .dwtag  DW_TAG_typedef
   10385                            .dwattr $C$DW$T$757, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
   10386                            .dwattr $C$DW$T$757, DW_AT_type(*$C$DW$T$193)
   10387                            .dwattr $C$DW$T$757, DW_AT_language(DW_LANG_C)
   10388                            .dwattr $C$DW$T$757, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10389                            .dwattr $C$DW$T$757, DW_AT_decl_line(0x29c)
   10390                            .dwattr $C$DW$T$757, DW_AT_decl_column(0x49)
   10391                    
   10392                    $C$DW$T$758     .dwtag  DW_TAG_typedef
   10393                            .dwattr $C$DW$T$758, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
   10394                            .dwattr $C$DW$T$758, DW_AT_type(*$C$DW$T$757)
   10395                            .dwattr $C$DW$T$758, DW_AT_language(DW_LANG_C)
   10396                            .dwattr $C$DW$T$758, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10397                            .dwattr $C$DW$T$758, DW_AT_decl_line(0x29e)
   10398                            .dwattr $C$DW$T$758, DW_AT_decl_column(0x2b)
   10399                    
   10400                    $C$DW$T$759     .dwtag  DW_TAG_typedef
   10401                            .dwattr $C$DW$T$759, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
   10402                            .dwattr $C$DW$T$759, DW_AT_type(*$C$DW$T$757)
   10403                            .dwattr $C$DW$T$759, DW_AT_language(DW_LANG_C)
   10404                            .dwattr $C$DW$T$759, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/kernel/tirto
   10405                            .dwattr $C$DW$T$759, DW_AT_decl_line(0x29d)
   10406                            .dwattr $C$DW$T$759, DW_AT_decl_column(0x2b)
   10407                    
   10408                    
   10409                    $C$DW$T$236     .dwtag  DW_TAG_structure_type
   10410                            .dwattr $C$DW$T$236, DW_AT_byte_size(0x4c)
   10411                    $C$DW$655       .dwtag  DW_TAG_member
   10412                            .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$199)
   10413                            .dwattr $C$DW$655, DW_AT_name("Crc32")
   10414                            .dwattr $C$DW$655, DW_AT_TI_symbol_name("Crc32")
   10415                            .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10416                            .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
   10417                            .dwattr $C$DW$655, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10418                            .dwattr $C$DW$655, DW_AT_decl_line(0x76)
   10419                            .dwattr $C$DW$655, DW_AT_decl_column(0x25)
   10420                    
   10421                    $C$DW$656       .dwtag  DW_TAG_member
   10422                            .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$202)
   10423                            .dwattr $C$DW$656, DW_AT_name("FlashGetSize")
   10424                            .dwattr $C$DW$656, DW_AT_TI_symbol_name("FlashGetSize")
   10425                            .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10426                            .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
   10427                            .dwattr $C$DW$656, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10428                            .dwattr $C$DW$656, DW_AT_decl_line(0x77)
   10429                            .dwattr $C$DW$656, DW_AT_decl_column(0x25)
   10430                    
   10431                    $C$DW$657       .dwtag  DW_TAG_member
   10432                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$203)
   10433                            .dwattr $C$DW$657, DW_AT_name("GetChipId")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  191

   10434                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("GetChipId")
   10435                            .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10436                            .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
   10437                            .dwattr $C$DW$657, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10438                            .dwattr $C$DW$657, DW_AT_decl_line(0x78)
   10439                            .dwattr $C$DW$657, DW_AT_decl_column(0x25)
   10440                    
   10441                    $C$DW$658       .dwtag  DW_TAG_member
   10442                            .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$206)
   10443                            .dwattr $C$DW$658, DW_AT_name("ReservedLocation1")
   10444                            .dwattr $C$DW$658, DW_AT_TI_symbol_name("ReservedLocation1")
   10445                            .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10446                            .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
   10447                            .dwattr $C$DW$658, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10448                            .dwattr $C$DW$658, DW_AT_decl_line(0x79)
   10449                            .dwattr $C$DW$658, DW_AT_decl_column(0x25)
   10450                    
   10451                    $C$DW$659       .dwtag  DW_TAG_member
   10452                            .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$207)
   10453                            .dwattr $C$DW$659, DW_AT_name("ReservedLocation2")
   10454                            .dwattr $C$DW$659, DW_AT_TI_symbol_name("ReservedLocation2")
   10455                            .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10456                            .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
   10457                            .dwattr $C$DW$659, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10458                            .dwattr $C$DW$659, DW_AT_decl_line(0x7a)
   10459                            .dwattr $C$DW$659, DW_AT_decl_column(0x25)
   10460                    
   10461                    $C$DW$660       .dwtag  DW_TAG_member
   10462                            .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$208)
   10463                            .dwattr $C$DW$660, DW_AT_name("ReservedLocation3")
   10464                            .dwattr $C$DW$660, DW_AT_TI_symbol_name("ReservedLocation3")
   10465                            .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10466                            .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
   10467                            .dwattr $C$DW$660, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10468                            .dwattr $C$DW$660, DW_AT_decl_line(0x7b)
   10469                            .dwattr $C$DW$660, DW_AT_decl_column(0x25)
   10470                    
   10471                    $C$DW$661       .dwtag  DW_TAG_member
   10472                            .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$211)
   10473                            .dwattr $C$DW$661, DW_AT_name("ResetDevice")
   10474                            .dwattr $C$DW$661, DW_AT_TI_symbol_name("ResetDevice")
   10475                            .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10476                            .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
   10477                            .dwattr $C$DW$661, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10478                            .dwattr $C$DW$661, DW_AT_decl_line(0x7c)
   10479                            .dwattr $C$DW$661, DW_AT_decl_column(0x25)
   10480                    
   10481                    $C$DW$662       .dwtag  DW_TAG_member
   10482                            .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$217)
   10483                            .dwattr $C$DW$662, DW_AT_name("Fletcher32")
   10484                            .dwattr $C$DW$662, DW_AT_TI_symbol_name("Fletcher32")
   10485                            .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10486                            .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
   10487                            .dwattr $C$DW$662, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10488                            .dwattr $C$DW$662, DW_AT_decl_line(0x7d)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  192

   10489                            .dwattr $C$DW$662, DW_AT_decl_column(0x25)
   10490                    
   10491                    $C$DW$663       .dwtag  DW_TAG_member
   10492                            .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$221)
   10493                            .dwattr $C$DW$663, DW_AT_name("MinValue")
   10494                            .dwattr $C$DW$663, DW_AT_TI_symbol_name("MinValue")
   10495                            .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   10496                            .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
   10497                            .dwattr $C$DW$663, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10498                            .dwattr $C$DW$663, DW_AT_decl_line(0x7e)
   10499                            .dwattr $C$DW$663, DW_AT_decl_column(0x25)
   10500                    
   10501                    $C$DW$664       .dwtag  DW_TAG_member
   10502                            .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$222)
   10503                            .dwattr $C$DW$664, DW_AT_name("MaxValue")
   10504                            .dwattr $C$DW$664, DW_AT_TI_symbol_name("MaxValue")
   10505                            .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   10506                            .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
   10507                            .dwattr $C$DW$664, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10508                            .dwattr $C$DW$664, DW_AT_decl_line(0x7f)
   10509                            .dwattr $C$DW$664, DW_AT_decl_column(0x25)
   10510                    
   10511                    $C$DW$665       .dwtag  DW_TAG_member
   10512                            .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$223)
   10513                            .dwattr $C$DW$665, DW_AT_name("MeanValue")
   10514                            .dwattr $C$DW$665, DW_AT_TI_symbol_name("MeanValue")
   10515                            .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   10516                            .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
   10517                            .dwattr $C$DW$665, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10518                            .dwattr $C$DW$665, DW_AT_decl_line(0x80)
   10519                            .dwattr $C$DW$665, DW_AT_decl_column(0x25)
   10520                    
   10521                    $C$DW$666       .dwtag  DW_TAG_member
   10522                            .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$224)
   10523                            .dwattr $C$DW$666, DW_AT_name("StandDeviationValue")
   10524                            .dwattr $C$DW$666, DW_AT_TI_symbol_name("StandDeviationValue")
   10525                            .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   10526                            .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
   10527                            .dwattr $C$DW$666, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10528                            .dwattr $C$DW$666, DW_AT_decl_line(0x81)
   10529                            .dwattr $C$DW$666, DW_AT_decl_column(0x25)
   10530                    
   10531                    $C$DW$667       .dwtag  DW_TAG_member
   10532                            .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$227)
   10533                            .dwattr $C$DW$667, DW_AT_name("ReservedLocation4")
   10534                            .dwattr $C$DW$667, DW_AT_TI_symbol_name("ReservedLocation4")
   10535                            .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   10536                            .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
   10537                            .dwattr $C$DW$667, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10538                            .dwattr $C$DW$667, DW_AT_decl_line(0x82)
   10539                            .dwattr $C$DW$667, DW_AT_decl_column(0x25)
   10540                    
   10541                    $C$DW$668       .dwtag  DW_TAG_member
   10542                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$228)
   10543                            .dwattr $C$DW$668, DW_AT_name("ReservedLocation5")
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  193

   10544                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("ReservedLocation5")
   10545                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   10546                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
   10547                            .dwattr $C$DW$668, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10548                            .dwattr $C$DW$668, DW_AT_decl_line(0x83)
   10549                            .dwattr $C$DW$668, DW_AT_decl_column(0x25)
   10550                    
   10551                    $C$DW$669       .dwtag  DW_TAG_member
   10552                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$229)
   10553                            .dwattr $C$DW$669, DW_AT_name("HFSourceSafeSwitch")
   10554                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
   10555                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10556                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
   10557                            .dwattr $C$DW$669, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10558                            .dwattr $C$DW$669, DW_AT_decl_line(0x84)
   10559                            .dwattr $C$DW$669, DW_AT_decl_column(0x25)
   10560                    
   10561                    $C$DW$670       .dwtag  DW_TAG_member
   10562                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$232)
   10563                            .dwattr $C$DW$670, DW_AT_name("SelectCompAInput")
   10564                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("SelectCompAInput")
   10565                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10566                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
   10567                            .dwattr $C$DW$670, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10568                            .dwattr $C$DW$670, DW_AT_decl_line(0x85)
   10569                            .dwattr $C$DW$670, DW_AT_decl_column(0x25)
   10570                    
   10571                    $C$DW$671       .dwtag  DW_TAG_member
   10572                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$233)
   10573                            .dwattr $C$DW$671, DW_AT_name("SelectCompARef")
   10574                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("SelectCompARef")
   10575                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10576                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
   10577                            .dwattr $C$DW$671, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10578                            .dwattr $C$DW$671, DW_AT_decl_line(0x86)
   10579                            .dwattr $C$DW$671, DW_AT_decl_column(0x25)
   10580                    
   10581                    $C$DW$672       .dwtag  DW_TAG_member
   10582                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$234)
   10583                            .dwattr $C$DW$672, DW_AT_name("SelectADCCompBInput")
   10584                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("SelectADCCompBInput")
   10585                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10586                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
   10587                            .dwattr $C$DW$672, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10588                            .dwattr $C$DW$672, DW_AT_decl_line(0x87)
   10589                            .dwattr $C$DW$672, DW_AT_decl_column(0x25)
   10590                    
   10591                    $C$DW$673       .dwtag  DW_TAG_member
   10592                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$235)
   10593                            .dwattr $C$DW$673, DW_AT_name("SelectCompBRef")
   10594                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("SelectCompBRef")
   10595                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   10596                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
   10597                            .dwattr $C$DW$673, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/devi
   10598                            .dwattr $C$DW$673, DW_AT_decl_line(0x88)
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  194

   10599                            .dwattr $C$DW$673, DW_AT_decl_column(0x25)
   10600                    
   10601                            .dwattr $C$DW$T$236, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
   10602                            .dwattr $C$DW$T$236, DW_AT_decl_line(0x75)
   10603                            .dwattr $C$DW$T$236, DW_AT_decl_column(0x01)
   10604                            .dwendtag $C$DW$T$236
   10605                    
   10606                    $C$DW$T$760     .dwtag  DW_TAG_typedef
   10607                            .dwattr $C$DW$T$760, DW_AT_name("HARD_API_T")
   10608                            .dwattr $C$DW$T$760, DW_AT_type(*$C$DW$T$236)
   10609                            .dwattr $C$DW$T$760, DW_AT_language(DW_LANG_C)
   10610                            .dwattr $C$DW$T$760, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/de
   10611                            .dwattr $C$DW$T$760, DW_AT_decl_line(0x89)
   10612                            .dwattr $C$DW$T$760, DW_AT_decl_column(0x03)
   10613                    
   10614                    
   10615                    $C$DW$T$237     .dwtag  DW_TAG_structure_type
   10616                            .dwattr $C$DW$T$237, DW_AT_byte_size(0x08)
   10617                    $C$DW$674       .dwtag  DW_TAG_member
   10618                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$3)
   10619                            .dwattr $C$DW$674, DW_AT_name("custom")
   10620                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("custom")
   10621                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10622                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
   10623                            .dwattr $C$DW$674, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   10624                            .dwattr $C$DW$674, DW_AT_decl_line(0x103)
   10625                            .dwattr $C$DW$674, DW_AT_decl_column(0x0e)
   10626                    
   10627                    $C$DW$675       .dwtag  DW_TAG_member
   10628                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$166)
   10629                            .dwattr $C$DW$675, DW_AT_name("isProtected")
   10630                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("isProtected")
   10631                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10632                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
   10633                            .dwattr $C$DW$675, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/driv
   10634                            .dwattr $C$DW$675, DW_AT_decl_line(0x105)
   10635                            .dwattr $C$DW$675, DW_AT_decl_column(0x0d)
   10636                    
   10637                            .dwattr $C$DW$T$237, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   10638                            .dwattr $C$DW$T$237, DW_AT_decl_line(0x102)
   10639                            .dwattr $C$DW$T$237, DW_AT_decl_column(0x10)
   10640                            .dwendtag $C$DW$T$237
   10641                    
   10642                    $C$DW$T$253     .dwtag  DW_TAG_typedef
   10643                            .dwattr $C$DW$T$253, DW_AT_name("ADC_Params")
   10644                            .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$T$237)
   10645                            .dwattr $C$DW$T$253, DW_AT_language(DW_LANG_C)
   10646                            .dwattr $C$DW$T$253, DW_AT_decl_file("/root/ti/simplelink_cc2640r2_sdk_4_40_00_10/source/ti/dr
   10647                            .dwattr $C$DW$T$253, DW_AT_decl_line(0x10c)
   10648                            .dwattr $C$DW$T$253, DW_AT_decl_column(0x03)
   10649                    
   10650                    $C$DW$T$254     .dwtag  DW_TAG_pointer_type
   10651                            .dwattr $C$DW$T$254, DW_AT_type(*$C$DW$T$253)
   10652                            .dwattr $C$DW$T$254, DW_AT_address_class(0x20)
   10653                    
TI ARM Assembler Unix v20.2.4 Fri Apr  2 00:57:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
flight.asm                                                           PAGE  195

   10654                    
   10655                    $C$DW$T$258     .dwtag  DW_TAG_structure_type
   10656                            .dwattr $C$DW$T$258, DW_AT_byte_size(0x18)
   10657                    $C$DW$676       .dwtag  DW_TAG_member
   10658                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$242)
   10659                            .dwattr $C$DW$676, DW_AT_name("closeFxn")
   10660                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("closeFxn")
   10661                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
